{
  "backend/main.mo": "Main Motoko actor that defines types and storage maps for Documents, Resumes, and Image Metadata, using a blob storage mixin for file handling on the Internet Computer.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs to their associated source files, component dependencies, and test IDs for tracking build requirements.",
  "frontend-file-summaries.txt": "JSON catalog of short summaries for all frontend source files, describing the purpose and key characteristics of each page, component, and utility in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property tokens for light and dark themes including colors, borders, and sidebar variables.",
  "frontend/index.html": "Root HTML shell for the React app with viewport meta, font preconnect hints, and a single root div that loads the main TSX entry point.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and pointing to the sitemap at docmastertools.com.",
  "frontend/public/sitemap.xml": "XML sitemap listing all public URLs for docmastertools.com with last-modified dates, change frequencies, and priority values for SEO.",
  "frontend/src/App.tsx": "Root React component that lazy-loads all pages and implements state-based client-side routing, mapping path-style keys to page components with navigation props.",
  "frontend/src/components/AdPlaceholder.tsx": "Reusable ad placeholder component that renders a sized, labeled box for banner, in-content, or sidebar ad slots using aspect-ratio styling.",
  "frontend/src/components/AdvancedToolShell.tsx": "A reusable shell component for file-processing tools that manages a multi-step workflow (upload → settings → preview/download) with drag-and-drop support, file metadata display, and single or multiple file handling.",
  "frontend/src/components/BackToHomeButton.tsx": "A simple button component that navigates the user back to the home page, using either a provided onNavigate callback or direct window.location assignment.",
  "frontend/src/components/BatchFileQueue.tsx": "Displays a queue of batch-processed files with per-file status icons (pending, processing, done, error), individual download buttons, and bulk download/clear actions.",
  "frontend/src/components/BreadcrumbNavigation.tsx": "Renders an accessible breadcrumb nav with Schema.org BreadcrumbList JSON-LD injection, supporting click handlers, path-based navigation, and a Home icon for the first item.",
  "frontend/src/components/calculators/AgeCalculator.tsx": "A calculator component that takes a birth date input and computes the user's age in years/months/days along with totals in months, weeks, days, and hours, plus days until the next birthday.",
  "frontend/src/components/calculators/BMICalculator.tsx": "A BMI calculator supporting kg/lbs weight and cm/feet-inches height inputs, displaying the computed BMI value, weight category, and healthy weight range.",
  "frontend/src/components/calculators/CGPACalculator.tsx": "A multi-semester CGPA calculator where users can add/remove semesters and courses with grade points and credits, computing the cumulative GPA across all entries.",
  "frontend/src/components/calculators/CGPAToPercentageConverter.tsx": "Converts a CGPA value to percentage using either the CBSE formula (×9.5) or an Engineering formula (×10), selectable via radio buttons.",
  "frontend/src/components/calculators/CompoundInterestCalculator.tsx": "A React component that calculates compound interest given principal, annual rate, time period, and compounding frequency, displaying the interest earned and final amount.",
  "frontend/src/components/calculators/DateDifferenceCalculator.tsx": "A React component that calculates the difference between two dates in years, months, days, weeks, and total days, with an option to exclude weekends.",
  "frontend/src/components/calculators/DiscountCalculator.tsx": "A React component that calculates discounted prices either from a discount percentage or a sale price, showing the discount amount and final price.",
  "frontend/src/components/calculators/DivisionCalculator.tsx": "A React component that determines academic division (First, Second, Third, or Fail) based on an entered percentage score, with a reference criteria table.",
  "frontend/src/components/calculators/EMICalculator.tsx": "A React component that computes monthly EMI, total interest, and total repayment amount for a loan given principal, annual interest rate, and tenure in months or years.",
  "frontend/src/components/calculators/GPACalculator.tsx": "A React component that calculates weighted GPA on a 4.0 or 10.0 scale from multiple courses, each with a grade and credit value, with support for adding or removing courses.",
  "frontend/src/components/calculators/GradeCalculator.tsx": "A React component that calculates weighted GPA from multiple courses using a 10-point letter grade scale, allowing dynamic addition and removal of course entries.",
  "frontend/src/components/calculators/GSTCalculator.tsx": "A React component that calculates GST by either adding it to a base amount or removing it from a total, supporting preset rates (5%, 12%, 18%, 28%) and a custom rate input.",
  "frontend/src/components/calculators/LoanCalculator.tsx": "A React component that computes loan repayment tenure in months/years given a loan amount, annual interest rate, and fixed monthly payment, also showing total interest and total repayment.",
  "frontend/src/components/calculators/MarksPercentageCalculator.tsx": "A React component that calculates the percentage from obtained and total marks, and displays a pass/fail result based on a 40% threshold.",
  "frontend/src/components/calculators/PercentageToCGPAConverter.tsx": "A React component that converts a percentage to CGPA using either the CBSE formula (÷9.5) or an Engineering formula (÷10), selectable via radio buttons.",
  "frontend/src/components/calculators/ProfitLossCalculator.tsx": "A React component that calculates profit or loss amount and percentage from cost price and selling price, with color-coded results for profit (green) and loss (red).",
  "frontend/src/components/calculators/SalaryHikeCalculator.tsx": "A React component that calculates salary hike either from a given percentage or from a desired salary amount, showing new salary, monthly/annual increments, and required hike percentage.",
  "frontend/src/components/calculators/SGPACalculator.tsx": "A React component that calculates SGPA by allowing users to add/remove courses with grade points and credits, displaying the weighted average on a 10.0 scale.",
  "frontend/src/components/calculators/SimpleInterestCalculator.tsx": "A React component that computes simple interest and total amount using the SI = (P × R × T) / 100 formula, with inputs for principal, rate, and time period.",
  "frontend/src/components/calculators/TimeDurationCalculator.tsx": "A React component that supports three time calculation modes: computing duration between two times, and adding or subtracting hours/minutes/seconds from a base time.",
  "frontend/src/components/CrossCategorySuggestions.tsx": "Shows a grid of cross-category tool suggestions (calculators, PDF tools, image tools) based on the current tool category, with navigation callbacks for each suggestion card.",
  "frontend/src/components/DownloadSection.tsx": "Renders a download UI for one or multiple processed files, displaying file names and sizes with download buttons, and optional actions to process another file or clear results.",
  "frontend/src/components/FAQSchema.tsx": "Injects a Schema.org FAQPage JSON-LD script tag into the page based on a provided array of question-and-answer pairs.",
  "frontend/src/components/FileUploadZone.tsx": "A drag-and-drop file upload zone component that validates file size, triggers a file-select callback, and renders a styled dropzone with a hidden file input.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand description, quick navigation links to internal pages and external sites, and a legal section, using an `onNavigate` callback for internal routing.",
  "frontend/src/components/Header.tsx": "Sticky top navigation header with a logo, desktop nav links, a mobile hamburger menu, and a language selector, supporting both internal page navigation and external URL links.",
  "frontend/src/components/Hero.tsx": "Hero section component displaying a headline, tagline, CTA buttons, key stats (private/tools/free), and a banner image for the Document Master Tools landing page.",
  "frontend/src/components/image-tools/AutoFeaturesPanel.tsx": "A React panel component offering automated image processing features including white background application via flood-fill, JPEG compression to a target KB size, and a 2×2 multi-copy A4 layout generator.",
  "frontend/src/components/image-tools/AutoPhotoSizeGenerator.tsx": "A React component that resizes and compresses uploaded images to match predefined photo presets (passport, Aadhaar, visa, etc.) or custom dimensions, with JPEG quality reduction to meet file size limits.",
  "frontend/src/components/image-tools/BackgroundChangerTool.tsx": "A React component that lets users upload an image, pick a background color (from presets or a color picker), and simulate replacing the background, then download the result.",
  "frontend/src/components/image-tools/BackgroundRemoverTool.tsx": "A React component that accepts an image upload and simulates AI-powered background removal, producing a PNG download with the background stripped.",
  "frontend/src/components/image-tools/BeforeAfterPreviewPanel.tsx": "A React component that displays original and processed images side-by-side (or individually) with zoom, rotation, crop-guide overlay, and optional watermark controls.",
  "frontend/src/components/image-tools/ExportOptionsPanel.tsx": "A React component that exports a processed image canvas to multiple formats (JPEG, PNG, WebP, PDF, multi-copy A4 layout), with pro-gated options and pure-JS PDF generation.",
  "frontend/src/components/image-tools/ImageCompressorTool.tsx": "A React component that allows users to upload an image, adjust a quality slider, and simulate compression to reduce file size, then download the compressed result.",
  "frontend/src/components/image-tools/PhotoKBResizerTool.tsx": "A React component that lets users upload an image and resize it to a specific file size (preset KB values or custom), then download the resized output.",
  "frontend/src/components/image-tools/PhotoResizeTool.tsx": "A React component for resizing photos with support for presets, multiple units (px/cm/mm/inches), aspect ratio locking, quality control, and optional target file size output.",
  "frontend/src/components/image-tools/ProPricingModal.tsx": "A modal component displaying Pro plan pricing (monthly ₹399 / yearly ₹3000) with a feature comparison table and activation buttons.",
  "frontend/src/components/LanguageSelector.tsx": "Dropdown UI component that lets users select a language from a supported list, persisting the choice via a `LanguageContext` and closing on outside clicks.",
  "frontend/src/components/pdf-tools/BasePDFTool.tsx": "A reusable base component for PDF tools that handles file upload, simulated processing, and download flow via configurable props.",
  "frontend/src/components/pdf-tools/ImageToPDFTool.tsx": "A PDF tool component that accepts multiple image uploads and simulates converting them into a downloadable PDF file.",
  "frontend/src/components/pdf-tools/PDFAddPageNumbersTool.tsx": "A thin wrapper around BasePDFTool configured to add page numbers to a PDF document.",
  "frontend/src/components/pdf-tools/PDFAddWatermarkTool.tsx": "A thin wrapper around BasePDFTool configured to apply a watermark to a PDF document.",
  "frontend/src/components/pdf-tools/PDFCompressTool.tsx": "A PDF compression tool component offering both automatic and manual (quality slider) compression modes with simulated size reduction and download.",
  "frontend/src/components/pdf-tools/PDFMergeTool.tsx": "A React component that allows users to upload multiple PDF files and merge them into a single document, with file list management, simulated processing, and download functionality.",
  "frontend/src/components/pdf-tools/PDFOCRTool.tsx": "A thin wrapper around BasePDFTool configured to perform OCR on scanned PDFs and output a searchable PDF document.",
  "frontend/src/components/pdf-tools/PDFPageCounterTool.tsx": "A thin wrapper around BasePDFTool configured to count pages in a PDF and output a plain-text report.",
  "frontend/src/components/pdf-tools/PDFPasswordProtectTool.tsx": "A thin wrapper around BasePDFTool configured to add password protection to a PDF document.",
  "frontend/src/components/pdf-tools/PDFPasswordUnlockTool.tsx": "A thin wrapper around BasePDFTool configured to remove password protection from a PDF document.",
  "frontend/src/components/pdf-tools/PDFRemoveBlankPagesTool.tsx": "A thin wrapper around BasePDFTool configured to detect and remove blank pages from a PDF document.",
  "frontend/src/components/pdf-tools/PDFReorderTool.tsx": "A thin wrapper around BasePDFTool configured to reorder pages within a PDF document.",
  "frontend/src/components/pdf-tools/PDFSignTool.tsx": "A thin wrapper around BasePDFTool configured to add a digital signature to a PDF document.",
  "frontend/src/components/pdf-tools/PDFSplitTool.tsx": "A React component that allows users to upload a PDF and split it into multiple files by specifying page ranges, with simulated processing and per-file download support.",
  "frontend/src/components/pdf-tools/PDFToImageTool.tsx": "A React component that converts an uploaded PDF to images (PNG/JPG), simulates processing, and offers a ZIP download of the resulting images.",
  "frontend/src/components/pdf-tools/PDFToWordTool.tsx": "A thin wrapper around BasePDFTool configured to convert a PDF to an editable Word (.docx) document.",
  "frontend/src/components/pdf-tools/WordToPDFTool.tsx": "A thin wrapper around BasePDFTool configured to convert Word (.doc/.docx) documents to PDF format.",
  "frontend/src/components/PostDownloadNavigation.tsx": "Renders two navigation buttons after a download action—one to go back home and one to navigate to a configurable tool hub—using either a provided `onNavigate` callback or direct URL navigation.",
  "frontend/src/components/ProcessingState.tsx": "Displays a loading/processing UI with an animated icon, spinner, status message, and an optional progress bar with percentage.",
  "frontend/src/components/RelatedTools.tsx": "Renders a grid of related tool cards, each with an icon, name, description, and a 'Try Tool' button, intended for cross-promotion between tools.",
  "frontend/src/components/resume/ColorThemeSelector.tsx": "A React component that renders a grid of selectable color theme swatches for resume styling, highlighting the currently selected theme.",
  "frontend/src/components/resume/forms/AchievementsForm.tsx": "Form component for adding, editing, and removing achievement entries (title and description) within resume data.",
  "frontend/src/components/resume/forms/CertificationsForm.tsx": "Form component for managing certification entries (name, issuer, date) in the resume, supporting add and remove operations.",
  "frontend/src/components/resume/forms/EducationForm.tsx": "Form component for adding, editing, and removing education entries (institution, degree, field, dates, grade) in the resume.",
  "frontend/src/components/resume/forms/ExperienceForm.tsx": "Form component for managing work experience entries (company, position, dates, current job checkbox, description) in the resume.",
  "frontend/src/components/resume/forms/LanguagesForm.tsx": "Form component for adding and removing language entries with a name input and proficiency level selector (Native to Basic).",
  "frontend/src/components/resume/forms/PersonalInfoForm.tsx": "Form component for editing personal information in a resume, including fields for name, phone, email, summary, and photo upload, with support for Indian-specific formatting and AI-generated professional summaries.",
  "frontend/src/components/resume/forms/ProjectsForm.tsx": "Form component for managing resume projects, allowing users to add, remove, and edit project entries with fields for title, description, technologies, and link.",
  "frontend/src/components/resume/forms/ReferencesForm.tsx": "Form component for managing resume references, allowing users to add, remove, and edit reference entries with fields for name, position, company, phone, and email.",
  "frontend/src/components/resume/forms/SkillsForm.tsx": "Form component for managing resume skills, allowing users to add, remove, and edit skill entries with name and proficiency level fields.",
  "frontend/src/components/resume/ResumeEditor.tsx": "An empty file with no content or exports.",
  "frontend/src/components/resume/ResumeFormWizard.tsx": "A multi-step wizard form for building a resume, supporting step navigation, progress tracking, color theme selection, and both desktop and mobile (accordion) layouts across sections like personal info, education, and experience.",
  "frontend/src/components/resume/ResumePreview.tsx": "Renders a live resume preview with color theming applied, displaying personal info, education, experience, and other sections, along with a Download PDF button that shows toast notifications.",
  "frontend/src/components/resume/ResumeTemplateSelector.tsx": "Empty file with no content; likely a placeholder for a resume template selection component.",
  "frontend/src/components/SEO.tsx": "Headless component that dynamically sets document title, meta description, Open Graph, Twitter Card tags, and canonical link via `useEffect` based on provided props.",
  "frontend/src/components/SoftwareApplicationSchema.tsx": "Injects a JSON-LD `SoftwareApplication` schema script tag into the page for structured data, including pricing, feature list, aggregate rating, and sample reviews.",
  "frontend/src/components/ToolCategories.tsx": "Renders a 'Explore More Tools' section with three category cards (Calculators, PDF Tools, Image Tools), highlighting the active category and providing navigation buttons.",
  "frontend/src/components/ToolsGrid.tsx": "Displays a grid of tool category cards (PDF Tools, Image Tools, Resume Builder) with icons, descriptions, and click-to-navigate functionality.",
  "frontend/src/contexts/LanguageContext.tsx": "React context provider that manages multi-language support for 19 languages, handling translation loading with caching, RTL/LTR direction, browser language detection, and persisted language preference.",
  "frontend/src/data/resumeTemplateConfigs.ts": "Static configuration data for resume templates, defining metadata such as name, category, description, SEO fields, target audience, key features, and FAQs for each template type.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an Internet Computer actor instance using the current identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useBatchProcessor.ts": "Custom React hook that manages batch file processing state, including adding, processing, downloading, and removing files, with support for sequential downloads when multiple files are done.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and context provider for Internet Identity (ICP) authentication, exposing login/logout functions, identity state, and login status flags.",
  "frontend/src/hooks/useProAccess.ts": "Custom React hook that manages pro/free subscription status using localStorage, exposing activate, deactivate, and dev-toggle functions.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook that returns an empty object, noting that all processing is client-side and no backend queries are needed for Phase 1.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines CSS custom properties for the dark color theme, and adds utility classes including RTL support.",
  "frontend/src/lib/colorThemes.ts": "Defines an array of predefined color themes for resumes and provides helper functions to apply a theme as CSS variables and validate color contrast.",
  "frontend/src/lib/imageProcessing.ts": "Provides browser-based image processing utilities including loading, resizing, compressing to a target file size, and converting image formats using Canvas API.",
  "frontend/src/lib/pageSizePresets.ts": "Defines standard page size presets (A4, Legal, Letter) with mm dimensions and provides utility functions to convert mm to pixels at a given DPI.",
  "frontend/src/lib/resumeFormatters.ts": "Utility functions for formatting resume data including skills as bullet lists, dates, phone numbers, proper nouns, and experience durations.",
  "frontend/src/lib/summaryGenerator.ts": "Generates a professional resume summary string by calculating years of experience, extracting top skills, and combining them with random action verbs from the resume data.",
  "frontend/src/locales/ar.json": "Arabic translation strings for the application UI, covering navigation labels, tool names, file operations, and status messages.",
  "frontend/src/locales/bn.json": "Bengali (bn) locale file containing full translations for navigation, home page sections, footer, and common UI actions for DocMasterTools.com.",
  "frontend/src/locales/de.json": "German (de) locale file with flat-structure translations for common UI labels such as navigation items, file operations, tool names, and processing states.",
  "frontend/src/locales/en.json": "English (en) locale file serving as the base translation with nested keys covering navigation, home page content, footer, and common UI actions.",
  "frontend/src/locales/es.json": "Spanish (es) locale file with flat-structure translations for navigation, file operations, tool names, and processing states.",
  "frontend/src/locales/fr.json": "French (fr) locale file with flat-structure translations for navigation, file operations, tool names, and processing states.",
  "frontend/src/locales/gu.json": "Gujarati (gu) locale file containing full nested translations for navigation, home page sections, footer, and common UI actions for DocMasterTools.com.",
  "frontend/src/locales/hi.json": "Hindi (hi) locale file containing full nested translations for navigation, home page sections, footer, and common UI actions for DocMasterTools.com.",
  "frontend/src/locales/id.json": "Indonesian (id) locale file with flat-structure translations for navigation, file operations, tool names, and processing states.",
  "frontend/src/locales/ja.json": "Japanese (ja) locale file with flat-structure translations for navigation, file operations, tool names, and processing states.",
  "frontend/src/locales/kn.json": "Kannada (kn) locale file providing UI string translations for navigation, home page sections, footer, and common actions for the DocMasterTools frontend.",
  "frontend/src/locales/ml.json": "Malayalam (ml) locale file providing UI string translations for navigation, home page sections, footer, and common actions for the DocMasterTools frontend.",
  "frontend/src/locales/mr.json": "Marathi (mr) locale file providing UI string translations for navigation, home page sections, footer, and common actions for the DocMasterTools frontend.",
  "frontend/src/locales/pt.json": "Portuguese (pt) locale file with a flat key-value structure covering navigation labels, file operation actions, tool categories, and processing status strings.",
  "frontend/src/locales/ru.json": "Russian (ru) locale file with a flat key-value structure covering navigation labels, file operation actions, tool categories, and processing status strings.",
  "frontend/src/locales/ta.json": "Tamil (ta) locale file providing UI string translations for navigation, home page sections, footer, and common actions for the DocMasterTools frontend.",
  "frontend/src/locales/te.json": "Telugu (te) locale file providing UI string translations for navigation, home page sections, footer, and common actions for the DocMasterTools frontend.",
  "frontend/src/locales/ur.json": "Urdu (ur) locale file providing translations for navigation, home page, footer, and common UI strings for the DocMasterTools application.",
  "frontend/src/locales/zh.json": "Simplified Chinese (zh) locale file providing translations for navigation, tool actions, file handling, and UI state labels.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/calculators/AgeCalculatorPage.tsx": "Age calculator page with SEO metadata, structured data schema, breadcrumb navigation, the AgeCalculator component, related tools suggestions, and descriptive content about the tool.",
  "frontend/src/pages/calculators/BMICalculatorPage.tsx": "BMI calculator page that sets the document title on mount, renders the BMICalculator component, and includes a brief description of BMI categories and the calculation formula.",
  "frontend/src/pages/calculators/CGPACalculatorPage.tsx": "CGPA calculator page that sets the document title and meta description on mount, renders the CGPACalculator component, and explains the weighted average formula used for calculation.",
  "frontend/src/pages/calculators/CGPAToPercentageConverterPage.tsx": "Page component for the CGPA to Percentage Converter tool, setting the document title and rendering the converter component with a back button and descriptive content.",
  "frontend/src/pages/calculators/CompoundInterestCalculatorPage.tsx": "Page component for the Compound Interest Calculator, displaying the calculator with explanatory text about the compound interest formula and compounding frequencies.",
  "frontend/src/pages/calculators/DateDifferenceCalculatorPage.tsx": "Page component for the Date Difference Calculator, rendering the calculator with a description of its use cases including business day calculations and project planning.",
  "frontend/src/pages/calculators/DiscountCalculatorPage.tsx": "Page component for the Discount Calculator, wrapping the calculator component with a description of its two modes: calculating final price from discount percentage or finding discount percentage from sale price.",
  "frontend/src/pages/calculators/DivisionCalculatorPage.tsx": "Page component for the academic Division Calculator, displaying the calculator with an explanation of First, Second, and Third Division percentage thresholds used in Indian educational institutions.",
  "frontend/src/pages/calculators/EMICalculatorPage.tsx": "Page component for the EMI Calculator, rendering the calculator with the EMI formula and a description of its use for home, car, and personal loan calculations.",
  "frontend/src/pages/calculators/GPACalculatorPage.tsx": "Page component for the GPA Calculator supporting both 4.0 and 10.0 scales, with a description of weighted GPA calculation using course grades and credit hours.",
  "frontend/src/pages/calculators/GradeCalculatorPage.tsx": "Page component for the Grade Calculator, rendering the calculator with an explanation of letter-grade-to-grade-point conversion and weighted GPA calculation.",
  "frontend/src/pages/calculators/GSTCalculatorPage.tsx": "Page component for the GST Calculator, wrapping the calculator with descriptions of add/remove GST modes and supported tax rates (5%, 12%, 18%, 28%, and custom).",
  "frontend/src/pages/calculators/LoanCalculatorPage.tsx": "Page component for the Loan Calculator, displaying the calculator with a description of how it determines repayment tenure and total interest based on monthly payment capacity.",
  "frontend/src/pages/calculators/MarksPercentageCalculatorPage.tsx": "Page component for the Marks Percentage Calculator, rendering the calculator with the percentage formula and a note about pass/fail indication at the 40% threshold.",
  "frontend/src/pages/calculators/PercentageToCGPAConverterPage.tsx": "Page component for the Percentage to CGPA Converter, wrapping the converter with descriptions of CBSE and Engineering reverse formulas for converting percentage to CGPA.",
  "frontend/src/pages/calculators/ProfitLossCalculatorPage.tsx": "Page component for the Profit/Loss Percentage Calculator that sets the document title and renders the ProfitLossCalculator component with a back button and explanatory text.",
  "frontend/src/pages/calculators/SalaryHikeCalculatorPage.tsx": "Page component for the Salary Hike Calculator that sets the document title and renders the SalaryHikeCalculator component with a back button and usage description.",
  "frontend/src/pages/calculators/SGPACalculatorPage.tsx": "Page component for the SGPA Calculator that sets the document title and renders the SGPACalculator component with a back button and description of the weighted average formula.",
  "frontend/src/pages/calculators/SimpleInterestCalculatorPage.tsx": "Page component for the Simple Interest Calculator that sets the document title and renders the SimpleInterestCalculator component with a back button and formula explanation.",
  "frontend/src/pages/calculators/TimeDurationCalculatorPage.tsx": "Page component for the Time Duration Calculator that sets the document title and renders the TimeDurationCalculator component with a back button and feature description.",
  "frontend/src/pages/CalculatorsPage.tsx": "Page component listing all available calculators grouped into Academic, Financial, and Health/General categories, each navigable via card clicks.",
  "frontend/src/pages/DisclaimerPage.tsx": "Static disclaimer page outlining limitations of tool accuracy, user responsibilities, external links policy, and liability disclaimers.",
  "frontend/src/pages/HomePage.tsx": "Home page component displaying hero section, featured PDF tools, image tools, and calculator category cards with navigation links.",
  "frontend/src/pages/image-tools/AadhaarPhotoResizePage.tsx": "Page for resizing photos to Aadhaar card specifications (200×200 or 480×640 pixels) using the shared PhotoResizeTool component with predefined presets.",
  "frontend/src/pages/image-tools/AIDocumentEnhancerPage.tsx": "Pro-gated page for an AI Document Enhancer tool that shows feature cards (AI enhancement, text clarity, noise removal) to authenticated Pro users and a pricing/login prompt to others.",
  "frontend/src/pages/image-tools/BackgroundRemoverPage.tsx": "Page that provides client-side background removal by making near-white pixels transparent, with options for background fill (transparent, white, custom color, blur), output format, and quality.",
  "frontend/src/pages/image-tools/CustomImageResizePage.tsx": "Feature-rich image resize page offering multiple resize modes (easy presets, percentage, dimensions, file size, print, social media) with unit conversion, aspect ratio lock, and social media platform presets.",
  "frontend/src/pages/image-tools/DPIChangerPage.tsx": "A React page that allows users to change the DPI metadata of an image using preset or custom DPI values, outputting as JPEG or PNG via canvas processing.",
  "frontend/src/pages/image-tools/ImageCompressorPage.tsx": "A React page for compressing images with configurable quality, output format (JPEG/PNG/WebP), and optional target file size, using canvas-based processing.",
  "frontend/src/pages/image-tools/ImageCropperPage.tsx": "A React page for cropping images with configurable aspect ratios, crop region (in pixels or percentage), output format, and quality using canvas rendering.",
  "frontend/src/pages/image-tools/JPGToPNGPage.tsx": "A React page that converts JPG images to PNG or WebP format with optional quality and target file size settings via canvas-based processing.",
  "frontend/src/pages/image-tools/PANPhotoResizePage.tsx": "A React page that resizes photos to PAN card specifications (NSDL/UTIITSL) using predefined presets via the reusable PhotoResizeTool component.",
  "frontend/src/pages/image-tools/PassportPhotoMakerPage.tsx": "React page for a passport photo maker tool that provides presets for India, US, UK, Schengen, and Canada passport photo dimensions, rendered via the PhotoResizeTool component.",
  "frontend/src/pages/image-tools/PNGToJPGPage.tsx": "A React page that converts PNG images to JPEG or WebP format with configurable quality and optional target file size, using canvas-based processing.",
  "frontend/src/pages/image-tools/PoliceArmyPhotoPage.tsx": "React page for resizing photos to Police, Army, and CAPF recruitment specifications using predefined presets via the PhotoResizeTool component.",
  "frontend/src/pages/image-tools/RailwayPhotoResizePage.tsx": "React page for resizing photos to Indian Railway exam specifications (RRB NTPC, Group D, ALP) using the PhotoResizeTool component.",
  "frontend/src/pages/image-tools/SignatureResizePage.tsx": "React page for resizing signature images to Aadhaar, PAN, and exam application specifications using the PhotoResizeTool component.",
  "frontend/src/pages/image-tools/SmartDocumentFixerPage.tsx": "React page for an AI-powered document photo fixer with a free-tier usage limit (2 fixes/day), pro access gating, before/after preview, and export options.",
  "frontend/src/pages/image-tools/SSCPhotoResizePage.tsx": "React page for resizing photos to SSC exam specifications (CGL, CHSL, MTS, GD) using predefined presets via the PhotoResizeTool component.",
  "frontend/src/pages/image-tools/VisaPhotoResizePage.tsx": "React page for resizing photos to visa specifications for US, UK, Schengen, Canada, and Australia using the PhotoResizeTool component.",
  "frontend/src/pages/image-tools/WEBPConverterPage.tsx": "React page for converting images to WebP, JPEG, or PNG formats with configurable quality and optional target file size, processed client-side via Canvas API.",
  "frontend/src/pages/ImageToolsPage.tsx": "Image tools hub page organizing tools into Government, Processing, and Conversion categories with badge indicators for popular/pro/new tools.",
  "frontend/src/pages/PDFToolsPage.tsx": "Main PDF tools hub page that displays a grid of 16 PDF tool cards and renders the selected tool component based on user selection. Manages tool selection state and provides navigation back to the home page.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static privacy policy page explaining that all file processing is browser-based with no server uploads, detailing what data is and isn't collected, and outlining user rights.",
  "frontend/src/pages/resume-builder/ResumeTemplateBuilderPage.tsx": "A React page component for building a resume using a specific template slug, featuring a form wizard and live preview with auto-save to localStorage and SEO/breadcrumb support.",
  "frontend/src/pages/ResumeBuilderPage.tsx": "Resume builder hub page listing 7 Indian and 7 international resume templates as clickable cards, with SEO metadata, breadcrumb navigation, and ad placeholders.",
  "frontend/src/pages/TermsOfUsePage.tsx": "Static terms of use page covering license grants, user responsibilities, disclaimers, limitations of liability, and governing law for Document Master Tools.",
  "frontend/src/types/resume.ts": "TypeScript type definitions for the resume builder, including interfaces for all resume sections (PersonalInfo, Education, Experience, etc.) and supported template types.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, extended border radius, accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state tracking file (version 33) summarizing all completed phases of the all-in-one utility platform, architectural notes, known issues, and a registry of existing features."
}