{
  "backend/main.mo": "Motoko actor defining data types and storage maps for Documents, Resumes, and Images, with blob storage mixin and comparison utility functions for each entity type.",
  "feature_evidence.json": "Feature evidence report tracking a single completed feature to remove the upper footer section from Footer.tsx, keeping only the 'Document Master Tools' lower section.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short descriptions summarizing each component's purpose, covering App.tsx, pages, tools, and shared components.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, borders, and sidebar variables.",
  "frontend/index.html": "HTML shell for the React SPA with viewport meta, Google Fonts preconnect hints, and a root div mounting point for the Vite/React app.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and pointing to the sitemap at docmastertools.com.",
  "frontend/public/sitemap.xml": "XML sitemap listing all public URLs for docmastertools.com with last-modified dates, change frequencies, and priority values for SEO.",
  "frontend/src/App.tsx": "Root React application component using state-based navigation with React.lazy code splitting for all pages, wrapping the app in QueryClient, ThemeProvider, and LanguageProvider contexts.",
  "frontend/src/components/AdPlaceholder.tsx": "Reusable ad placeholder component rendering sized containers for banner, in-content, and sidebar ad slots with correct aspect ratios.",
  "frontend/src/components/BreadcrumbNavigation.tsx": "Breadcrumb navigation component that renders a clickable breadcrumb trail and injects a BreadcrumbList JSON-LD schema script for SEO.",
  "frontend/src/components/calculators/AgeCalculator.tsx": "Calculates and displays a person's age in years/months/days plus totals (weeks, days, hours) and days until next birthday from a date-of-birth input.",
  "frontend/src/components/calculators/BMICalculator.tsx": "Computes BMI from user-entered weight (kg/lbs) and height (cm or feet/inches), displaying the BMI value, category with color coding, and healthy weight range.",
  "frontend/src/components/calculators/CGPACalculator.tsx": "A multi-semester CGPA calculator that lets users add/remove semesters and courses, inputting grade points and credits to compute a weighted cumulative GPA.",
  "frontend/src/components/calculators/CGPAToPercentageConverter.tsx": "Converts a CGPA value to percentage using either the CBSE formula (×9.5) or an Engineering formula (×10), selected via radio buttons.",
  "frontend/src/components/calculators/CompoundInterestCalculator.tsx": "Calculates compound interest given principal, annual rate, time period, and compounding frequency, displaying the interest earned and final amount.",
  "frontend/src/components/calculators/DateDifferenceCalculator.tsx": "Computes the difference between two dates in years/months/days, total weeks, and total days, with an option to exclude weekends and count only weekdays.",
  "frontend/src/components/calculators/DiscountCalculator.tsx": "Calculates discount results in two modes: deriving the final price from a discount percentage, or deriving the discount percentage from a given sale price.",
  "frontend/src/components/calculators/DivisionCalculator.tsx": "Determines academic division (First, Second, Third, or Fail) based on an entered percentage, displaying the result with color-coded styling and a criteria reference table.",
  "frontend/src/components/calculators/EMICalculator.tsx": "A React component that calculates monthly EMI, total interest, and total repayment amount given a loan amount, annual interest rate, and tenure (in months or years), displaying results with a visual breakdown.",
  "frontend/src/components/calculators/GPACalculator.tsx": "A React component that calculates GPA on either a 4.0 or 10.0 scale by accepting numeric grades and credit values for multiple courses, with add/remove course functionality.",
  "frontend/src/components/calculators/GradeCalculator.tsx": "A React component that calculates weighted GPA using letter grades (A+ through F mapped to a 10-point scale) and credit values for multiple courses, with add/remove course support.",
  "frontend/src/components/calculators/GSTCalculator.tsx": "A React component that computes GST by either adding it to a base amount or removing it from a GST-inclusive total, supporting standard Indian GST rates (5%, 12%, 18%, 28%) and a custom rate.",
  "frontend/src/components/calculators/LoanCalculator.tsx": "A React component that determines loan tenure (in months and years), total interest, and total repayment given a loan amount, annual interest rate, and fixed monthly payment, with an error alert if the payment is too low.",
  "frontend/src/components/calculators/MarksPercentageCalculator.tsx": "A React component that calculates the percentage from obtained and total marks, displays a pass/fail result based on a 40% threshold, and shows a validation error if obtained marks exceed total marks.",
  "frontend/src/components/calculators/PercentageToCGPAConverter.tsx": "A React component that converts a percentage score to CGPA using either the CBSE (÷9.5) or Engineering (÷10) formula, selected via radio buttons.",
  "frontend/src/components/calculators/ProfitLossCalculator.tsx": "A React component that calculates profit or loss amount and percentage given a cost price and selling price, displaying results with color-coded indicators.",
  "frontend/src/components/calculators/SalaryHikeCalculator.tsx": "A React component that calculates salary hike either from a given hike percentage or from a desired salary amount, showing new salary and monthly/annual increments.",
  "frontend/src/components/calculators/SGPACalculator.tsx": "A React component that calculates SGPA by allowing users to add multiple courses with grade points and credits, computing the weighted average.",
  "frontend/src/components/calculators/SimpleInterestCalculator.tsx": "A React component that computes simple interest and total amount using principal, rate, and time inputs with the SI = (P×R×T)/100 formula.",
  "frontend/src/components/calculators/TimeDurationCalculator.tsx": "A React component that supports three time modes: calculating duration between two times, or adding/subtracting hours, minutes, and seconds from a base time.",
  "frontend/src/components/CrossCategorySuggestions.tsx": "Renders a 'You May Also Like' section with 4 cross-category tool suggestions (cards with icons and navigation buttons) based on the current tool category (calculator, pdf, or image).",
  "frontend/src/components/DownloadSection.tsx": "Displays a download UI supporting both single-file and multi-file modes, showing file names/sizes with download buttons and optional 'Process Another' or 'Clear' actions.",
  "frontend/src/components/FAQSchema.tsx": "Injects a JSON-LD FAQPage structured data script tag into the page for SEO, built from an array of question/answer pairs.",
  "frontend/src/components/FileUploadZone.tsx": "A drag-and-drop and click-to-upload file input zone that validates file size and calls a callback with the selected file, supporting configurable accept types and max size.",
  "frontend/src/components/Footer.tsx": "Site footer with four columns covering brand description, quick navigation links (internal pages and external sites), and a legal section with privacy/terms links.",
  "frontend/src/components/Header.tsx": "Sticky site header with a logo, desktop navigation bar, mobile hamburger menu, and a language selector, supporting both internal page navigation and external links.",
  "frontend/src/components/Hero.tsx": "Hero section with a headline, description, CTA buttons, key stats (100% Private, 20+ Tools, Free), and a banner image laid out in a two-column grid.",
  "frontend/src/components/image-tools/AutoFeaturesPanel.tsx": "A React panel component providing auto-processing features like white background application, image compression, and multi-copy layout generation, with pro-user gating for certain options.",
  "frontend/src/components/image-tools/AutoPhotoSizeGenerator.tsx": "A React component that resizes and compresses uploaded images to match predefined presets (passport, visa, Aadhaar, etc.) or custom dimensions/KB targets, then triggers a download.",
  "frontend/src/components/image-tools/BackgroundChangerTool.tsx": "A React tool component that accepts an image upload and replaces its background with a user-selected solid color, currently using a simulated async processing stub.",
  "frontend/src/components/image-tools/BackgroundRemoverTool.tsx": "A React tool component that accepts an image upload and simulates AI-powered background removal, producing a downloadable PNG result.",
  "frontend/src/components/image-tools/BeforeAfterPreviewPanel.tsx": "A React preview panel that displays original and processed images side-by-side or individually, with zoom, rotation, crop guide overlay, and optional watermark controls.",
  "frontend/src/components/image-tools/ExportOptionsPanel.tsx": "A React panel that exports a processed canvas image in multiple formats (JPEG, PNG, WebP, PDF, multi-copy layout), with pro-user gating and a manually constructed minimal PDF generator.",
  "frontend/src/components/image-tools/ImageCompressorTool.tsx": "A React component that allows users to upload an image, adjust quality via a slider, and simulate compression by generating a proportionally-sized blob for download.",
  "frontend/src/components/image-tools/PhotoKBResizerTool.tsx": "A React component that lets users upload an image and resize it to a specific file size (preset KB values or custom), simulating the output as a fixed-size blob for download.",
  "frontend/src/components/image-tools/PhotoResizeTool.tsx": "A reusable React component for resizing/compressing images to specified dimensions and target KB size, supporting presets, aspect ratio locking, and quality control with real image processing via imageProcessing utilities.",
  "frontend/src/components/image-tools/ProPricingModal.tsx": "A modal dialog that displays a Free vs. Pro feature comparison table and allows users to activate Pro access via the useProAccess hook.",
  "frontend/src/components/LanguageSelector.tsx": "A dropdown menu component for switching the app language among 10 Indian languages, using the LanguageContext and marking the currently active language with a checkmark.",
  "frontend/src/components/pdf-tools/BasePDFTool.tsx": "A generic, configurable PDF tool component that handles file upload, simulated processing, and download, accepting props to customize title, labels, and output file details.",
  "frontend/src/components/pdf-tools/ImageToPDFTool.tsx": "A React component that accepts multiple image uploads and simulates converting them into a single downloadable PDF blob.",
  "frontend/src/components/pdf-tools/PDFAddPageNumbersTool.tsx": "A thin wrapper around BasePDFTool configured to add page numbers to a PDF document.",
  "frontend/src/components/pdf-tools/PDFAddWatermarkTool.tsx": "A PDF watermark tool component that wraps BasePDFTool with configuration for adding text or image watermarks to PDF pages.",
  "frontend/src/components/pdf-tools/PDFCompressTool.tsx": "A PDF compression tool with auto and manual modes, allowing users to upload a PDF and reduce its file size via a quality slider, then download the compressed result.",
  "frontend/src/components/pdf-tools/PDFMergeTool.tsx": "A PDF merge tool that lets users upload multiple PDF files, displays them in a list, and simulates merging them into a single downloadable PDF.",
  "frontend/src/components/pdf-tools/PDFOCRTool.tsx": "A PDF OCR tool component that wraps BasePDFTool to convert scanned PDFs into searchable text documents.",
  "frontend/src/components/pdf-tools/PDFPageCounterTool.tsx": "A PDF page counter tool component that wraps BasePDFTool to count and report the total number of pages in a PDF.",
  "frontend/src/components/pdf-tools/PDFPasswordProtectTool.tsx": "A PDF password protection tool component that wraps BasePDFTool to add password security to PDF documents.",
  "frontend/src/components/pdf-tools/PDFPasswordUnlockTool.tsx": "A PDF unlock tool component that wraps BasePDFTool to remove password protection from PDF documents.",
  "frontend/src/components/pdf-tools/PDFRemoveBlankPagesTool.tsx": "A PDF blank page removal tool component that wraps BasePDFTool to automatically detect and remove empty pages from a PDF.",
  "frontend/src/components/pdf-tools/PDFReorderTool.tsx": "A PDF page reorder tool component that wraps BasePDFTool to rearrange pages within a PDF document.",
  "frontend/src/components/pdf-tools/PDFSignTool.tsx": "A PDF signing tool component that wraps BasePDFTool to add a digital signature (drawn or uploaded) to a PDF.",
  "frontend/src/components/pdf-tools/PDFSplitTool.tsx": "A PDF split tool that allows users to upload a PDF and extract specific pages by range, simulating splitting into multiple downloadable PDF files.",
  "frontend/src/components/pdf-tools/PDFToImageTool.tsx": "A PDF-to-image conversion tool that accepts a PDF upload, simulates converting pages to PNG/JPG images, and provides a ZIP download of the results.",
  "frontend/src/components/pdf-tools/PDFToWordTool.tsx": "A PDF-to-Word conversion tool component that wraps BasePDFTool to convert PDF documents to editable .docx format.",
  "frontend/src/components/pdf-tools/WordToPDFTool.tsx": "A Word-to-PDF conversion tool component that wraps BasePDFTool to convert .doc/.docx files to PDF format.",
  "frontend/src/components/ProcessingState.tsx": "Displays a loading/processing UI with an animated icon, spinner, message text, and an optional progress bar with percentage.",
  "frontend/src/components/RelatedTools.tsx": "Renders a grid of related tool cards, each with an icon, name, description, and a 'Try Tool' button that triggers a callback.",
  "frontend/src/components/resume/ColorThemeSelector.tsx": "A color theme selector component that displays a grid of available color themes with swatches and highlights the currently selected theme.",
  "frontend/src/components/resume/forms/AchievementsForm.tsx": "A form component for adding, editing, and removing achievement entries (title and description) within the resume data.",
  "frontend/src/components/resume/forms/CertificationsForm.tsx": "A form component for managing certification entries (name, issuer, date) in the resume, supporting add and remove operations.",
  "frontend/src/components/resume/forms/EducationForm.tsx": "A form component for adding and editing education entries (institution, degree, field, dates, grade) in the resume data.",
  "frontend/src/components/resume/forms/ExperienceForm.tsx": "A form component for managing work experience entries (company, position, dates, current job checkbox, description) in the resume data.",
  "frontend/src/components/resume/forms/LanguagesForm.tsx": "A form component for managing resume language entries, allowing users to add, remove, and edit language name and proficiency level via a select dropdown.",
  "frontend/src/components/resume/forms/PersonalInfoForm.tsx": "A form component for editing personal info on a resume, including name, phone, photo upload/removal, and an AI-generated professional summary, with template-aware formatting.",
  "frontend/src/components/resume/forms/ProjectsForm.tsx": "A form component for managing resume project entries, supporting add/remove/edit of project title, description, technologies, and link fields.",
  "frontend/src/components/resume/forms/ReferencesForm.tsx": "A form component for managing resume references, allowing users to add, remove, and edit reference name, position, company, phone, and email.",
  "frontend/src/components/resume/forms/SkillsForm.tsx": "A form component for managing resume skills, letting users add, remove, and edit skill name and optional proficiency level.",
  "frontend/src/components/resume/ResumeEditor.tsx": "An empty file with no content, likely a placeholder for a resume editor component.",
  "frontend/src/components/resume/ResumeFormWizard.tsx": "A multi-step form wizard for building a resume, with progress tracking, navigation between steps (personal info, education, experience, etc.), and both desktop and mobile (accordion) layouts.",
  "frontend/src/components/resume/ResumePreview.tsx": "A memoized live preview component that renders resume data as a styled, theme-colored document and provides a simulated PDF download button.",
  "frontend/src/components/resume/ResumeTemplateSelector.tsx": "An empty file with no content, likely a placeholder for a resume template selection component.",
  "frontend/src/components/SEO.tsx": "Imperatively sets document title, meta description, Open Graph, Twitter Card tags, and canonical link via a useEffect hook; renders nothing to the DOM.",
  "frontend/src/components/SoftwareApplicationSchema.tsx": "Injects a JSON-LD SoftwareApplication schema script tag with static rating, review, and offer data alongside the provided props.",
  "frontend/src/components/ToolCategories.tsx": "Renders a three-column grid of tool category cards (Calculators, PDF Tools, Image Tools) with navigation buttons and active-state highlighting.",
  "frontend/src/components/ToolsGrid.tsx": "Displays a grid of top-level tool category cards (PDF Tools, Image Tools, Resume Builder) with icons and navigation on click.",
  "frontend/src/contexts/LanguageContext.tsx": "A React context provider that handles multi-language support with lazy-loaded JSON translation files, browser language auto-detection, localStorage persistence, and a nested-key translation function.",
  "frontend/src/data/resumeTemplateConfigs.ts": "Defines configuration metadata (name, category, description, SEO fields, features, FAQs) for each resume template type used across the application.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) actors, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook for React, managing login/logout state, identity persistence via AuthClient, and exposing login status helpers.",
  "frontend/src/hooks/useProAccess.ts": "Hook that manages a pro/free access flag persisted in localStorage, exposing activate, deactivate, and dev-toggle functions.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook that returns an empty object, noting that all processing is client-side and no backend queries are needed for Phase 1.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines CSS custom properties for light and dark color themes, and adds utility/component layer classes for spacing, buttons, and transitions.",
  "frontend/src/lib/colorThemes.ts": "Defines a set of predefined color themes for resumes and provides helpers to apply a theme as CSS variables and perform a placeholder contrast validation.",
  "frontend/src/lib/imageProcessing.ts": "Provides canvas-based image utility functions including loading, resizing, compressing to a target file size, and converting image formats.",
  "frontend/src/lib/resumeFormatters.ts": "Collection of formatting utility functions for resume data, including skills, dates, phone numbers, proper nouns, and experience duration.",
  "frontend/src/lib/summaryGenerator.ts": "Generates a professional resume summary string from ResumeData by calculating years of experience, extracting top skills, and composing sentences with random action verbs.",
  "frontend/src/locales/bn.json": "Bengali (bn) locale translation file containing UI strings for navigation, home page sections, footer, and common actions used throughout the application.",
  "frontend/src/locales/en.json": "English i18n strings for navigation, home page sections, footer, and common UI actions used across the DocMasterTools frontend.",
  "frontend/src/locales/gu.json": "Gujarati translations of all UI strings covering navigation, home page, footer, and common actions for the DocMasterTools frontend.",
  "frontend/src/locales/hi.json": "Hindi translations of all UI strings covering navigation, home page, footer, and common actions for the DocMasterTools frontend.",
  "frontend/src/locales/kn.json": "Kannada translations of all UI strings covering navigation, home page, footer, and common actions for the DocMasterTools frontend.",
  "frontend/src/locales/ml.json": "Malayalam translations of all UI strings covering navigation, home page, footer, and common actions for the DocMasterTools frontend.",
  "frontend/src/locales/mr.json": "Marathi translations of all UI strings covering navigation, home page, footer, and common actions for the DocMasterTools frontend.",
  "frontend/src/locales/ta.json": "Tamil language translation file for the DocMasterTools.com frontend, covering navigation, home page, footer, and common UI strings.",
  "frontend/src/locales/te.json": "Telugu language translation file for the DocMasterTools.com frontend, covering navigation, home page, footer, and common UI strings.",
  "frontend/src/locales/ur.json": "Urdu language translation file for the DocMasterTools.com frontend, covering navigation, home page, footer, and common UI strings.",
  "frontend/src/main.tsx": "React application entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/calculators/AgeCalculatorPage.tsx": "Page wrapper for the AgeCalculator component that includes SEO metadata, structured data schema, breadcrumb navigation, ad placeholders, and related tool suggestions.",
  "frontend/src/pages/calculators/BMICalculatorPage.tsx": "Page component for the BMI Calculator that sets the document title and renders the BMICalculator component with a back button, descriptive header, and informational section about BMI categories and formula.",
  "frontend/src/pages/calculators/CGPACalculatorPage.tsx": "Page component for the CGPA Calculator that sets the document title and meta description, renders the CGPACalculator component, and includes an explanation of the CGPA formula and its use cases.",
  "frontend/src/pages/calculators/CGPAToPercentageConverterPage.tsx": "Page component for the CGPA to Percentage Converter that renders the CGPAToPercentageConverter component and explains the CBSE (×9.5) and Engineering (×10) conversion formulas.",
  "frontend/src/pages/calculators/CompoundInterestCalculatorPage.tsx": "Page component for the Compound Interest Calculator that renders the CompoundInterestCalculator component and documents the compound interest formula with supported compounding frequencies.",
  "frontend/src/pages/calculators/DateDifferenceCalculatorPage.tsx": "Page component for the Date Difference Calculator that renders the DateDifferenceCalculator component and describes its ability to compute date differences in years, months, days, and business days.",
  "frontend/src/pages/calculators/DiscountCalculatorPage.tsx": "Page component for the Discount Calculator that renders the DiscountCalculator component and explains its two modes: calculating final price from discount percentage or finding discount percentage from sale price.",
  "frontend/src/pages/calculators/DivisionCalculatorPage.tsx": "Page component for the Division Calculator that renders the DivisionCalculator component and explains the Indian academic division classification system (First, Second, Third Division, or Fail) based on percentage marks.",
  "frontend/src/pages/calculators/EMICalculatorPage.tsx": "Page component for the EMI Calculator that renders the EMICalculator component and documents the EMI formula for computing monthly loan installments given principal, interest rate, and tenure.",
  "frontend/src/pages/calculators/GPACalculatorPage.tsx": "Page component for the GPA Calculator that renders the GPACalculator component and explains support for both 4.0 (US) and 10.0 (Indian) GPA scales with course-wise grade and credit input.",
  "frontend/src/pages/calculators/GradeCalculatorPage.tsx": "Page component for the Grade Calculator that renders the GradeCalculator component and explains the letter-grade-to-grade-point conversion scale used to compute weighted GPA.",
  "frontend/src/pages/calculators/GSTCalculatorPage.tsx": "Page component for the GST Calculator that renders the GSTCalculator component and describes add/remove GST modes supporting standard rates (5%, 12%, 18%, 28%) and custom rates.",
  "frontend/src/pages/calculators/LoanCalculatorPage.tsx": "Page component for the Loan Calculator that renders the LoanCalculator component and explains how it determines loan repayment tenure and total interest based on a user-specified monthly payment amount.",
  "frontend/src/pages/calculators/MarksPercentageCalculatorPage.tsx": "Page component for the Marks Percentage Calculator that sets the document title and renders the calculator with a back button and descriptive content.",
  "frontend/src/pages/calculators/PercentageToCGPAConverterPage.tsx": "Page component for the Percentage to CGPA Converter that renders the converter tool with explanatory text about CBSE and Engineering conversion formulas.",
  "frontend/src/pages/calculators/ProfitLossCalculatorPage.tsx": "Page component for the Profit/Loss Percentage Calculator that renders the calculator tool with a description of the profit/loss percentage formula.",
  "frontend/src/pages/calculators/SalaryHikeCalculatorPage.tsx": "Page component for the Salary Hike Calculator that renders the tool for computing new salary after a percentage hike or finding the required hike percentage.",
  "frontend/src/pages/calculators/SGPACalculatorPage.tsx": "Page component for the SGPA Calculator that renders the semester GPA calculator with an explanation of the weighted average formula.",
  "frontend/src/pages/calculators/SimpleInterestCalculatorPage.tsx": "Page component for the Simple Interest Calculator that renders the calculator with a description of the SI = (P × R × T) / 100 formula.",
  "frontend/src/pages/calculators/TimeDurationCalculatorPage.tsx": "Page component for the Time Duration Calculator that renders the tool for computing elapsed time between two timestamps, including midnight-spanning support.",
  "frontend/src/pages/CalculatorsPage.tsx": "Page component listing all available calculators grouped into academic, financial, and health/general categories, each navigable via onNavigate.",
  "frontend/src/pages/DisclaimerPage.tsx": "Static disclaimer page outlining general information, tool accuracy limitations, user responsibilities, and liability disclaimers for DocMasterTools.com.",
  "frontend/src/pages/HomePage.tsx": "Main home page component displaying PDF tools, image tools, calculator categories, and resume builder sections with navigation handlers and a delayed app download banner.",
  "frontend/src/pages/image-tools/AadhaarPhotoResizePage.tsx": "Page component that wraps PhotoResizeTool with Aadhaar-specific presets (200×200 and 480×640) and government-specified file size limits.",
  "frontend/src/pages/image-tools/BackgroundRemoverPage.tsx": "Stub page component for a background remover tool that accepts an image upload but has no processing logic implemented yet.",
  "frontend/src/pages/image-tools/CustomImageResizePage.tsx": "Page component that wraps PhotoResizeTool with common social media and display presets (HD, Instagram, Facebook) and defaults to custom sizing.",
  "frontend/src/pages/image-tools/DPIChangerPage.tsx": "Stub page component for a DPI changer tool that accepts an image upload but has no DPI-changing logic implemented yet.",
  "frontend/src/pages/image-tools/ImageCompressorPage.tsx": "Page component for an image compressor that lets users upload an image, adjust quality via a slider, compress it client-side, and download the result.",
  "frontend/src/pages/image-tools/ImageCropperPage.tsx": "A placeholder page for an image cropping tool that accepts image file uploads but has no cropping functionality implemented yet.",
  "frontend/src/pages/image-tools/JPGToPNGPage.tsx": "A page that converts JPG/JPEG images to PNG format using the imageProcessing library, with file upload, conversion, and download functionality.",
  "frontend/src/pages/image-tools/PANPhotoResizePage.tsx": "A page that wraps the PhotoResizeTool component with a preset for PAN card photo dimensions (200×230px, max 50KB).",
  "frontend/src/pages/image-tools/PassportPhotoMakerPage.tsx": "A page wrapping PhotoResizeTool with presets for India, US, UK, and Schengen passport photo dimensions, plus an FAQ and related tools section.",
  "frontend/src/pages/image-tools/PNGToJPGPage.tsx": "A page that converts PNG images to JPG format with an adjustable quality slider (50–100%), using the imageProcessing library for conversion and download.",
  "frontend/src/pages/image-tools/PoliceArmyPhotoPage.tsx": "A page wrapping PhotoResizeTool with presets for Police, Army, and CAPF recruitment photo dimensions (300×400px, max 100KB).",
  "frontend/src/pages/image-tools/RailwayPhotoResizePage.tsx": "A page wrapping PhotoResizeTool with presets for Indian Railway (RRB and NTPC) recruitment exam photo dimensions (300×400px, max 100KB).",
  "frontend/src/pages/image-tools/SignatureResizePage.tsx": "A page wrapping PhotoResizeTool with presets for resizing signature images for Aadhaar, PAN, and exam applications with small file size limits.",
  "frontend/src/pages/image-tools/SmartDocumentFixerPage.tsx": "A feature-rich document image enhancement page with before/after preview, auto-fix processing, a daily free-use limit (2 fixes), and a Pro upgrade modal for unlimited access.",
  "frontend/src/pages/image-tools/SSCPhotoResizePage.tsx": "A page wrapping PhotoResizeTool with presets for SSC exam (CGL, CHSL) photo dimensions (300×400px, max 100KB).",
  "frontend/src/pages/image-tools/VisaPhotoResizePage.tsx": "A page wrapping PhotoResizeTool with presets for US, UK, Schengen, and Canada visa photo dimensions and file size requirements.",
  "frontend/src/pages/image-tools/WEBPConverterPage.tsx": "A placeholder page for a WEBP image converter that accepts image uploads but has no conversion functionality implemented yet.",
  "frontend/src/pages/ImageToolsPage.tsx": "Displays a categorized gallery of image tools (government document photos, image processing, and format conversion) as clickable cards, navigating to individual tools via the onNavigate callback.",
  "frontend/src/pages/PDFToolsPage.tsx": "Renders a PDF tools hub page with a grid of 16 PDF tool cards; selecting a card swaps the view to the corresponding tool component using local state.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static page displaying the site's Privacy Policy, emphasizing browser-only file processing and detailing data collection practices, user rights, and contact information.",
  "frontend/src/pages/resume-builder/ResumeTemplateBuilderPage.tsx": "A React page component for building a resume using a specific template slug, featuring a form wizard and live preview, with auto-save to localStorage and SEO/breadcrumb/related-tools support.",
  "frontend/src/pages/ResumeBuilderPage.tsx": "Lists 14 resume/CV templates split into Indian and international categories as cards; clicking a template navigates to its builder page via onNavigate.",
  "frontend/src/pages/TermsOfUsePage.tsx": "Static page presenting the site's Terms of Use, covering license grants, user responsibilities, disclaimers, limitations, and governing law.",
  "frontend/src/types/resume.ts": "TypeScript type definitions for the resume builder, including interfaces for all resume sections (PersonalInfo, Education, Experience, Skills, etc.) and a union type for supported template names.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode support, custom OKLCH-based color tokens, extended border radius, accordion keyframe animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state tracking file (version 21) summarizing all completed phases of the all-in-one utility platform, including calculators, PDF tools, image tools, resume builder, multi-language system, and a freemium Smart Document Fixer, along with architectural notes and known issues."
}