{
  "backend/main.mo": "Main Motoko actor that defines types and storage maps for Documents, Resumes, and Image Metadata, using a blob storage mixin and utility modules for sorting each entity type.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their associated files, components, test IDs, and confidence levels, covering AdvancedToolShell, ImageCompressor, and government document photo resize tool upgrades.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short descriptions summarizing each component or page's purpose, serving as a reference index for the frontend codebase.",
  "frontend/index.css": "Global Tailwind CSS entry point that defines CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.) used throughout the app.",
  "frontend/index.html": "Root HTML shell for the React app that mounts the app into a `#root` div and loads the main TypeScript entry point as an ES module.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers full access and pointing to the sitemap at docmastertools.com.",
  "frontend/public/sitemap.xml": "XML sitemap listing all public URLs for docmastertools.com with last-modified dates, change frequencies, and priority values for SEO crawling.",
  "frontend/src/App.tsx": "Root React component that sets up providers (QueryClient, ThemeProvider, LanguageProvider), lazy-loads all page components, and implements state-based navigation routing across calculators, PDF tools, image tools, and resume builder pages.",
  "frontend/src/components/AdPlaceholder.tsx": "Reusable ad placeholder component that renders a sized, labeled placeholder box for banner (728×90), in-content (300×250), or sidebar (160×600) ad slots.",
  "frontend/src/components/AdvancedToolShell.tsx": "A reusable shell component for file-processing tools that manages a multi-step workflow (upload → settings → preview/download) with drag-and-drop support, file metadata display, and processing state handling.",
  "frontend/src/components/BreadcrumbNavigation.tsx": "Renders an accessible breadcrumb navigation bar with Schema.org JSON-LD structured data, supporting clickable and non-clickable items.",
  "frontend/src/components/calculators/AgeCalculator.tsx": "A React component that calculates a person's age from a birth date input, displaying years/months/days breakdown along with total months, weeks, days, hours, and days until the next birthday.",
  "frontend/src/components/calculators/BMICalculator.tsx": "A React BMI calculator component supporting metric (kg/cm) and imperial (lbs/ft-in) inputs, displaying the computed BMI value, weight category with color coding, and healthy weight range.",
  "frontend/src/components/calculators/CGPACalculator.tsx": "A React component for calculating cumulative GPA across multiple semesters, allowing users to add/remove semesters and courses with grade points and credit inputs.",
  "frontend/src/components/calculators/CGPAToPercentageConverter.tsx": "A React component that converts a CGPA value to a percentage using either the CBSE (×9.5) or Engineering (×10) formula, selected via radio buttons.",
  "frontend/src/components/calculators/CompoundInterestCalculator.tsx": "A React compound interest calculator that takes principal, annual rate, time period, and compounding frequency inputs, then displays the interest earned and final amount.",
  "frontend/src/components/calculators/DateDifferenceCalculator.tsx": "A React component that calculates the difference between two dates in years, months, days, weeks, and total days, with an option to exclude weekends from the count.",
  "frontend/src/components/calculators/DiscountCalculator.tsx": "A React component that calculates discounts either from a percentage or a sale price, displaying the discount amount, final price, and savings.",
  "frontend/src/components/calculators/DivisionCalculator.tsx": "A React component that takes a percentage input and displays the academic division (First, Second, Third, or Fail) based on standard cutoffs.",
  "frontend/src/components/calculators/EMICalculator.tsx": "A React component that calculates monthly EMI, total interest, and total repayment amount given a loan amount, annual interest rate, and tenure in months or years.",
  "frontend/src/components/calculators/GPACalculator.tsx": "A React component that calculates GPA on a 4.0 or 10.0 scale from multiple courses, each with a numeric grade and credit value.",
  "frontend/src/components/calculators/GradeCalculator.tsx": "A React component that calculates weighted GPA from multiple courses using a letter-grade scale (A+ to F) and credit values.",
  "frontend/src/components/calculators/GSTCalculator.tsx": "A React component that adds or removes GST from an amount using standard Indian GST rates (5%, 12%, 18%, 28%) or a custom rate, displaying base amount, GST, and total.",
  "frontend/src/components/calculators/LoanCalculator.tsx": "A React component that calculates loan tenure, total interest, and total repayment amount based on loan amount, annual interest rate, and monthly payment inputs.",
  "frontend/src/components/calculators/MarksPercentageCalculator.tsx": "A React component that calculates the percentage from obtained and total marks, and displays a pass/fail result based on a 40% threshold.",
  "frontend/src/components/calculators/PercentageToCGPAConverter.tsx": "A React component that converts a percentage to CGPA using either the CBSE (÷9.5) or Engineering (÷10) formula, selectable via radio buttons.",
  "frontend/src/components/calculators/ProfitLossCalculator.tsx": "A React component that computes profit or loss amount and percentage from cost price and selling price inputs, with color-coded result display.",
  "frontend/src/components/calculators/SalaryHikeCalculator.tsx": "A React component that calculates a new salary from a hike percentage or determines the required hike percentage from a desired salary, showing monthly and annual increments.",
  "frontend/src/components/calculators/SGPACalculator.tsx": "A React component that calculates SGPA by aggregating grade points and credits across dynamically added/removed courses.",
  "frontend/src/components/calculators/SimpleInterestCalculator.tsx": "A React component that calculates simple interest using the SI = (P × R × T) / 100 formula, displaying inputs for principal, rate, and time along with computed interest and total amount.",
  "frontend/src/components/calculators/TimeDurationCalculator.tsx": "A React component supporting three modes—calculate duration between two times, add time, or subtract time—using time inputs and displaying the computed result.",
  "frontend/src/components/CrossCategorySuggestions.tsx": "Displays a grid of cross-category tool suggestions (calculators, PDF, image tools) based on the current tool category, with navigation callbacks.",
  "frontend/src/components/DownloadSection.tsx": "Renders a download UI card supporting both single-file and multiple-file modes, with per-file download buttons, file size display, and options to process another file or clear.",
  "frontend/src/components/FAQSchema.tsx": "Injects a Schema.org FAQPage JSON-LD script tag into the page based on a provided list of question-and-answer pairs.",
  "frontend/src/components/FileUploadZone.tsx": "A drag-and-drop file upload zone component with click-to-browse and touch support, file size validation, and configurable accepted file types.",
  "frontend/src/components/Footer.tsx": "Site-wide footer component with navigation links to tool categories, legal pages, and external partner sites, plus a brand description.",
  "frontend/src/components/Header.tsx": "Sticky site header with logo, desktop/mobile navigation links (internal pages and external sites), and a language selector dropdown.",
  "frontend/src/components/Hero.tsx": "Hero section with a headline, tagline, CTA buttons, key stats (private/free/20+ tools), and a banner image.",
  "frontend/src/components/image-tools/AutoFeaturesPanel.tsx": "A React panel offering automated image post-processing features including white background application via flood-fill, JPEG compression to a target KB size, and a 2×2 multi-copy A4 layout generator.",
  "frontend/src/components/image-tools/AutoPhotoSizeGenerator.tsx": "A React component that resizes and compresses uploaded images to match predefined government/visa photo presets (passport, Aadhaar, PAN, etc.) or custom dimensions, then provides a download.",
  "frontend/src/components/image-tools/BackgroundChangerTool.tsx": "A React tool that accepts an image upload and simulates replacing its background with a user-selected solid color, then offers a download of the result.",
  "frontend/src/components/image-tools/BackgroundRemoverTool.tsx": "A React tool that accepts an image upload and simulates AI-powered background removal, producing a PNG download of the processed image.",
  "frontend/src/components/image-tools/BeforeAfterPreviewPanel.tsx": "A React component that displays a before/after image preview panel with controls for view mode (side-by-side, original, enhanced), zoom, rotation, crop guide overlay, and optional watermark overlay.",
  "frontend/src/components/image-tools/ExportOptionsPanel.tsx": "A React component that provides export options for a processed image, supporting download as JPEG, PNG, PDF, and a 2x2 multi-copy layout, with pro-user gating for certain formats.",
  "frontend/src/components/image-tools/ImageCompressorTool.tsx": "A React tool component that allows users to upload an image, select a quality level via a slider, and simulate compressing it to a smaller file size for download.",
  "frontend/src/components/image-tools/PhotoKBResizerTool.tsx": "A React tool component that lets users upload an image and resize it to a specific target file size (preset KB values or custom), then download the result.",
  "frontend/src/components/image-tools/PhotoResizeTool.tsx": "A configurable React tool component for resizing photos to preset or custom dimensions with support for multiple units, aspect ratio lock, quality control, format selection, and optional target file size constraints.",
  "frontend/src/components/image-tools/ProPricingModal.tsx": "A modal dialog that displays a Free vs Pro feature comparison table and allows users to activate Pro access via the useProAccess hook.",
  "frontend/src/components/LanguageSelector.tsx": "Dropdown component for switching the app language among 10 Indian languages using the LanguageContext.",
  "frontend/src/components/pdf-tools/BasePDFTool.tsx": "A reusable base component for PDF tools that handles file upload, simulated processing, and download flow via configurable props.",
  "frontend/src/components/pdf-tools/ImageToPDFTool.tsx": "A tool component that accepts multiple image uploads and simulates converting them into a single downloadable PDF file.",
  "frontend/src/components/pdf-tools/PDFAddPageNumbersTool.tsx": "Thin wrapper around BasePDFTool configured to add page numbers to a PDF document.",
  "frontend/src/components/pdf-tools/PDFAddWatermarkTool.tsx": "Thin wrapper around BasePDFTool configured to apply a watermark to a PDF document.",
  "frontend/src/components/pdf-tools/PDFCompressTool.tsx": "A PDF compression tool that supports both automatic and manual quality-slider modes, simulating size reduction and providing a download of the compressed file.",
  "frontend/src/components/pdf-tools/PDFMergeTool.tsx": "A tool that accepts multiple PDF uploads, lists them with removal options, and simulates merging them into a single downloadable PDF.",
  "frontend/src/components/pdf-tools/PDFOCRTool.tsx": "Thin wrapper around BasePDFTool configured to apply OCR and produce a searchable PDF.",
  "frontend/src/components/pdf-tools/PDFPageCounterTool.tsx": "Thin wrapper around BasePDFTool configured to count pages in a PDF and output a text report.",
  "frontend/src/components/pdf-tools/PDFPasswordProtectTool.tsx": "Thin wrapper around BasePDFTool configured to add password protection to a PDF.",
  "frontend/src/components/pdf-tools/PDFPasswordUnlockTool.tsx": "Thin wrapper around BasePDFTool configured to remove password protection from a PDF.",
  "frontend/src/components/pdf-tools/PDFRemoveBlankPagesTool.tsx": "Thin wrapper around BasePDFTool configured to detect and remove blank pages from a PDF.",
  "frontend/src/components/pdf-tools/PDFReorderTool.tsx": "Thin wrapper around BasePDFTool configured to reorder pages within a PDF document.",
  "frontend/src/components/pdf-tools/PDFSignTool.tsx": "Thin wrapper around BasePDFTool configured to add a digital signature to a PDF.",
  "frontend/src/components/pdf-tools/PDFSplitTool.tsx": "A React component that allows users to upload a PDF and split it into multiple files by specifying page ranges, with simulated processing and download support for each resulting file.",
  "frontend/src/components/pdf-tools/PDFToImageTool.tsx": "A React component that accepts a PDF upload and simulates converting its pages to images, offering the result as a downloadable ZIP file.",
  "frontend/src/components/pdf-tools/PDFToWordTool.tsx": "A thin wrapper around BasePDFTool configured to convert PDF files to .docx Word format.",
  "frontend/src/components/pdf-tools/WordToPDFTool.tsx": "A thin wrapper around BasePDFTool configured to convert .doc/.docx Word documents to PDF format.",
  "frontend/src/components/ProcessingState.tsx": "Loading UI component that shows a spinner, optional progress bar, and a status message during file processing.",
  "frontend/src/components/RelatedTools.tsx": "Renders a grid of related tool cards with icons, descriptions, and 'Try Tool' buttons for cross-tool navigation.",
  "frontend/src/components/resume/ColorThemeSelector.tsx": "A UI component that displays a grid of selectable color themes, each showing primary/secondary/light color swatches, and highlights the currently selected theme.",
  "frontend/src/components/resume/forms/AchievementsForm.tsx": "A form component for adding, editing, and removing achievement entries (title and description) within the resume builder.",
  "frontend/src/components/resume/forms/CertificationsForm.tsx": "Form component for managing resume certifications, allowing users to add, remove, and edit certification name, issuer, and date fields.",
  "frontend/src/components/resume/forms/EducationForm.tsx": "Form component for managing resume education entries, supporting add/remove/edit of institution, degree, field of study, dates, and grade.",
  "frontend/src/components/resume/forms/ExperienceForm.tsx": "Form component for managing work experience entries, with fields for company, position, start/end dates, a 'currently working' checkbox, and a description textarea.",
  "frontend/src/components/resume/forms/LanguagesForm.tsx": "Form component for managing resume languages, allowing users to add/remove languages with a name input and a proficiency level dropdown.",
  "frontend/src/components/resume/forms/PersonalInfoForm.tsx": "Form component for editing personal info including name, phone, photo upload, and professional summary, with template-aware formatting and an AI summary generator.",
  "frontend/src/components/resume/forms/ProjectsForm.tsx": "Form component for managing resume projects, supporting add/remove/edit of title, description, technologies used, and project link.",
  "frontend/src/components/resume/forms/ReferencesForm.tsx": "A form component for managing resume references, allowing users to add, remove, and edit reference entries (name, position, company, phone, email).",
  "frontend/src/components/resume/forms/SkillsForm.tsx": "A form component for managing resume skills, allowing users to add, remove, and edit skill entries with an optional proficiency level.",
  "frontend/src/components/resume/ResumeEditor.tsx": "An empty file with no content.",
  "frontend/src/components/resume/ResumeFormWizard.tsx": "A multi-step wizard component for building a resume, supporting step-by-step navigation through sections (personal info, education, experience, etc.), progress tracking, color theme selection, and a mobile accordion view.",
  "frontend/src/components/resume/ResumePreview.tsx": "A memoized component that renders a live styled resume preview using provided data and a color theme, with a simulated PDF download button.",
  "frontend/src/components/resume/ResumeTemplateSelector.tsx": "An empty file with no content.",
  "frontend/src/components/SEO.tsx": "Headless component that dynamically sets document title, meta description, Open Graph, Twitter Card tags, and canonical URL via useEffect.",
  "frontend/src/components/SoftwareApplicationSchema.tsx": "Injects a JSON-LD SoftwareApplication schema script tag with ratings, reviews, and feature list for SEO structured data.",
  "frontend/src/components/ToolCategories.tsx": "Displays a three-card grid for Calculator, PDF, and Image tool categories with navigation buttons and active-state highlighting.",
  "frontend/src/components/ToolsGrid.tsx": "Homepage grid of three tool category cards (PDF Tools, Image Tools, Resume Builder) with icons and navigation on click.",
  "frontend/src/contexts/LanguageContext.tsx": "A React context provider that handles multi-language support for 10 Indian languages, with browser language auto-detection, localStorage persistence, lazy-loaded translation files, and a nested-key translation function.",
  "frontend/src/data/resumeTemplateConfigs.ts": "Defines configuration data (metadata, SEO info, features, FAQs) for various resume template types targeting Indian and international job markets.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook for ICP, managing login/logout state, identity persistence via AuthClient, and delegation validity checks.",
  "frontend/src/hooks/useProAccess.ts": "A custom hook that manages pro/free access status using localStorage, exposing activate, deactivate, and dev-toggle functions.",
  "frontend/src/hooks/useQueries.ts": "A placeholder hook that returns an empty object, noting that all processing is client-side with no backend queries needed in Phase 1.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines CSS custom properties for light/dark color themes, plus utility and component classes for spacing, buttons, and transitions.",
  "frontend/src/lib/colorThemes.ts": "Defines six preset color themes for the resume builder and exports helpers to apply a theme as CSS variables and validate color contrast.",
  "frontend/src/lib/imageProcessing.ts": "Provides browser-based image utilities including loading, resizing, compressing to a target file size, format conversion, and aspect ratio calculation using Canvas API.",
  "frontend/src/lib/resumeFormatters.ts": "Utility functions for formatting resume data: skills as bullet arrays, dates to MM/YYYY, phone numbers, proper noun capitalization, and experience duration strings.",
  "frontend/src/lib/summaryGenerator.ts": "Generates a professional resume summary paragraph from ResumeData by calculating years of experience, extracting top skills, and composing sentences with random action verbs.",
  "frontend/src/locales/bn.json": "Bengali (bn) i18n translation file covering navigation, home page content, footer, and common UI labels for the DocMasterTools platform.",
  "frontend/src/locales/en.json": "English (en) i18n translation file covering navigation, home page content, footer, and common UI labels for the DocMasterTools platform.",
  "frontend/src/locales/gu.json": "Gujarati (gu) i18n translation file covering navigation, home page content, footer, and common UI labels for the DocMasterTools platform.",
  "frontend/src/locales/hi.json": "Hindi (hi) i18n translation file for DocMasterTools.com, covering navigation, home page, footer, and common UI strings.",
  "frontend/src/locales/kn.json": "Kannada (kn) i18n translation file for DocMasterTools.com, covering navigation, home page, footer, and common UI strings.",
  "frontend/src/locales/ml.json": "Malayalam (ml) i18n translation file for DocMasterTools.com, covering navigation, home page, footer, and common UI strings.",
  "frontend/src/locales/mr.json": "Marathi (mr) i18n translation file for DocMasterTools.com, covering navigation, home page, footer, and common UI strings.",
  "frontend/src/locales/ta.json": "Tamil (ta) i18n translation file for DocMasterTools.com, covering navigation, home page, footer, and common UI strings.",
  "frontend/src/locales/te.json": "Telugu (te) i18n translation file for DocMasterTools.com, covering navigation, home page, footer, and common UI strings.",
  "frontend/src/locales/ur.json": "Urdu (ur) translation file containing localized strings for navigation, home page, footer, and common UI elements used across the DocMasterTools application.",
  "frontend/src/main.tsx": "Application entry point that bootstraps the React app with QueryClientProvider for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/pages/calculators/AgeCalculatorPage.tsx": "Page wrapper for the Age Calculator tool featuring SEO metadata, structured schema, breadcrumb navigation, ad placeholders, related tools, and descriptive content around the AgeCalculator component.",
  "frontend/src/pages/calculators/BMICalculatorPage.tsx": "Simple page wrapper for the BMI Calculator component that sets the document title and renders the calculator with a brief description and an advertisement placeholder.",
  "frontend/src/pages/calculators/CGPACalculatorPage.tsx": "Page wrapper for the CGPA Calculator component that sets the document title and meta description, renders the calculator, and includes explanatory text about CGPA calculation and an ad placeholder.",
  "frontend/src/pages/calculators/CGPAToPercentageConverterPage.tsx": "Page wrapper for the CGPA-to-Percentage Converter component that sets the document title, renders the converter, and provides brief explanatory text about CBSE and Engineering conversion formulas.",
  "frontend/src/pages/calculators/CompoundInterestCalculatorPage.tsx": "Page component for the Compound Interest Calculator that sets the document title and renders the calculator with a back button, description, formula explanation, and an ad placeholder.",
  "frontend/src/pages/calculators/DateDifferenceCalculatorPage.tsx": "Page component for the Date Difference Calculator that sets the document title and renders the calculator with a back button, description about date/business-day calculations, and an ad placeholder.",
  "frontend/src/pages/calculators/DiscountCalculatorPage.tsx": "Page component for the Discount Calculator that sets the document title and renders the calculator with a back button, description covering both percentage-to-price and price-to-percentage modes, and an ad placeholder.",
  "frontend/src/pages/calculators/DivisionCalculatorPage.tsx": "Page component for the academic Division Calculator that sets the document title and renders the calculator with a back button, description of First/Second/Third Division thresholds used in Indian education, and an ad placeholder.",
  "frontend/src/pages/calculators/EMICalculatorPage.tsx": "Page component for the EMI Calculator that sets the document title and renders the calculator with a back button, EMI formula explanation, and an ad placeholder.",
  "frontend/src/pages/calculators/GPACalculatorPage.tsx": "Page component for the GPA Calculator supporting 4.0 and 10.0 scales, setting the document title and rendering the calculator with a back button, scale descriptions, and an ad placeholder.",
  "frontend/src/pages/calculators/GradeCalculatorPage.tsx": "Page component for the Grade Calculator that sets the document title and renders the calculator with a back button, description of letter-grade-to-GPA conversion, and an ad placeholder.",
  "frontend/src/pages/calculators/GSTCalculatorPage.tsx": "Page component for the GST Calculator that sets the document title and renders the calculator with a back button, description of add/remove GST modes and supported tax rates, and an ad placeholder.",
  "frontend/src/pages/calculators/LoanCalculatorPage.tsx": "Page component for the Loan Calculator that sets the document title and renders the calculator with a back button, description of tenure/interest calculation from monthly payment, and an ad placeholder.",
  "frontend/src/pages/calculators/MarksPercentageCalculatorPage.tsx": "Page component for the Marks Percentage Calculator that sets the document title and renders the calculator with a back button, formula description, pass/fail threshold note, and an ad placeholder.",
  "frontend/src/pages/calculators/PercentageToCGPAConverterPage.tsx": "Page component for the Percentage to CGPA Converter that sets the document title and renders the converter with a back button, description of CBSE and Engineering conversion formulas, and an ad placeholder.",
  "frontend/src/pages/calculators/ProfitLossCalculatorPage.tsx": "Page component for the Profit/Loss Percentage Calculator that sets the document title and renders the calculator with a back button, formula explanation, and an ad placeholder.",
  "frontend/src/pages/calculators/SalaryHikeCalculatorPage.tsx": "Page component for the Salary Hike Calculator that sets the document title and renders the SalaryHikeCalculator component with a back button and descriptive text.",
  "frontend/src/pages/calculators/SGPACalculatorPage.tsx": "Page component for the SGPA Calculator that sets the document title and renders the SGPACalculator component with a back button and descriptive text.",
  "frontend/src/pages/calculators/SimpleInterestCalculatorPage.tsx": "Page component for the Simple Interest Calculator that sets the document title and renders the SimpleInterestCalculator component with a back button and descriptive text.",
  "frontend/src/pages/calculators/TimeDurationCalculatorPage.tsx": "Page component for the Time Duration Calculator that sets the document title and renders the TimeDurationCalculator component with a back button and descriptive text.",
  "frontend/src/pages/CalculatorsPage.tsx": "Page component listing 20 calculators grouped into academic, financial, and health/general categories, each navigable via card clicks.",
  "frontend/src/pages/DisclaimerPage.tsx": "Static legal disclaimer page outlining limitations of tool accuracy, user responsibilities, no-warranty policy, and liability limitations for DocMasterTools.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring a hero section with trust badges, and sections for Calculator Hub, PDF Tools, Image Tools, and Resume Builder with navigation links.",
  "frontend/src/pages/image-tools/AadhaarPhotoResizePage.tsx": "Page for resizing photos to Aadhaar card specifications (200×200 or 480×640 pixels), using the shared PhotoResizeTool component with predefined presets.",
  "frontend/src/pages/image-tools/BackgroundRemoverPage.tsx": "Page tool that removes or replaces image backgrounds using canvas pixel manipulation, supporting transparent, white, custom color, and blur fill options with format and quality controls.",
  "frontend/src/pages/image-tools/CustomImageResizePage.tsx": "Page tool for resizing images to custom dimensions in pixels, cm, mm, or inches (or by percentage), with aspect ratio lock, format selection, and quality control.",
  "frontend/src/pages/image-tools/DPIChangerPage.tsx": "Page tool that changes the DPI metadata of an image using canvas, supporting preset DPI values (72–600) or a custom value, with JPEG/PNG format output.",
  "frontend/src/pages/image-tools/ImageCompressorPage.tsx": "A React page that compresses images using the Canvas API, allowing users to select output format (JPEG/PNG/WebP) and quality via a slider, then download the compressed result.",
  "frontend/src/pages/image-tools/ImageCropperPage.tsx": "A React page that crops images using the Canvas API with configurable crop coordinates, units (px or percentage), aspect ratio presets, format, and quality settings.",
  "frontend/src/pages/image-tools/JPGToPNGPage.tsx": "A React page that converts JPG images to PNG or WebP format using the Canvas API, with optional quality and target file size controls.",
  "frontend/src/pages/image-tools/PANPhotoResizePage.tsx": "A React page that resizes photos to PAN card specifications (NSDL/UTIITSL) using predefined presets via the shared PhotoResizeTool component.",
  "frontend/src/pages/image-tools/PassportPhotoMakerPage.tsx": "A React page that resizes photos to passport specifications for multiple countries (India, US, UK, Schengen, Canada) using predefined presets via the shared PhotoResizeTool component.",
  "frontend/src/pages/image-tools/PNGToJPGPage.tsx": "A React page that converts PNG images to JPEG or WebP format using the Canvas API, with quality slider and optional target file size settings.",
  "frontend/src/pages/image-tools/PoliceArmyPhotoPage.tsx": "A React page that resizes photos to Police, Army, and CAPF recruitment specifications using predefined presets via the shared PhotoResizeTool component.",
  "frontend/src/pages/image-tools/RailwayPhotoResizePage.tsx": "Page component for resizing photos to Indian Railway exam specifications (RRB NTPC, Group D, ALP) using predefined presets and the shared PhotoResizeTool component.",
  "frontend/src/pages/image-tools/SignatureResizePage.tsx": "Page component for resizing signature images to Aadhaar, PAN, and exam application specifications using predefined presets and the shared PhotoResizeTool component.",
  "frontend/src/pages/image-tools/SmartDocumentFixerPage.tsx": "Feature-rich page for AI-assisted document image fixing with a free-tier daily usage limit (2 fixes), Pro access gating via modal, before/after preview, and export options.",
  "frontend/src/pages/image-tools/SSCPhotoResizePage.tsx": "Page component for resizing photos to SSC exam specifications (CGL, CHSL, MTS, GD) using predefined presets and the shared PhotoResizeTool component.",
  "frontend/src/pages/image-tools/VisaPhotoResizePage.tsx": "Page component for resizing photos to visa specifications for US, UK, Schengen, Canada, and Australia using predefined presets and the shared PhotoResizeTool component.",
  "frontend/src/pages/image-tools/WEBPConverterPage.tsx": "Page component for converting images to WebP, JPEG, or PNG formats with configurable quality and optional target file size, using canvas-based client-side processing.",
  "frontend/src/pages/ImageToolsPage.tsx": "Page component displaying 17 image tools organized into government document photos, image processing, and format conversion categories with navigation to individual tools.",
  "frontend/src/pages/PDFToolsPage.tsx": "Page component that lists 16 PDF tools and conditionally renders the selected tool's component (merge, split, compress, OCR, etc.) based on user selection.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the Privacy Policy page with sections covering data processing, collection practices, third-party services, user rights, and contact information. Includes a back-to-home navigation button.",
  "frontend/src/pages/resume-builder/ResumeTemplateBuilderPage.tsx": "Resume builder page that loads a template by slug, provides a form wizard and live preview, and auto-saves draft data with selected color theme to localStorage.",
  "frontend/src/pages/ResumeBuilderPage.tsx": "Displays a resume builder hub page listing 14 templates split into Indian (Fresher, Government, Hindi, Biodata, etc.) and International (ATS, US, UK, Canada, Europass, etc.) categories as clickable cards with SEO and breadcrumb support.",
  "frontend/src/pages/TermsOfUsePage.tsx": "Renders the Terms of Use page covering acceptance of terms, use license, service description, user responsibilities, disclaimers, and governing law. Includes a back navigation button.",
  "frontend/src/types/resume.ts": "TypeScript type definitions for the resume builder, including ResumeData and its sub-types (PersonalInfo, Education, Experience, Skill, etc.) plus TemplateType and ColorTheme enums/interfaces.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens (primary, secondary, sidebar, chart, etc.), extended border radius, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the full project state (version 29) of an All-in-One Utility Platform across 10 phases covering calculators, PDF/image tools, resume builder, multi-language support, SEO/AdSense, freemium model, and user-controlled processing modes, along with architectural notes and feature registry."
}