{
  "backend/main.mo": "Motoko actor defining data types and storage maps for documents, resumes, and images, with blob storage mixin included and comparison utility functions for each entity type.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend source files describing the purpose and key details of each component, page, and utility in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens including background, foreground, primary, sidebar, and chart colors.",
  "frontend/index.html": "HTML entry point for the React app titled 'Document Master Tools - Phase 7' that mounts the app at the root div and loads the main TypeScript module.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and pointing to the sitemap at docmastertools.com.",
  "frontend/public/sitemap.xml": "XML sitemap listing all public URLs for docmastertools.com with last-modified dates, change frequencies, and priority values for SEO.",
  "frontend/src/App.tsx": "Root React app component that lazy-loads all pages and implements state-based client-side routing, wrapping everything in a LanguageProvider with a shared Header and Footer.",
  "frontend/src/components/AdPlaceholder.tsx": "Renders a styled placeholder div for banner, in-content, or sidebar ad slots with correct dimensions and aspect ratios.",
  "frontend/src/components/AdvancedToolShell.tsx": "Reusable multi-step tool shell component handling file upload (single or multiple, drag-and-drop), settings configuration, processing, preview, and download of results.",
  "frontend/src/components/BackToHomeButton.tsx": "A reusable button component that navigates the user back to the home page ('/'), using either a provided onNavigate callback or window.location.href.",
  "frontend/src/components/BatchFileQueue.tsx": "Displays a queue of batch-processed files with status icons, file sizes, and per-file or bulk download/remove actions.",
  "frontend/src/components/BreadcrumbNavigation.tsx": "Renders an accessible breadcrumb nav with Schema.org JSON-LD injection, supporting click handlers and path-based navigation for each item.",
  "frontend/src/components/calculators/AgeCalculator.tsx": "A React component that calculates a person's age from a birth date input, displaying years/months/days breakdown along with total months, weeks, days, hours, and days until the next birthday.",
  "frontend/src/components/calculators/BMICalculator.tsx": "A React BMI calculator component that accepts weight (kg/lbs) and height (cm or feet/inches), computes BMI, displays the category (Underweight/Normal/Overweight/Obese) with color coding, and shows the healthy weight range.",
  "frontend/src/components/calculators/CGPACalculator.tsx": "A React component for calculating cumulative GPA (CGPA) across multiple semesters, allowing users to add/remove semesters and courses with grade points and credits, then computing the weighted CGPA.",
  "frontend/src/components/calculators/CGPAToPercentageConverter.tsx": "A React component that converts a CGPA value to a percentage using either the CBSE formula (×9.5) or an Engineering formula (×10), selectable via radio buttons.",
  "frontend/src/components/calculators/CompoundInterestCalculator.tsx": "A React compound interest calculator that takes principal, annual rate, time period, and compounding frequency as inputs, then displays the interest earned and final amount.",
  "frontend/src/components/calculators/DateDifferenceCalculator.tsx": "A React component that calculates the difference between two dates in years, months, days, weeks, and total days, with an option to exclude weekends and count only weekdays.",
  "frontend/src/components/calculators/DiscountCalculator.tsx": "A React component that calculates discounts either from a percentage or a sale price, displaying the discount amount, final price, and savings.",
  "frontend/src/components/calculators/DivisionCalculator.tsx": "A React component that takes a percentage input and displays the academic division (First, Second, Third, or Fail) based on standard cutoffs.",
  "frontend/src/components/calculators/EMICalculator.tsx": "A React component that calculates monthly EMI, total interest, and total repayment amount given a loan amount, annual interest rate, and tenure in months or years.",
  "frontend/src/components/calculators/GPACalculator.tsx": "A React component that calculates GPA on a 4.0 or 10.0 scale from a dynamic list of courses with numeric grades and credit values.",
  "frontend/src/components/calculators/GradeCalculator.tsx": "A React component that calculates weighted GPA from a dynamic list of courses using letter grades (A+ through F) mapped to a 10-point scale and credit values.",
  "frontend/src/components/calculators/GSTCalculator.tsx": "A React component that adds or removes GST from an amount using standard Indian GST rates (5%, 12%, 18%, 28%) or a custom rate, displaying base amount, GST, and total.",
  "frontend/src/components/calculators/LoanCalculator.tsx": "A React component that calculates loan tenure, total interest, and total repayment amount based on loan amount, annual interest rate, and monthly payment inputs.",
  "frontend/src/components/calculators/MarksPercentageCalculator.tsx": "A React component that calculates the percentage from obtained and total marks, and displays a pass/fail result based on a 40% threshold.",
  "frontend/src/components/calculators/PercentageToCGPAConverter.tsx": "A React component that converts a percentage to CGPA using either the CBSE (÷9.5) or Engineering (÷10) formula, selectable via radio buttons.",
  "frontend/src/components/calculators/ProfitLossCalculator.tsx": "A React component that computes profit or loss amount and percentage from cost price and selling price inputs, with color-coded result display.",
  "frontend/src/components/calculators/SalaryHikeCalculator.tsx": "A React component that calculates new salary and increments from a hike percentage, or computes the required hike percentage from a desired salary amount.",
  "frontend/src/components/calculators/SGPACalculator.tsx": "A React component that calculates SGPA by allowing users to add multiple courses with grade points and credits, computing the weighted average.",
  "frontend/src/components/calculators/SimpleInterestCalculator.tsx": "A React component that calculates simple interest using the SI = (P × R × T) / 100 formula, displaying inputs for principal, rate, and time along with computed interest and total amount.",
  "frontend/src/components/calculators/TimeDurationCalculator.tsx": "A React component supporting three modes—calculate duration between two times, add time, or subtract time—using HTML time inputs and displaying the computed result.",
  "frontend/src/components/CrossCategorySuggestions.tsx": "Shows a 'You May Also Like' grid of tool suggestions from other categories (calculator, PDF, image) based on the current category.",
  "frontend/src/components/DownloadSection.tsx": "Renders a download UI for one or multiple processed files, with buttons for downloading, processing another file, or clearing results.",
  "frontend/src/components/FAQSchema.tsx": "Injects a Schema.org FAQPage JSON-LD script tag into the page based on a provided list of question/answer pairs.",
  "frontend/src/components/FileUploadZone.tsx": "A drag-and-drop file upload zone with click and touch support, file size validation, and a hidden file input element.",
  "frontend/src/components/Footer.tsx": "Site-wide footer with navigation links to tool categories, legal pages, and external partner sites, plus a feedback widget.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with desktop and mobile menu support, rendering internal tool links and external site links, plus a language selector.",
  "frontend/src/components/Hero.tsx": "Hero section component displaying a headline, description, CTA buttons, key stats, and a banner image for the DocMasterTools landing page.",
  "frontend/src/components/image-tools/AutoFeaturesPanel.tsx": "A React panel providing auto image processing features including white background application (with flood-fill), JPEG compression to a target KB size, and a multi-copy A4 layout generator.",
  "frontend/src/components/image-tools/AutoPhotoSizeGenerator.tsx": "A React component that resizes and compresses uploaded images to match predefined government/visa photo presets (passport, Aadhaar, PAN, etc.) or custom dimensions and file size targets.",
  "frontend/src/components/image-tools/BackgroundChangerTool.tsx": "A React tool that accepts an image upload and replaces its background with a user-selected solid color from presets or a custom color picker, then provides a download of the result.",
  "frontend/src/components/image-tools/BackgroundRemoverTool.tsx": "A React tool that simulates AI-powered background removal from an uploaded image and offers the processed PNG for download.",
  "frontend/src/components/image-tools/BeforeAfterPreviewPanel.tsx": "A React component that displays a before/after image preview panel with controls for view mode (side-by-side, original, enhanced), zoom, rotation, crop guide overlay, and optional watermark overlay.",
  "frontend/src/components/image-tools/ExportOptionsPanel.tsx": "A React component that provides export options for a processed image, supporting download as JPEG, PNG, PDF, and a 2x2 multi-copy layout, with pro-user gating for certain formats.",
  "frontend/src/components/image-tools/ImageCompressorTool.tsx": "A React tool component that allows users to upload an image, set a quality level via a slider, and simulate compression by generating a proportionally sized blob for download.",
  "frontend/src/components/image-tools/PhotoKBResizerTool.tsx": "A React tool component that lets users upload an image and resize it to a target file size (preset or custom KB value), simulating the output as a blob for download.",
  "frontend/src/components/image-tools/PhotoResizeTool.tsx": "A configurable React tool component for resizing photos to preset or custom dimensions with support for multiple units, aspect ratio locking, quality control, format selection, and optional target file size constraints.",
  "frontend/src/components/image-tools/ProPricingModal.tsx": "A modal component displaying Pro plan pricing (monthly ₹399 / yearly ₹3,000) with a feature comparison table between free and Pro tiers, and buttons to activate Pro access via the useProAccess hook.",
  "frontend/src/components/LanguageSelector.tsx": "Dropdown component that lets users select a UI language using the LanguageContext, displaying supported languages with native names.",
  "frontend/src/components/pdf-tools/BasePDFTool.tsx": "A reusable base component for PDF tools that handles file upload, simulated processing (with a 2-second delay), and download, accepting configurable props for title, description, labels, and output file details.",
  "frontend/src/components/pdf-tools/ImageToPDFTool.tsx": "A tool component that allows users to upload one or more images and simulates converting them into a single PDF file available for download.",
  "frontend/src/components/pdf-tools/PDFAddPageNumbersTool.tsx": "A thin wrapper around BasePDFTool configured to add page numbers to a PDF, outputting a file named 'numbered-document.pdf'.",
  "frontend/src/components/pdf-tools/PDFAddWatermarkTool.tsx": "A thin wrapper around BasePDFTool configured to apply a watermark to a PDF, outputting a file named 'watermarked-document.pdf'.",
  "frontend/src/components/pdf-tools/PDFCompressTool.tsx": "A PDF compression tool that supports both automatic and manual (slider-based quality) compression modes, simulating size reduction and displaying the compression percentage achieved.",
  "frontend/src/components/pdf-tools/PDFMergeTool.tsx": "A tool that lets users upload multiple PDF files, displays them in a list with removal options, and simulates merging them into a single 'merged-document.pdf' for download.",
  "frontend/src/components/pdf-tools/PDFOCRTool.tsx": "A thin wrapper around BasePDFTool configured to perform OCR on a scanned PDF, outputting a searchable PDF named 'searchable-document.pdf'.",
  "frontend/src/components/pdf-tools/PDFPageCounterTool.tsx": "A thin wrapper around BasePDFTool configured to count PDF pages, outputting a plain-text report named 'page-count-report.txt'.",
  "frontend/src/components/pdf-tools/PDFPasswordProtectTool.tsx": "A thin wrapper around BasePDFTool configured to add password protection to a PDF, outputting 'protected-document.pdf'.",
  "frontend/src/components/pdf-tools/PDFPasswordUnlockTool.tsx": "A thin wrapper around BasePDFTool configured to remove password protection from a PDF, outputting 'unlocked-document.pdf'.",
  "frontend/src/components/pdf-tools/PDFRemoveBlankPagesTool.tsx": "A thin wrapper around BasePDFTool configured to detect and remove blank pages from a PDF, outputting 'cleaned-document.pdf'.",
  "frontend/src/components/pdf-tools/PDFReorderTool.tsx": "A thin wrapper around BasePDFTool configured to reorder PDF pages, outputting 'reordered-document.pdf'.",
  "frontend/src/components/pdf-tools/PDFSignTool.tsx": "A thin wrapper around BasePDFTool configured to add a digital signature to a PDF, outputting 'signed-document.pdf'.",
  "frontend/src/components/pdf-tools/PDFSplitTool.tsx": "A React component that allows users to upload a PDF and split it into multiple files by specifying page ranges, with simulated processing and download support for each resulting file.",
  "frontend/src/components/pdf-tools/PDFToImageTool.tsx": "A React component that accepts a PDF upload and simulates converting it to images, offering the result as a downloadable ZIP file.",
  "frontend/src/components/pdf-tools/PDFToWordTool.tsx": "A thin wrapper around BasePDFTool configured to convert PDF files to Word (.docx) format.",
  "frontend/src/components/pdf-tools/WordToPDFTool.tsx": "A thin wrapper around BasePDFTool configured to convert Word (.doc/.docx) documents to PDF format.",
  "frontend/src/components/PostDownloadNavigation.tsx": "Post-download UI component providing two navigation buttons: one to return home and one to navigate to a specified tool hub.",
  "frontend/src/components/ProcessingState.tsx": "Loading state component that shows a spinning icon, a status message, and an optional progress bar during file processing.",
  "frontend/src/components/RelatedTools.tsx": "Displays a grid of related tool cards with icons, descriptions, and 'Try Tool' buttons, accepting an array of tool definitions as props.",
  "frontend/src/components/resume/ColorThemeSelector.tsx": "A UI component that renders a grid of selectable color themes for resumes, displaying primary, secondary, and light color swatches with a checkmark on the active selection.",
  "frontend/src/components/resume/forms/AchievementsForm.tsx": "A form component for adding, editing, and removing achievement entries (title and description) within the resume builder's data structure.",
  "frontend/src/components/resume/forms/CertificationsForm.tsx": "A form component for managing resume certifications, allowing users to add, remove, and edit certification entries with fields for name, issuer, and date.",
  "frontend/src/components/resume/forms/EducationForm.tsx": "A form component for managing resume education entries, supporting add/remove/edit operations with fields for institution, degree, field of study, dates, and grade.",
  "frontend/src/components/resume/forms/ExperienceForm.tsx": "A form component for managing work experience entries on a resume, with fields for company, position, dates, a 'currently working' checkbox, and a description textarea.",
  "frontend/src/components/resume/forms/LanguagesForm.tsx": "A form component for managing resume language entries, allowing users to add/remove languages and select proficiency levels via a dropdown.",
  "frontend/src/components/resume/forms/PersonalInfoForm.tsx": "A form component for editing personal information on a resume, including photo upload, basic contact fields, and an AI-powered professional summary generator with template-aware formatting.",
  "frontend/src/components/resume/forms/ProjectsForm.tsx": "A form component for managing resume project entries, supporting add/remove/edit with fields for title, description, technologies used, and a project link.",
  "frontend/src/components/resume/forms/ReferencesForm.tsx": "A form component for managing resume references, allowing users to add, remove, and edit reference entries (name, position, company, phone, email) with card-based layout.",
  "frontend/src/components/resume/forms/SkillsForm.tsx": "A form component for managing resume skills, allowing users to add, remove, and edit skill entries with an optional proficiency level field.",
  "frontend/src/components/resume/ResumeEditor.tsx": "An empty file with no content.",
  "frontend/src/components/resume/ResumeFormWizard.tsx": "A multi-step form wizard for building a resume, supporting step navigation, progress tracking, color theme selection, and a mobile accordion layout across sections like personal info, education, experience, and more.",
  "frontend/src/components/resume/ResumePreview.tsx": "A memoized React component that renders a live styled resume preview using provided data and a color theme, with a simulated PDF download button.",
  "frontend/src/components/resume/ResumeTemplateSelector.tsx": "An empty file with no content.",
  "frontend/src/components/SEO.tsx": "Headless component that dynamically sets document title, meta description, Open Graph, Twitter Card tags, and canonical link via useEffect.",
  "frontend/src/components/SoftwareApplicationSchema.tsx": "Renders a JSON-LD structured data script tag for a SoftwareApplication schema, including ratings, reviews, and feature list.",
  "frontend/src/components/ToolCategories.tsx": "Displays a grid of three tool category cards (Calculators, PDF Tools, Image Tools) with navigation buttons and active-state highlighting.",
  "frontend/src/components/ToolsGrid.tsx": "Renders a grid of clickable category cards for PDF Tools, Image Tools, and Resume Builder, each navigating to the respective tool section.",
  "frontend/src/contexts/LanguageContext.tsx": "A React context provider that manages multi-language support for 19 languages, handling translation loading, RTL/LTR direction, browser language detection, and localStorage persistence.",
  "frontend/src/data/resumeTemplateConfigs.ts": "Defines configuration metadata (SEO titles, descriptions, features, FAQs) for resume template types targeting Indian and international job markets.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBatchProcessor.ts": "A custom hook that manages batch file processing state, supporting adding, processing, downloading, and removing files, with sequential ZIP-like download fallback for multiple processed files.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status for ICP-based authentication.",
  "frontend/src/hooks/useProAccess.ts": "React hook that manages Pro subscription status using localStorage, exposing isPro state and methods to activate, deactivate, or toggle Pro access.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook that returns an empty object, noting all processing is client-side with no backend queries needed in Phase 1.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines dark-themed CSS custom properties using oklch colors, and adds utility classes including RTL support and scrollbar hiding.",
  "frontend/src/lib/colorThemes.ts": "Defines six predefined color themes for resumes and exports helpers to apply a theme as CSS variables and validate contrast (currently a stub).",
  "frontend/src/lib/imageProcessing.ts": "Provides browser-based image utilities including loading, resizing, compressing to a target file size, and converting between JPEG/PNG/WebP formats using Canvas API.",
  "frontend/src/lib/pageSizePresets.ts": "Defines A4, Legal, and Letter page size presets in millimeters and provides helpers to convert mm to pixels at a given DPI.",
  "frontend/src/lib/resumeFormatters.ts": "Utility functions for formatting resume data including skills as bullet lists, dates to MM/YYYY, phone numbers, proper noun capitalization, and experience duration strings.",
  "frontend/src/lib/summaryGenerator.ts": "Generates a professional resume summary string from ResumeData by calculating years of experience, extracting top skills, and composing sentences with random action verbs.",
  "frontend/src/locales/ar.json": "Arabic (RTL) translation strings for common UI labels such as navigation, file actions, tool names, and status messages.",
  "frontend/src/locales/bn.json": "Bengali translation file with structured keys covering navigation, homepage sections, footer, and common action labels for the DocMasterTools platform.",
  "frontend/src/locales/de.json": "German translation strings for common UI labels including navigation, file actions, tool names, and status messages.",
  "frontend/src/locales/en.json": "English (base) translation file with structured keys for navigation, homepage hero/sections, footer, and common action labels for the DocMasterTools platform.",
  "frontend/src/locales/es.json": "Spanish (Español) translation file containing flat key-value pairs for common UI labels such as navigation, file operations, tool names, and status messages.",
  "frontend/src/locales/fr.json": "French (Français) translation file with the same flat key-value structure as the Spanish locale, covering UI labels for navigation, file operations, and tool-related strings.",
  "frontend/src/locales/gu.json": "Gujarati translation file with a nested structure covering nav links, home page content (hero, calculator hub, PDF/image tools, resume builder), footer, and common action labels.",
  "frontend/src/locales/hi.json": "Hindi translation file with the same nested structure as the Gujarati locale, providing translations for navigation, home page sections, footer, and common UI actions.",
  "frontend/src/locales/id.json": "Indonesian (Bahasa Indonesia) translation file using a flat key-value structure for common UI labels including navigation, file operations, tool names, and status messages.",
  "frontend/src/locales/ja.json": "Japanese translation file with a flat key-value structure covering navigation, file operations, image/PDF tool labels, and status strings.",
  "frontend/src/locales/kn.json": "Kannada translation file with a nested structure mirroring the Hindi/Gujarati locales, covering nav, home page sections, footer, and common action labels.",
  "frontend/src/locales/ml.json": "Malayalam translation file with the same nested structure as other Indian-language locales, providing translations for navigation, home page content, footer, and common UI actions.",
  "frontend/src/locales/mr.json": "Marathi translation file with a nested structure identical to other Indian-language locales, covering nav, home page sections, footer, and common action labels.",
  "frontend/src/locales/pt.json": "Portuguese (Brazil) translation file containing flat key-value pairs for common UI labels such as navigation, file operations, and status messages.",
  "frontend/src/locales/ru.json": "Russian translation file with flat key-value pairs mirroring the same UI label keys as the Portuguese locale.",
  "frontend/src/locales/ta.json": "Tamil translation file with a nested structure covering navigation, home page sections, footer, and common action labels for DocMasterTools.",
  "frontend/src/locales/te.json": "Telugu translation file with the same nested structure as the Tamil locale, covering nav, home, footer, and common UI strings.",
  "frontend/src/locales/ur.json": "Urdu translation file with nested keys for navigation, home page content, footer, and common actions, written in RTL script.",
  "frontend/src/locales/zh.json": "Simplified Chinese translation file with flat key-value pairs for all common UI labels used across the application.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/pages/calculators/AgeCalculatorPage.tsx": "Page component for the Age Calculator tool, including SEO metadata, structured schema, breadcrumb navigation, related tools, and ad placeholders around the AgeCalculator component.",
  "frontend/src/pages/calculators/BMICalculatorPage.tsx": "Page component for the BMI Calculator, setting the document title and rendering the BMICalculator component with a back button and brief description section.",
  "frontend/src/pages/calculators/CGPACalculatorPage.tsx": "Page component for the CGPA Calculator, setting the document title and meta description, and rendering the CGPACalculator component with explanatory content.",
  "frontend/src/pages/calculators/CGPAToPercentageConverterPage.tsx": "Page component for the CGPA to Percentage Converter, rendering the CGPAToPercentageConverter component with a back button and brief explanation of CBSE and Engineering conversion formulas.",
  "frontend/src/pages/calculators/CompoundInterestCalculatorPage.tsx": "Page component for the Compound Interest Calculator, rendering the CompoundInterestCalculator component with a description of compounding frequencies and the compound interest formula.",
  "frontend/src/pages/calculators/DateDifferenceCalculatorPage.tsx": "Page component for the Date Difference Calculator, rendering the DateDifferenceCalculator component with a description covering date difference units and business day calculations.",
  "frontend/src/pages/calculators/DiscountCalculatorPage.tsx": "Page component for the Discount Calculator, rendering the DiscountCalculator component with a description of its two calculation modes (percentage to price and price to percentage).",
  "frontend/src/pages/calculators/DivisionCalculatorPage.tsx": "Page component for the academic Division Calculator, rendering the DivisionCalculator component with a description of Indian educational division classifications based on percentage marks.",
  "frontend/src/pages/calculators/EMICalculatorPage.tsx": "Page component for the EMI Calculator, rendering the EMICalculator component with a description of loan EMI calculation and the underlying formula.",
  "frontend/src/pages/calculators/GPACalculatorPage.tsx": "Page component for the GPA Calculator supporting both 4.0 and 10.0 scales, rendering the GPACalculator component with a description of scale usage and weighted GPA calculation.",
  "frontend/src/pages/calculators/GradeCalculatorPage.tsx": "Page component for the Grade Calculator that sets the document title and renders the GradeCalculator component with a back button and explanatory text about GPA conversion.",
  "frontend/src/pages/calculators/GSTCalculatorPage.tsx": "Page component for the GST Calculator that sets the document title and renders the GSTCalculator component with a back button and descriptive content.",
  "frontend/src/pages/calculators/LoanCalculatorPage.tsx": "Page component for the Loan Calculator that sets the document title and renders the LoanCalculator component with a back button and description of loan tenure calculation.",
  "frontend/src/pages/calculators/MarksPercentageCalculatorPage.tsx": "Page component for the Marks Percentage Calculator that sets the document title and renders the MarksPercentageCalculator component with a back button and formula explanation.",
  "frontend/src/pages/calculators/PercentageToCGPAConverterPage.tsx": "Page component for the Percentage to CGPA Converter that sets the document title and renders the PercentageToCGPAConverter component with a back button and CBSE/Engineering formula details.",
  "frontend/src/pages/calculators/ProfitLossCalculatorPage.tsx": "Page component for the Profit Loss Percentage Calculator that sets the document title and renders the ProfitLossCalculator component with a back button and profit/loss formula description.",
  "frontend/src/pages/calculators/SalaryHikeCalculatorPage.tsx": "Page component for the Salary Hike Calculator that sets the document title and renders the SalaryHikeCalculator component with a back button and description of hike and increment calculations.",
  "frontend/src/pages/calculators/SGPACalculatorPage.tsx": "Page component for the SGPA Calculator that sets the document title and renders the SGPACalculator component with a back button and weighted average formula explanation.",
  "frontend/src/pages/calculators/SimpleInterestCalculatorPage.tsx": "Page component for the Simple Interest Calculator that sets the document title and renders the SimpleInterestCalculator component with a back button and SI formula explanation.",
  "frontend/src/pages/calculators/TimeDurationCalculatorPage.tsx": "Page component for the Time Duration Calculator that sets the document title and renders the TimeDurationCalculator component with a back button and description of time difference and addition features.",
  "frontend/src/pages/CalculatorsPage.tsx": "Page component that displays a hub of calculators grouped into academic, financial, and health/general categories, each navigable via card links.",
  "frontend/src/pages/DisclaimerPage.tsx": "Static legal disclaimer page outlining the site's general information policy, tool accuracy limitations, user responsibilities, and liability disclaimers.",
  "frontend/src/pages/HomePage.tsx": "Landing page for DocMasterTools.com that displays categorized tool cards for PDF tools, image tools, and calculator categories with navigation links. Renders a hero section and tool grids using icon-labeled items.",
  "frontend/src/pages/image-tools/AadhaarPhotoResizePage.tsx": "A page component for resizing photos to Aadhaar card specifications (200×200 or 480×640 pixels) using the PhotoResizeTool component with predefined presets.",
  "frontend/src/pages/image-tools/AIDocumentEnhancerPage.tsx": "Pro-gated page for an AI Document Enhancer tool that shows feature cards (AI enhancement, text clarity, noise removal) to authenticated Pro users and prompts non-Pro or unauthenticated users with a pricing modal.",
  "frontend/src/pages/image-tools/BackgroundRemoverPage.tsx": "A page component that removes image backgrounds using canvas-based pixel manipulation, supporting transparent, white, custom color, or blur background fills with configurable output format and quality.",
  "frontend/src/pages/image-tools/CustomImageResizePage.tsx": "A feature-rich image resize page offering multiple resize modes including easy presets, percentage, custom dimensions, target file size, print dimensions, and social media presets across various platforms.",
  "frontend/src/pages/image-tools/DPIChangerPage.tsx": "A page component that changes image DPI metadata using canvas rendering, supporting preset DPI values (72–600) or a custom value with JPEG or PNG output format selection.",
  "frontend/src/pages/image-tools/ImageCompressorPage.tsx": "A page component for compressing images via canvas with configurable quality slider, output format (JPEG/PNG/WebP), and optional target file size settings.",
  "frontend/src/pages/image-tools/ImageCropperPage.tsx": "A page component for cropping images using canvas, supporting free, preset, and custom aspect ratios with pixel or percentage-based crop coordinates and configurable output format and quality.",
  "frontend/src/pages/image-tools/JPGToPNGPage.tsx": "A page tool that converts JPG images to PNG or WebP format using the Canvas API, with configurable output format, quality slider (for WebP), and optional target file size settings.",
  "frontend/src/pages/image-tools/PANPhotoResizePage.tsx": "A page that renders the PhotoResizeTool component with PAN card-specific photo presets (200×230px and 300×300px) per NSDL/UTIITSL specifications.",
  "frontend/src/pages/image-tools/PassportPhotoMakerPage.tsx": "A page that renders the PhotoResizeTool component with passport photo presets for India, US, UK, Schengen, and Canada specifications.",
  "frontend/src/pages/image-tools/PNGToJPGPage.tsx": "A page tool that converts PNG images to JPEG or WebP format using the Canvas API, with quality control, white background fill, and optional target file size settings.",
  "frontend/src/pages/image-tools/PoliceArmyPhotoPage.tsx": "A page that renders the PhotoResizeTool component with photo resize presets for Police, Army, CAPF, BSF, and CRPF recruitment specifications.",
  "frontend/src/pages/image-tools/RailwayPhotoResizePage.tsx": "A page that renders the PhotoResizeTool component with photo resize presets for Indian Railway recruitment exams including RRB NTPC, Group D, and ALP.",
  "frontend/src/pages/image-tools/SignatureResizePage.tsx": "A page that renders the PhotoResizeTool component with signature image resize presets for Aadhaar, PAN, exam applications, and a standard size.",
  "frontend/src/pages/image-tools/SmartDocumentFixerPage.tsx": "A freemium Smart Document Fixer page that allows users to upload images, apply auto-fix processing, and export results, with a daily free-fix limit (2/day) enforced via localStorage and a Pro upgrade modal for unlimited access.",
  "frontend/src/pages/image-tools/SSCPhotoResizePage.tsx": "A page that renders the PhotoResizeTool component with photo resize presets for SSC exams including CGL, CHSL, MTS, and GD specifications.",
  "frontend/src/pages/image-tools/VisaPhotoResizePage.tsx": "A page for resizing photos to visa specifications (US, UK, Schengen, Canada, Australia) using predefined presets passed to the shared PhotoResizeTool component.",
  "frontend/src/pages/image-tools/WEBPConverterPage.tsx": "An image format converter page supporting WebP, JPEG, and PNG output with configurable quality and optional target file size, using canvas-based client-side processing via AdvancedToolShell.",
  "frontend/src/pages/ImageToolsPage.tsx": "Image tools hub page that lists government photo resizers, image processing tools, and format conversion tools as categorized cards with badges. Handles navigation to individual image tool pages.",
  "frontend/src/pages/PDFToolsPage.tsx": "PDF tools hub page that renders a grid of 16 PDF tool cards and conditionally displays the selected tool component based on user selection. Manages tool selection state and back navigation.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static privacy policy page explaining that all file processing is browser-based with no server uploads, and detailing data collection practices, user rights, and contact information.",
  "frontend/src/pages/resume-builder/ResumeTemplateBuilderPage.tsx": "A resume builder page that loads a template config by slug, renders a form wizard alongside a live preview, and auto-saves draft data (including color theme) to localStorage.",
  "frontend/src/pages/ResumeBuilderPage.tsx": "Resume builder index page listing 7 Indian and 7 international resume templates as clickable cards with descriptions. Includes SEO metadata and breadcrumb navigation.",
  "frontend/src/pages/TermsOfUsePage.tsx": "Static terms of use page outlining the license grant, user responsibilities, disclaimers, and limitations of liability for Document Master Tools.",
  "frontend/src/types/resume.ts": "TypeScript type definitions for the resume builder, including interfaces for all resume sections (PersonalInfo, Education, Experience, Skills, etc.) and the top-level ResumeData and ColorTheme types.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode support, custom OKLCH-based color tokens, extended border radius, box shadow, accordion keyframe animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "A project state tracking file (version 35) summarizing all completed phases of the all-in-one utility platform, including calculators, PDF tools, image tools, resume builder, multi-language support, SEO, and Pro freemium features."
}