{
  "kind": "build_request",
  "title": "Fix and stabilize all tools across the platform",
  "projectName": "DocMasterTools",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-166",
      "text": "Audit and fix all 16 PDF tool components in frontend/src/components/pdf-tools/ to ensure each uses the AdvancedToolShell workflow correctly: settings panel renders before processing, 'Apply & Preview' triggers client-side processing and shows a preview or output summary, and the Download button remains disabled until preview is confirmed. Fix any broken props, missing imports, or non-functional processing logic in BasePDFTool, PDFMergeTool, PDFSplitTool, PDFCompressTool, PDFToImageTool, ImageToPDFTool, PDFPasswordProtectTool, PDFPasswordUnlockTool, PDFAddWatermarkTool, PDFAddPageNumbersTool, PDFOCRTool, PDFPageCounterTool, PDFRemoveBlankPagesTool, PDFReorderTool, PDFSignTool, and PDFToWordTool. Do NOT modify any calculator components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Please fix proper all tools"
        ]
      },
      "acceptanceCriteria": [
        "Every PDF tool page renders without JavaScript errors in the browser console.",
        "Every PDF tool shows its settings panel before any processing begins.",
        "Clicking 'Apply & Preview' in each PDF tool produces a visible preview or output summary.",
        "The Download button in each PDF tool is disabled until a preview has been generated.",
        "After a successful download, 'Back to Home' and 'Use Another Tool' navigation buttons appear."
      ]
    },
    {
      "id": "REQ-167",
      "text": "Audit and fix all image tool pages (PassportPhotoMakerPage, AadhaarPhotoResizePage, PANPhotoResizePage, SSCPhotoResizePage, RailwayPhotoResizePage, PoliceArmyPhotoPage, VisaPhotoResizePage, SignatureResizePage, ImageCompressorPage, ImageCropperPage, DPIChangerPage, CustomImageResizePage, JPGToPNGPage, PNGToJPGPage, WEBPConverterPage, BackgroundRemoverPage) to ensure the AdvancedToolShell workflow is fully operational: file upload works, settings panel renders all specified controls without errors, 'Apply & Preview' processes the image client-side and shows before/after comparison, and Download is enabled only after preview. Fix any broken canvas operations, missing utility imports from frontend/src/lib/imageProcessing.ts, or non-functional UI controls. Do NOT modify any calculator components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Please fix proper all tools"
        ]
      },
      "acceptanceCriteria": [
        "Every image tool page renders without JavaScript errors.",
        "File upload (drag-and-drop and click-to-select) functions correctly on all image tool pages.",
        "Settings panel controls (presets, sliders, unit selectors, toggles) all respond to user interaction.",
        "Clicking 'Apply & Preview' produces a before/after comparison showing original vs processed image with dimensions and file size.",
        "Download button is disabled before preview and enabled after preview.",
        "Batch upload mode shows per-file status (pending, processing, done, error) and allows individual or ZIP download."
      ]
    },
    {
      "id": "REQ-168",
      "text": "Audit and fix the SmartDocumentFixerPage (frontend/src/pages/image-tools/SmartDocumentFixerPage.tsx) and all its sub-components (BeforeAfterPreviewPanel, AutoPhotoSizeGenerator, AutoFeaturesPanel, ExportOptionsPanel, ProPricingModal) to ensure: drag-and-drop upload works, before/after preview renders correctly, all Auto Enhancements checkboxes apply via canvas, export downloads produce valid files, freemium gating logic (daily fix counter, watermark for free users, locked Pro features) functions correctly using localStorage, and the 'Go Pro' / ProPricingModal flow opens and closes without errors. Fix any broken canvas operations, missing imports, or state management issues. Do NOT modify any calculator components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Please fix proper all tools"
        ]
      },
      "acceptanceCriteria": [
        "SmartDocumentFixerPage loads without console errors.",
        "Image upload via drag-and-drop or click works and populates the BeforeAfterPreviewPanel.",
        "Auto White Background, Auto Compress, and Multi-Copy Layout toggles produce correct canvas output when 'Apply & Preview' is clicked.",
        "HD JPG, PNG, A4 PDF, and Multi-Photo Sheet downloads all produce downloadable files.",
        "Free users see watermark overlay, fix counter, and locked/blurred Pro features.",
        "Pro users (activated via ProPricingModal demo button) see no watermark and all features unlocked.",
        "ProPricingModal opens on 'Go Pro' click, renders pricing table, and closes correctly."
      ]
    },
    {
      "id": "REQ-169",
      "text": "Audit and fix the AIDocumentEnhancerPage (frontend/src/pages/image-tools/AIDocumentEnhancerPage.tsx) to ensure: the page renders without errors, the login/subscription gate displays correctly for unauthenticated or non-Pro users, the 'Pro Active' badge appears for authenticated Pro users, the ProPricingModal integration shows correct pricing (₹399/month, ₹3000/year), and the route /ai-document-enhancer is correctly registered in App.tsx with React.lazy and Suspense. Do NOT modify any calculator components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Please fix proper all tools"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /ai-document-enhancer renders the page without errors.",
        "Non-Pro and unauthenticated users see the login/subscription gate with pricing.",
        "Authenticated Pro users (useProAccess isPro=true + useInternetIdentity isAuthenticated=true) see the unlocked tool view and 'Pro Active' badge.",
        "ProPricingModal shows ₹399/month and ₹3000/year pricing.",
        "App.tsx routes /ai-document-enhancer using React.lazy and Suspense."
      ]
    },
    {
      "id": "REQ-170",
      "text": "Audit and fix the Resume Builder pages (ResumeBuilderPage at /resume-builder and ResumeTemplateBuilderPage at /resume-builder/[template-slug]) to ensure: the template selection grid renders all 14 templates, the multi-step form wizard navigates through all sections without errors, the live preview updates in real-time, color theme selection applies correctly, PDF download produces a valid A4-sized PDF, and auto-save to localStorage works. Fix any broken imports, missing component references, or non-functional form controls. Do NOT modify any calculator components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Please fix proper all tools"
        ]
      },
      "acceptanceCriteria": [
        "ResumeBuilderPage at /resume-builder renders all 14 template cards without errors.",
        "Clicking a template navigates to /resume-builder/[slug] and loads ResumeTemplateBuilderPage.",
        "All form wizard steps (Personal Info, Education, Experience, Skills, Projects, Certifications, Languages, Achievements, References) render and accept input.",
        "Live preview updates as form fields are filled.",
        "Color theme selector applies chosen palette to the preview.",
        "Download PDF produces a downloadable A4 PDF file.",
        "Draft data persists in localStorage on navigation away and restores on return."
      ]
    },
    {
      "id": "REQ-171",
      "text": "Audit and fix the App.tsx routing to ensure all routes are correctly registered and functional: /calculators and all /calculators/[slug] routes, /pdf-tools, /image-tools and all individual image tool routes, /resume-builder and all /resume-builder/[slug] routes, /smart-document-fixer, /ai-document-enhancer, and all language-prefixed variants (/:lang/calculators, /:lang/pdf-tools, /:lang/image-tools, /:lang/resume-builder). Fix any missing lazy imports, broken Suspense boundaries, or incorrect path mappings. Do NOT modify any calculator page components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Please fix proper all tools"
        ]
      },
      "acceptanceCriteria": [
        "Every defined route renders its correct page component without a blank screen or 404.",
        "All React.lazy imports resolve without import errors.",
        "Suspense fallback renders during lazy load and is replaced by the page component on resolution.",
        "Language-prefixed routes correctly extract the lang parameter and set the active language.",
        "Direct URL navigation to any route (not just from the home page) works correctly."
      ]
    },
    {
      "id": "REQ-172",
      "text": "Audit and fix the Header component (frontend/src/components/Header.tsx) and LanguageSelector component (frontend/src/components/LanguageSelector.tsx) to ensure: all 6 navigation links render correctly (Calculator Hub, PDF Tools, Image Tools, Resume Builder, JobsIndiaa.com external, RJY Total Manpowers.com external), the hamburger mobile menu opens and closes correctly, all 19 languages appear in the LanguageSelector dropdown, language switching updates displayed UI text without page reload, and RTL layout is applied correctly when Arabic is selected. Fix any broken event handlers, missing language codes, or faulty RTL toggling. Do NOT modify any calculator components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Please fix proper all tools"
        ]
      },
      "acceptanceCriteria": [
        "Header renders all 6 navigation links in the specified order.",
        "External links open in a new tab with rel='noopener noreferrer'.",
        "Hamburger menu functions on mobile screens (opens overlay, closes on outside click or menu item click).",
        "LanguageSelector dropdown lists all 19 languages with correct native names or codes.",
        "Selecting Hindi switches UI text to Hindi translations without page reload.",
        "Selecting Arabic sets dir='rtl' on the document root and mirrors layout correctly.",
        "Language preference persists in localStorage across page refreshes."
      ]
    },
    {
      "id": "REQ-173",
      "text": "Audit and fix the BreadcrumbNavigation component (frontend/src/components/BreadcrumbNavigation.tsx) integration across all non-calculator tool pages to ensure: breadcrumbs render the correct hierarchical path for every image tool page (Home > Image Tools > [Tool Name]), every PDF tool page (Home > PDF Tools > [Tool Name]), and every resume builder page (Home > Resume Builder > [Template Name]). Fix any missing BreadcrumbNavigation imports, incorrect path arrays, or broken onNavigate prop wiring on any tool page. Do NOT modify any calculator page components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Please fix proper all tools"
        ]
      },
      "acceptanceCriteria": [
        "Every image tool page displays a breadcrumb with Home > Image Tools > [Tool Name].",
        "Every PDF tool page displays a breadcrumb with Home > PDF Tools > [Tool Name].",
        "Every resume builder template page displays a breadcrumb with Home > Resume Builder > [Template Name].",
        "Clicking a breadcrumb item navigates to the correct parent page.",
        "Schema.org BreadcrumbList JSON-LD is injected correctly on each tool page.",
        "Breadcrumbs truncate gracefully on screens below 480px."
      ]
    },
    {
      "id": "REQ-174",
      "text": "Audit and fix the BackToHomeButton component (frontend/src/components/BackToHomeButton.tsx) integration across all non-calculator tool pages to ensure the button renders in the top-left corner above the H1 heading on every image tool page, PDF tool page, and resume builder page. Fix any pages where the button is missing, misplaced, or non-functional. Ensure the button navigates to / and meets the 44x44px minimum tap target. Do NOT modify any calculator page components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Please fix proper all tools"
        ]
      },
      "acceptanceCriteria": [
        "Every image tool, PDF tool, and resume builder page displays the Back to Home button above the H1 heading.",
        "The button is visible in both dark and light modes.",
        "Clicking the button navigates the user to the homepage (/).",
        "The button tap target is at least 44x44px on mobile.",
        "No calculator page is modified."
      ]
    },
    {
      "id": "REQ-175",
      "text": "Audit and fix the PostDownloadNavigation component (frontend/src/components/PostDownloadNavigation.tsx) integration across all non-calculator tool pages to ensure post-download buttons ('Back to Home' and 'Use Another Tool') appear correctly after a successful download on every image tool page and PDF tool page. Fix any pages where the buttons do not appear after download or navigate to incorrect hub URLs (/image-tools for image tools, /pdf-tools for PDF tools, /resume-builder for resume tools). Do NOT modify any calculator components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Please fix proper all tools"
        ]
      },
      "acceptanceCriteria": [
        "Post-download navigation buttons appear immediately after a successful download action on every applicable tool page.",
        "'Back to Home' button navigates to /.",
        "'Use Another Tool' button navigates to the correct category hub (/image-tools, /pdf-tools, or /resume-builder).",
        "Both buttons are full-width on screens below 768px with minimum height 48px.",
        "No calculator page is modified."
      ]
    },
    {
      "id": "REQ-176",
      "text": "Audit and fix the batch file processing integration in ImageCompressorPage, CustomImageResizePage, DPIChangerPage, JPGToPNGPage, PNGToJPGPage, WEBPConverterPage, BackgroundRemoverPage, PDFCompressTool, and ImageToPDFTool. Ensure the BatchFileQueue component (frontend/src/components/BatchFileQueue.tsx) renders correctly, per-file status (pending, processing, done, error) updates during processing, individual file download buttons work, and ZIP archive download using JSZip produces a valid archive. Fix any broken useBatchProcessor hook (frontend/src/hooks/useBatchProcessor.ts) logic or missing JSZip imports. Do NOT modify any calculator components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Please fix proper all tools"
        ]
      },
      "acceptanceCriteria": [
        "Users can upload multiple files at once on all listed tool pages.",
        "BatchFileQueue renders a list of queued files with names and sizes.",
        "Per-file status updates correctly to processing, done, or error during batch processing.",
        "Individual download buttons trigger correct file downloads.",
        "Download All as ZIP produces a valid ZIP archive containing all processed files.",
        "Batch queue stacks vertically on screens below 768px."
      ]
    },
    {
      "id": "REQ-177",
      "text": "Audit and fix the CalculatorsPage (frontend/src/pages/CalculatorsPage.tsx) and all 20 individual calculator page components to ensure they render without errors, calculate correct results, display SEO metadata, and navigate correctly from the hub page grid. Fix any broken onNavigate prop wiring, missing imports, or non-functional calculator logic. All calculator computation logic must remain completely unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Please fix proper all tools"
        ]
      },
      "acceptanceCriteria": [
        "CalculatorsPage renders all three category sections (Academic, Financial, Health & General) with correct tool counts.",
        "Clicking any calculator card navigates to the correct individual calculator page.",
        "All 20 calculator pages render without console errors.",
        "Each calculator produces correct output for sample inputs (e.g., CGPA calculator returns correct weighted average).",
        "SEO metadata (title, description, canonical) is set correctly on each calculator page."
      ]
    },
    {
      "id": "REQ-178",
      "text": "Audit and fix the ImageToolsPage (frontend/src/pages/ImageToolsPage.tsx) and PDFToolsPage (frontend/src/pages/PDFToolsPage.tsx) hub pages to ensure: all tool cards render with correct icons and labels, the Smart Document Fixer card displays the amber/gold PRO badge, the AI Document Enhancer card appears in a separate 'Pro Tools' sub-section with the amber/gold PRO badge, navigation to each individual tool page works correctly, and AdPlaceholder components render in the correct positions without layout shift. Fix any broken navigation callbacks or missing card entries. Do NOT modify any calculator components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Please fix proper all tools"
        ]
      },
      "acceptanceCriteria": [
        "ImageToolsPage renders all image tool cards organized by category with recognizable icons.",
        "Smart Document Fixer card shows the amber/gold PRO badge.",
        "AI Document Enhancer card appears in a clearly labeled 'Pro Tools' sub-section with the amber/gold PRO badge.",
        "PDFToolsPage renders all 16 PDF tool cards with recognizable icons.",
        "Clicking any tool card on either hub page navigates correctly to the tool page.",
        "AdPlaceholder components appear in correct positions without causing layout shift."
      ]
    },
    {
      "id": "REQ-179",
      "text": "Audit and fix the HomePage (frontend/src/pages/HomePage.tsx) to ensure: the hero section, trust badges, Calculator Hub section with category cards, PDF Tools section, Image Tools section (with Smart Document Fixer card carrying PRO badge), Resume Builder section, and separate 'Pro Tools' section (containing AI Document Enhancer) all render correctly with the dark theme. Fix any broken navigation callbacks, missing imports, or visual regressions. The Footer must remain unchanged. Do NOT modify any calculator components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Please fix proper all tools"
        ]
      },
      "acceptanceCriteria": [
        "HomePage renders all sections without console errors.",
        "Hero section displays headline, subtitle, description, CTA buttons, and three trust badges.",
        "Calculator Hub section shows three category cards (Academic, Financial, Health & General) with correct tool counts and orange links.",
        "PDF Tools section displays the tool grid with recognizable icons.",
        "Image Tools section displays cards with icons; Smart Document Fixer card shows PRO badge.",
        "Resume Builder section renders template categories.",
        "A separate 'Pro Tools' section appears below all free tool sections, containing AI Document Enhancer with PRO badge.",
        "All free tool cards display NO PRO badge.",
        "Footer remains a single-section footer with the copyright notice unchanged."
      ]
    },
    {
      "id": "REQ-180",
      "text": "Perform a global mobile responsiveness fix across all non-calculator tool pages to ensure: settings panels stack vertically on screens below 768px, before/after comparison panels switch from side-by-side to stacked on screens below 768px, 'Apply & Preview' and 'Download' buttons are full-width with minimum height 48px on mobile, Back to Home button is full-width on screens below 480px, breadcrumbs truncate gracefully with ellipsis or horizontal scroll on small screens, and the batch file queue stacks vertically below 768px. Fix any overflow, clipping, or layout-breaking issues on mobile viewports. Do NOT modify any calculator components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Please fix proper all tools"
        ]
      },
      "acceptanceCriteria": [
        "All non-calculator tool pages display correctly on a 375px wide viewport without horizontal overflow.",
        "Settings panels stack vertically below 768px on all tool pages.",
        "Before/after comparison panel shows original on top and processed below on screens under 768px.",
        "'Apply & Preview' and 'Download' buttons are full-width with min-height 48px on screens below 768px.",
        "Back to Home button is full-width on screens below 480px.",
        "Breadcrumbs do not overflow their container on screens below 480px.",
        "Batch file queue list is scrollable vertically below 768px."
      ]
    }
  ],
  "constraints": [
    "Do NOT modify any calculator component or calculator page component under any circumstances.",
    "All processing must remain client-side only — no backend calls for file or image operations.",
    "The footer copyright notice '© 2026 RJY TOTAL MANPOWERS SERVICES PRIVATE LIMITED. All Rights Reserved.' must remain completely unchanged.",
    "The single-section footer structure must remain unchanged.",
    "Do not introduce new external API dependencies or payment gateways.",
    "Freemium gating for Smart Document Fixer and AI Document Enhancer must use only localStorage — no backend or authentication changes for gating logic (AI Document Enhancer requires useInternetIdentity as already implemented)."
  ],
  "nonGoals": [
    "Adding new tools or tool categories not already in the platform.",
    "Redesigning the visual theme, color palette, or card layout structure.",
    "Modifying backend Motoko logic.",
    "Implementing real payment processing.",
    "Adding new languages beyond the 19 already supported.",
    "Changing calculator computation logic or calculator UI."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}