{
  "backend/main.mo": "Main Motoko actor defining Document, Resume, and ImageMetadata types with storage maps and comparison functions, integrating blob storage mixin for file handling.",
  "feature_evidence.json": "Feature evidence report documenting implementation of multi-language support (9 Indian languages) including LanguageSelector component, i18n context provider, and translation JSON files.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files including App.tsx routing, calculator pages, PDF/image tools, SEO components, and header/download sections.",
  "frontend/index.css": "Global Tailwind CSS with OKLCH color tokens for light/dark theme support and custom CSS variables for UI components.",
  "frontend/index.html": "HTML entry point with viewport meta tag and root div mounting the React application via main.tsx.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and referencing sitemap at docmastertools.com/sitemap.xml.",
  "frontend/public/sitemap.xml": "XML sitemap listing all calculator, PDF tool, and image tool pages with priorities and change frequencies for SEO.",
  "frontend/src/App.tsx": "Root React component with client-side routing, theme/language providers, QueryClient setup, and navigation between 50+ calculator/tool pages.",
  "frontend/src/components/AdPlaceholder.tsx": "Reusable ad placeholder component rendering banner, in-content, or sidebar ad slots with responsive dimensions and aspect ratios.",
  "frontend/src/components/BreadcrumbNavigation.tsx": "Renders a breadcrumb navigation component with clickable items and chevron separators, including JSON-LD structured data for SEO.",
  "frontend/src/components/calculators/AgeCalculator.tsx": "Calculates age from birthdate input, displaying years/months/days, total time units (weeks, days, hours), and next birthday countdown information.",
  "frontend/src/components/calculators/BMICalculator.tsx": "BMI calculator with support for metric (kg/cm) and imperial (lbs/ft-in) units, displaying BMI value, health category, and healthy weight range.",
  "frontend/src/components/calculators/CGPACalculator.tsx": "Multi-semester CGPA calculator allowing users to add/remove semesters and courses, inputting grade points and credits to compute overall CGPA.",
  "frontend/src/components/calculators/CGPAToPercentageConverter.tsx": "Converts CGPA to percentage using either CBSE formula (×9.5) or Engineering formula (×10) based on user selection.",
  "frontend/src/components/calculators/CompoundInterestCalculator.tsx": "React component that calculates compound interest based on principal, rate, time, and compounding frequency, displaying the final amount and interest earned.",
  "frontend/src/components/calculators/DateDifferenceCalculator.tsx": "React component that calculates the difference between two dates in years, months, days, weeks, and optionally excludes weekends from the count.",
  "frontend/src/components/calculators/DiscountCalculator.tsx": "React component that calculates discounts either from a percentage or from a sale price, showing the discount amount and final price.",
  "frontend/src/components/calculators/DivisionCalculator.tsx": "React component that determines academic division (First, Second, Third, or Fail) based on percentage input with color-coded results.",
  "frontend/src/components/calculators/EMICalculator.tsx": "React component that calculates monthly EMI (Equated Monthly Installment) for loans based on principal, interest rate, and tenure in months or years.",
  "frontend/src/components/calculators/GPACalculator.tsx": "React component that calculates GPA on either 4.0 or 10.0 scale by allowing users to add multiple courses with grades and credits.",
  "frontend/src/components/calculators/GradeCalculator.tsx": "React component for calculating GPA from multiple courses with letter grades (A+ to F) and credits, allowing users to add/remove courses dynamically.",
  "frontend/src/components/calculators/GSTCalculator.tsx": "React component for calculating GST (Goods and Services Tax) with modes to add or remove GST from amounts, supporting preset rates (5%, 12%, 18%, 28%) and custom rates.",
  "frontend/src/components/calculators/LoanCalculator.tsx": "React component for calculating loan tenure and total interest based on loan amount, annual interest rate, and monthly payment amount.",
  "frontend/src/components/calculators/MarksPercentageCalculator.tsx": "React component for calculating percentage from obtained and total marks, displaying pass/fail status based on 40% threshold.",
  "frontend/src/components/calculators/PercentageToCGPAConverter.tsx": "React component for converting percentage to CGPA using either CBSE formula (÷9.5) or Engineering formula (÷10).",
  "frontend/src/components/calculators/ProfitLossCalculator.tsx": "React component for calculating profit or loss amount and percentage from cost price and selling price inputs.",
  "frontend/src/components/calculators/SalaryHikeCalculator.tsx": "React component that calculates salary increases either from a percentage hike or from a desired salary amount, showing monthly and annual increments.",
  "frontend/src/components/calculators/SGPACalculator.tsx": "React component for calculating SGPA (Semester Grade Point Average) by allowing users to add multiple courses with grade points and credits, then computing the weighted average.",
  "frontend/src/components/calculators/SimpleInterestCalculator.tsx": "React component that calculates simple interest using principal, rate, and time inputs, displaying both the interest amount and total amount with the formula.",
  "frontend/src/components/calculators/TimeDurationCalculator.tsx": "React component with three modes: calculating duration between two times, adding time to a base time, or subtracting time from a base time.",
  "frontend/src/components/DownloadSection.tsx": "Displays download UI for single or multiple files with file size formatting, download buttons, and options to process another file or clear.",
  "frontend/src/components/FAQSchema.tsx": "Injects FAQ structured data (JSON-LD) into the page for SEO purposes using schema.org format.",
  "frontend/src/components/FileUploadZone.tsx": "Provides a drag-and-drop file upload zone with click-to-upload functionality, file size validation, and touch support for mobile devices.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with three columns of links (tools, legal), company copyright, and a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Displays the sticky header with logo, navigation to calculators, and language selector component.",
  "frontend/src/components/Hero.tsx": "Renders the homepage hero section with headline, description, CTA buttons, feature stats, and a hero banner image.",
  "frontend/src/components/image-tools/BackgroundChangerTool.tsx": "React component for changing image backgrounds to solid colors with preset color options and custom color picker, includes file upload and download functionality.",
  "frontend/src/components/image-tools/BackgroundRemoverTool.tsx": "React component for removing backgrounds from images using AI-powered detection, with file upload, processing state, and download capabilities.",
  "frontend/src/components/image-tools/ImageCompressorTool.tsx": "React component for compressing images with adjustable quality slider (10-100%). Handles file upload, simulates compression by reducing file size based on quality percentage, and provides download functionality.",
  "frontend/src/components/image-tools/PhotoKBResizerTool.tsx": "React component for resizing images to specific target file sizes (20KB, 50KB, or custom). Provides preset size options and simulates resizing by creating blobs of the target size.",
  "frontend/src/components/image-tools/PhotoResizeTool.tsx": "Configurable React component for resizing photos with preset dimensions or custom sizes. Features aspect ratio maintenance, quality adjustment, target file size compression, and real-time preview using actual image processing utilities.",
  "frontend/src/components/LanguageSelector.tsx": "Dropdown menu for selecting from 10 languages (English, Hindi, Bengali, etc.) with native language names and active state indicator.",
  "frontend/src/components/pdf-tools/BasePDFTool.tsx": "Reusable base component for PDF tools that provides common functionality including file upload, processing simulation, and download. Accepts configuration props for title, description, file types, and output settings.",
  "frontend/src/components/pdf-tools/ImageToPDFTool.tsx": "React component for converting multiple images to a single PDF document. Supports selecting multiple image files and simulates PDF generation with download capability.",
  "frontend/src/components/pdf-tools/PDFAddPageNumbersTool.tsx": "Wrapper component that uses BasePDFTool to provide page numbering functionality for PDF documents with preconfigured settings.",
  "frontend/src/components/pdf-tools/PDFAddWatermarkTool.tsx": "Wrapper component that uses BasePDFTool to provide watermark addition functionality for PDF documents with preconfigured settings.",
  "frontend/src/components/pdf-tools/PDFCompressTool.tsx": "React component for compressing PDF files with auto or manual quality settings, displays compression ratio, and allows download of the compressed result.",
  "frontend/src/components/pdf-tools/PDFMergeTool.tsx": "React component for merging multiple PDF files into a single document, with file list management and download functionality.",
  "frontend/src/components/pdf-tools/PDFOCRTool.tsx": "Wrapper component using BasePDFTool to perform OCR on scanned PDFs and convert them to searchable documents.",
  "frontend/src/components/pdf-tools/PDFPageCounterTool.tsx": "Wrapper component using BasePDFTool to count and report the total number of pages in a PDF document.",
  "frontend/src/components/pdf-tools/PDFPasswordProtectTool.tsx": "Wrapper component using BasePDFTool to add password protection to PDF documents.",
  "frontend/src/components/pdf-tools/PDFPasswordUnlockTool.tsx": "Wrapper component using BasePDFTool to remove password protection from locked PDF documents.",
  "frontend/src/components/pdf-tools/PDFRemoveBlankPagesTool.tsx": "Wrapper component using BasePDFTool to automatically detect and remove blank pages from PDFs.",
  "frontend/src/components/pdf-tools/PDFReorderTool.tsx": "Wrapper component using BasePDFTool to rearrange pages in a PDF document via drag-and-drop.",
  "frontend/src/components/pdf-tools/PDFSignTool.tsx": "Wrapper component using BasePDFTool to add digital signatures to PDF documents.",
  "frontend/src/components/pdf-tools/PDFSplitTool.tsx": "React component for splitting PDFs into multiple files based on page ranges or individual pages, with download support for each split file.",
  "frontend/src/components/pdf-tools/PDFToImageTool.tsx": "React component for converting PDF pages to image files (PNG/JPG), packaged as a downloadable ZIP archive.",
  "frontend/src/components/pdf-tools/PDFToWordTool.tsx": "Wrapper component using BasePDFTool to convert PDF documents to editable Word (.docx) format.",
  "frontend/src/components/pdf-tools/WordToPDFTool.tsx": "Wrapper component using BasePDFTool to convert Word documents (.doc, .docx) to PDF format.",
  "frontend/src/components/ProcessingState.tsx": "Shows a loading state with spinner, optional progress bar, and customizable processing message.",
  "frontend/src/components/RelatedTools.tsx": "Displays a grid of related tool cards with icons, descriptions, and action buttons for navigation.",
  "frontend/src/components/resume/ColorThemeSelector.tsx": "React component for selecting color themes with visual swatches showing primary, secondary, and light colors from predefined theme options.",
  "frontend/src/components/resume/forms/AchievementsForm.tsx": "Form component for adding, editing, and removing achievement entries with title and description fields.",
  "frontend/src/components/resume/forms/CertificationsForm.tsx": "Form component for managing certification entries including name, issuing organization, and date obtained.",
  "frontend/src/components/resume/forms/EducationForm.tsx": "Form component for managing education entries with institution, degree, field of study, dates, and grade information.",
  "frontend/src/components/resume/forms/ExperienceForm.tsx": "Form component for managing work experience entries with company, position, dates, current employment checkbox, and description fields.",
  "frontend/src/components/resume/forms/LanguagesForm.tsx": "React form component for managing language entries in a resume, allowing users to add, remove, and edit language names and proficiency levels (Native, Fluent, Advanced, Intermediate, Basic).",
  "frontend/src/components/resume/forms/PersonalInfoForm.tsx": "React form component for personal information section with photo upload, basic contact fields, and AI-powered professional summary generation. Includes template-specific formatting for Indian vs international resumes.",
  "frontend/src/components/resume/forms/ProjectsForm.tsx": "React form component for managing project entries in a resume, allowing users to add, remove, and edit project title, description, technologies used, and project links.",
  "frontend/src/components/resume/forms/ReferencesForm.tsx": "React form component for managing professional references in a resume, allowing users to add, remove, and edit reference name, position, company, phone, and email.",
  "frontend/src/components/resume/forms/SkillsForm.tsx": "React form component for managing skills entries in a resume, allowing users to add, remove, and edit skill names and optional proficiency levels.",
  "frontend/src/components/resume/ResumeEditor.tsx": "File content is truncated; appears to be a resume editing component (details unavailable).",
  "frontend/src/components/resume/ResumeFormWizard.tsx": "Multi-step wizard component for building resumes with progress tracking, navigation controls, and responsive accordion/stepper layouts for mobile and desktop views.",
  "frontend/src/components/resume/ResumePreview.tsx": "Live preview component that renders resume data with customizable color themes and provides PDF download functionality.",
  "frontend/src/components/resume/ResumeTemplateSelector.tsx": "Empty file for resume template selection functionality.",
  "frontend/src/components/SEO.tsx": "Manages document title and meta tags (description, Open Graph, Twitter Card, canonical) dynamically via useEffect.",
  "frontend/src/components/ToolCategories.tsx": "Displays a grid of three tool category cards (Calculator Hub, PDF Tools, Image Tools) with icons, descriptions, and navigation buttons to explore each category.",
  "frontend/src/components/ToolsGrid.tsx": "Renders a landing page grid showcasing three main tool categories (PDF Tools, Image Tools, Resume Builder) with hover effects and click navigation to category pages.",
  "frontend/src/contexts/LanguageContext.tsx": "React context provider for multi-language support with translation caching, browser language detection, localStorage persistence, and dynamic translation file loading for 10 supported languages.",
  "frontend/src/data/resumeTemplateConfigs.ts": "Configuration data defining resume template metadata including SEO titles, descriptions, target audiences, key features, and FAQs for Indian and International resume categories.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous actor for backend communication, invalidating dependent queries when the actor changes based on Internet Identity authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP, managing login/logout flows, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Minimal placeholder hook for backend queries; currently returns empty object as all processing happens client-side in Phase 1.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors, sidebar styling, and a subtle pulse animation keyframe.",
  "frontend/src/lib/colorThemes.ts": "Defines six predefined color themes for resumes (Professional Blue, Corporate Black, etc.) with utilities to apply themes as CSS variables and validate contrast.",
  "frontend/src/lib/imageProcessing.ts": "Provides image manipulation utilities including loading, resizing, compression to target file size, format conversion, and aspect ratio calculation using HTML5 Canvas.",
  "frontend/src/lib/resumeFormatters.ts": "Utility functions for formatting resume data including skills as bullets, dates to MM/YYYY, phone numbers (Indian/international), proper noun capitalization, and experience duration calculation.",
  "frontend/src/lib/summaryGenerator.ts": "Generates professional resume summaries by calculating years of experience, extracting top skills, and composing narrative text with action verbs based on resume data.",
  "frontend/src/locales/bn.json": "Bengali (Bangla) translation file containing localized strings for navigation, home page content, calculator hub, PDF/image tools, resume builder, footer, and common UI elements.",
  "frontend/src/locales/en.json": "English locale file containing translations for navigation, home page content (hero, calculator hub, PDF/image tools, resume builder), footer, and common UI strings.",
  "frontend/src/locales/gu.json": "Gujarati locale file with translations mirroring the English structure for all UI elements including navigation, home sections, footer, and common action labels.",
  "frontend/src/locales/hi.json": "Hindi locale file providing translations for the entire application interface including navigation menus, home page sections, footer links, and common button/action text.",
  "frontend/src/locales/kn.json": "Kannada locale file containing complete translations for navigation, home page content, calculator/PDF/image tool descriptions, footer, and common UI strings.",
  "frontend/src/locales/ml.json": "Malayalam locale file with translations for all application text including navigation, hero section, tool descriptions, footer content, and common action buttons.",
  "frontend/src/locales/mr.json": "Marathi locale file providing translations for navigation, home page sections (hero, calculators, PDF/image tools), footer, and common UI elements like buttons and status messages.",
  "frontend/src/locales/ta.json": "Tamil (ta) translation file containing localized strings for navigation, home page, footer, and common UI elements for the Document Master Tools application.",
  "frontend/src/locales/te.json": "Telugu (te) translation file containing localized strings for navigation, home page, footer, and common UI elements for the Document Master Tools application.",
  "frontend/src/locales/ur.json": "Urdu (ur) translation file containing localized strings for navigation, home page, footer, and common UI elements for the Document Master Tools application.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component into the DOM.",
  "frontend/src/pages/calculators/AgeCalculatorPage.tsx": "Age calculator tool page with SEO metadata, breadcrumb navigation, the AgeCalculator component, related tools suggestions (date difference, BMI, time duration), and ad placements. Includes descriptive content about calculating exact age from date of birth.",
  "frontend/src/pages/calculators/BMICalculatorPage.tsx": "Page component for BMI Calculator that displays the calculator component, back navigation, title/description, informational content about BMI categories and formulas, and an advertisement placeholder.",
  "frontend/src/pages/calculators/CGPACalculatorPage.tsx": "Page component for CGPA Calculator that renders the calculator, sets page metadata, and includes educational content explaining CGPA calculation formula and use cases for students.",
  "frontend/src/pages/calculators/CGPAToPercentageConverterPage.tsx": "Page component for CGPA to Percentage Converter that displays the converter tool and explains CBSE (×9.5) and Engineering (×10) conversion formulas.",
  "frontend/src/pages/calculators/CompoundInterestCalculatorPage.tsx": "Page component for Compound Interest Calculator that renders the calculator and provides information about compound interest formula with various compounding frequencies.",
  "frontend/src/pages/calculators/DateDifferenceCalculatorPage.tsx": "Page component for Date Difference Calculator that displays the calculator and describes its use for calculating time spans in years, months, days, and business days.",
  "frontend/src/pages/calculators/DiscountCalculatorPage.tsx": "Page component for Discount Calculator that renders the calculator and explains bidirectional discount calculation (percentage to price or price to percentage).",
  "frontend/src/pages/calculators/DivisionCalculatorPage.tsx": "Page component for academic Division Calculator that determines 1st/2nd/3rd division classification based on percentage marks using Indian educational standards.",
  "frontend/src/pages/calculators/EMICalculatorPage.tsx": "Page component for EMI Calculator that displays the loan EMI calculator and explains the EMI formula for calculating monthly installments on loans.",
  "frontend/src/pages/calculators/GPACalculatorPage.tsx": "Page component for GPA Calculator supporting both 4.0 and 10.0 scales, with course-wise grade and credit hour input for weighted GPA calculation.",
  "frontend/src/pages/calculators/GradeCalculatorPage.tsx": "Page component for Grade Calculator that converts letter grades (A+, A, B, etc.) to numerical grade points and calculates weighted GPA.",
  "frontend/src/pages/calculators/GSTCalculatorPage.tsx": "Page component for GST Calculator that supports adding or removing GST from amounts with standard Indian GST rates (5%, 12%, 18%, 28%) and custom rates.",
  "frontend/src/pages/calculators/LoanCalculatorPage.tsx": "Page component for Loan Calculator that determines loan tenure and total interest based on monthly payment capacity, validating payment sufficiency.",
  "frontend/src/pages/calculators/MarksPercentageCalculatorPage.tsx": "Page component for marks percentage calculator that displays the calculator component, back navigation, and informational content about calculating exam percentages from obtained and total marks.",
  "frontend/src/pages/calculators/PercentageToCGPAConverterPage.tsx": "Page component for percentage to CGPA converter that renders the converter component with explanatory content about CBSE and Engineering conversion formulas.",
  "frontend/src/pages/calculators/ProfitLossCalculatorPage.tsx": "Page component for profit/loss percentage calculator that displays the calculator and explains how to calculate profit or loss from cost and selling prices.",
  "frontend/src/pages/calculators/SalaryHikeCalculatorPage.tsx": "Page component for salary hike calculator that displays the calculator and explains how to calculate new salary after percentage increases or required hike percentages.",
  "frontend/src/pages/calculators/SGPACalculatorPage.tsx": "Page component for SGPA calculator that renders the calculator component and provides information about calculating Semester Grade Point Average using weighted averages.",
  "frontend/src/pages/calculators/SimpleInterestCalculatorPage.tsx": "Page component for simple interest calculator that renders the calculator and explains the SI = (P × R × T) / 100 formula for loans and investments.",
  "frontend/src/pages/calculators/TimeDurationCalculatorPage.tsx": "Page component for time duration calculator that displays the calculator for computing time differences between start and end times, including across midnight.",
  "frontend/src/pages/CalculatorsPage.tsx": "Page component displaying categorized calculator tools (academic, financial, health/general) with navigation back to home and to individual calculator pages.",
  "frontend/src/pages/DisclaimerPage.tsx": "Static page component displaying legal disclaimer content covering general information, tool accuracy, user responsibility, and liability limitations.",
  "frontend/src/pages/HomePage.tsx": "Main landing page component showcasing PDF tools, calculator categories, resume templates, and app download banner with SEO metadata and structured data.",
  "frontend/src/pages/image-tools/AadhaarPhotoResizePage.tsx": "Page component that configures PhotoResizeTool with Aadhaar-specific presets (200×200 and 480×640) and file size limits for government document photos.",
  "frontend/src/pages/image-tools/BackgroundRemoverPage.tsx": "Page component for background remover tool with file upload zone; currently shows UI structure but processing logic is not fully implemented.",
  "frontend/src/pages/image-tools/CustomImageResizePage.tsx": "Page component that configures PhotoResizeTool with various presets including HD, social media dimensions (Instagram, Facebook), and custom sizing options.",
  "frontend/src/pages/image-tools/DPIChangerPage.tsx": "Page component for DPI changer tool with file upload zone; UI structure is present but DPI modification logic is not fully implemented.",
  "frontend/src/pages/image-tools/ImageCompressorPage.tsx": "Page component for image compression that allows quality adjustment via slider, displays original/compressed previews, and handles compression using resizeImage utility with download functionality.",
  "frontend/src/pages/image-tools/ImageCropperPage.tsx": "A placeholder page for image cropping functionality that displays a file upload zone for image files. Currently only handles file selection with basic image type validation.",
  "frontend/src/pages/image-tools/JPGToPNGPage.tsx": "Converts JPG/JPEG images to PNG format with full conversion workflow including file upload, processing state, and download functionality. Shows original and converted file sizes with reset capability.",
  "frontend/src/pages/image-tools/PANPhotoResizePage.tsx": "Wrapper component for resizing photos to PAN card specifications (200x230px, max 50KB) using the PhotoResizeTool component with a single preset.",
  "frontend/src/pages/image-tools/PassportPhotoMakerPage.tsx": "Comprehensive passport photo resizing tool with presets for India, US, UK, and Schengen visas. Includes detailed FAQ section and related tools information for SEO.",
  "frontend/src/pages/image-tools/PNGToJPGPage.tsx": "Converts PNG images to JPG format with adjustable quality slider (50-100%), showing file size comparison and providing download functionality. Includes processing state and reset capability.",
  "frontend/src/pages/image-tools/PoliceArmyPhotoPage.tsx": "Wrapper component for resizing photos for Police, Army, and CAPF recruitment (300x400px, max 100KB) using PhotoResizeTool with three presets.",
  "frontend/src/pages/image-tools/RailwayPhotoResizePage.tsx": "Wrapper component for resizing photos for Indian Railway recruitment exams (RRB, NTPC) with standard 300x400px, 100KB specifications.",
  "frontend/src/pages/image-tools/SignatureResizePage.tsx": "Wrapper component for resizing signatures with four presets for different applications (Standard, Aadhaar, PAN, Exam) with varying dimensions and file size limits.",
  "frontend/src/pages/image-tools/SSCPhotoResizePage.tsx": "Wrapper component for resizing photos for SSC exams (CGL, CHSL) with three presets all using 300x400px, 100KB specifications.",
  "frontend/src/pages/image-tools/VisaPhotoResizePage.tsx": "Wrapper component for resizing visa photos with presets for US, UK, Schengen, and Canada visas, each with country-specific dimension and file size requirements.",
  "frontend/src/pages/image-tools/WEBPConverterPage.tsx": "A placeholder page for WEBP image conversion functionality that displays a file upload zone. Currently only handles file selection with basic image type validation.",
  "frontend/src/pages/ImageToolsPage.tsx": "Displays a catalog of image tools organized into three categories: government document photos (passport, Aadhaar, PAN, etc.), image processing tools (compressor, cropper, DPI changer), and format conversion tools (JPG/PNG/WEBP converters, background remover). Provides navigation back to home and to individual tool pages.",
  "frontend/src/pages/PDFToolsPage.tsx": "Main PDF tools page that displays a grid of 16 PDF manipulation tools (merge, split, compress, convert, password protect, OCR, etc.) and conditionally renders the selected tool component. Manages tool selection state and provides navigation back to home.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static privacy policy page explaining that all file processing happens in the browser, no files are uploaded or stored, and only anonymous usage statistics may be collected. Includes sections on data processing, third-party services, user rights, and contact information.",
  "frontend/src/pages/resume-builder/ResumeTemplateBuilderPage.tsx": "Main resume builder page that combines ResumeFormWizard and ResumePreview components with template configuration, color theme selection, and localStorage auto-save. Includes SEO, breadcrumbs, and related tools sections.",
  "frontend/src/pages/ResumeBuilderPage.tsx": "Landing page for resume builder featuring 14 templates split into Indian formats (fresher, government, private, Hindi, biodata, teacher, police/army) and international formats (ATS, US, UK, Canada, Europass, creative, corporate). Includes SEO metadata, breadcrumbs, and ad placeholders.",
  "frontend/src/pages/TermsOfUsePage.tsx": "Static terms of use page outlining service license, user responsibilities, disclaimers, limitations of liability, and governing law. Explains permitted uses of the document processing tools and legal protections for the service provider.",
  "frontend/src/types/resume.ts": "TypeScript type definitions for resume builder including 14 template types (fresher, government, ATS, international formats) and interfaces for personal info, education, experience, skills, projects, certifications, languages, achievements, references, and color themes.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color system using OKLCH color space, extended theme with sidebar/chart colors, custom animations (accordion), border radius variables, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document tracking 6 completed phases: Calculator Hub, PDF Tools, Image Tools, SEO/Monetization, Resume Builder, and Multi-Language System (9 languages) with architectural notes emphasizing client-side processing, mobile-first design, and SEO optimization for all pages."
}