{
  "backend/main.mo": "Main Motoko actor defining storage types and maps for documents, resumes (with templates and multi-section content), and image metadata, using blob-storage mixins and core libraries.",
  "feature_evidence.json": "Feature evidence report documenting implemented resume builder features including template selection, multi-step form wizard, live preview, and color theme selector with associated files and test IDs.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files covering routing, PDF/image tools, calculator pages, SEO optimization, and component structures.",
  "frontend/index.css": "Global Tailwind CSS with OKLCH-based design tokens for light/dark themes and custom CSS variables for colors, borders, and UI elements.",
  "frontend/index.html": "HTML entry point with viewport meta tag and root div for React mounting, titled 'Document Master Tools Phase 1'.",
  "frontend/public/robots.txt": "Robots.txt allowing all user agents and referencing sitemap at docmastertools.com.",
  "frontend/public/sitemap.xml": "XML sitemap listing all calculator, PDF tool, image tool, and resume builder pages with priorities and change frequencies for SEO.",
  "frontend/src/App.tsx": "Main React app with QueryClient, ThemeProvider, Header, Toaster, and client-side routing logic for all pages including calculators, PDF/image tools, and resume builder.",
  "frontend/src/components/AdPlaceholder.tsx": "Reusable ad placeholder component supporting banner, in-content, and sidebar ad types with responsive dimensions and aspect ratios.",
  "frontend/src/components/BreadcrumbNavigation.tsx": "Renders a breadcrumb navigation component with clickable items and generates JSON-LD structured data for SEO. Displays chevron separators between items and highlights the current page.",
  "frontend/src/components/calculators/AgeCalculator.tsx": "Calculates age from birthdate input, displaying years/months/days, total time units (months, weeks, days, hours), and next birthday countdown. Shows results in multiple cards with formatted breakdowns.",
  "frontend/src/components/calculators/BMICalculator.tsx": "BMI calculator supporting metric (kg/cm) and imperial (lbs/ft-in) units with radio group toggles. Displays BMI value, category (underweight/normal/overweight/obese), and healthy weight range.",
  "frontend/src/components/calculators/CGPACalculator.tsx": "Multi-semester CGPA calculator allowing dynamic addition/removal of semesters and courses. Computes weighted average from grade points and credits across all semesters.",
  "frontend/src/components/calculators/CGPAToPercentageConverter.tsx": "Converts CGPA to percentage using selectable formulas (CBSE: CGPA × 9.5 or Engineering: CGPA × 10). Displays result with formula indicator.",
  "frontend/src/components/calculators/CompoundInterestCalculator.tsx": "Calculates compound interest with inputs for principal, rate, time, and compounding frequency (yearly to daily). Shows principal, interest earned, and final amount breakdown.",
  "frontend/src/components/calculators/DateDifferenceCalculator.tsx": "React component that calculates the difference between two dates, showing years, months, days, weeks, and total days. Includes an option to exclude weekends and count only weekdays.",
  "frontend/src/components/calculators/DiscountCalculator.tsx": "React component that calculates discounts either from a percentage or from a sale price, showing discount amount, final price, and savings. Supports two calculation modes with radio button selection.",
  "frontend/src/components/calculators/DivisionCalculator.tsx": "React component that determines academic division (First, Second, Third, or Fail) based on percentage input. Displays color-coded results and shows division criteria thresholds.",
  "frontend/src/components/calculators/EMICalculator.tsx": "React component that calculates Equated Monthly Installment (EMI) for loans based on principal amount, interest rate, and tenure. Shows monthly EMI, total interest, and total amount with support for months or years tenure.",
  "frontend/src/components/calculators/GPACalculator.tsx": "React component that calculates GPA from multiple courses with grades and credits. Supports both 4.0 and 10.0 scales with dynamic course addition/removal functionality.",
  "frontend/src/components/calculators/GradeCalculator.tsx": "A React component that calculates GPA from multiple courses by allowing users to input letter grades (A+ to F) and credits, then computing weighted average using a 10-point grade scale.",
  "frontend/src/components/calculators/GSTCalculator.tsx": "React component that calculates GST (Goods and Services Tax) with modes to add or remove GST from amounts. Supports preset rates (5%, 12%, 18%, 28%) and custom rate input.",
  "frontend/src/components/calculators/LoanCalculator.tsx": "A loan calculator component that computes loan tenure in months/years, total interest, and total repayment amount based on loan amount, annual interest rate, and monthly payment inputs.",
  "frontend/src/components/calculators/MarksPercentageCalculator.tsx": "A simple calculator that converts obtained marks and total marks into a percentage, displaying pass/fail status based on a 40% threshold.",
  "frontend/src/components/calculators/PercentageToCGPAConverter.tsx": "A converter component that transforms percentage scores to CGPA using either CBSE formula (÷9.5) or Engineering formula (÷10) based on user selection.",
  "frontend/src/components/calculators/ProfitLossCalculator.tsx": "A financial calculator that determines profit or loss amount and percentage by comparing cost price and selling price, with visual indicators for profit (green) or loss (red).",
  "frontend/src/components/calculators/SalaryHikeCalculator.tsx": "React component that calculates salary hikes either from a percentage increase or from a desired target salary, displaying monthly and annual increments.",
  "frontend/src/components/calculators/SGPACalculator.tsx": "A semester GPA calculator that computes SGPA by allowing users to add multiple courses with grade points (0-10) and credits, calculating the weighted average.",
  "frontend/src/components/calculators/SimpleInterestCalculator.tsx": "React component that calculates simple interest using the formula SI = (P × R × T) / 100, showing both interest earned and total amount.",
  "frontend/src/components/calculators/TimeDurationCalculator.tsx": "React component with three modes: calculate duration between two times, add time to a base time, or subtract time from a base time.",
  "frontend/src/components/DownloadSection.tsx": "Displays download UI for processed files with support for both single and multiple file modes. Shows file details, download buttons, and options to process another file or clear results.",
  "frontend/src/components/FAQSchema.tsx": "Generates JSON-LD structured data for FAQ pages following Schema.org FAQPage format. Accepts an array of question-answer pairs.",
  "frontend/src/components/FileUploadZone.tsx": "Provides a drag-and-drop file upload zone with click-to-upload functionality and file size validation. Supports touch devices and displays upload illustration and size limits.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with three columns: company info, quick links to tool categories, and legal links. Includes copyright notice and caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Displays the sticky site header with logo/home button and optional navigation to calculators section. Uses backdrop blur effect for modern appearance.",
  "frontend/src/components/Hero.tsx": "Renders the homepage hero section with headline, description, CTA buttons, and feature statistics (100% Private, 20+ Tools, Free). Includes hero banner image.",
  "frontend/src/components/image-tools/BackgroundChangerTool.tsx": "React component that allows users to upload an image and replace its background with a solid color selected from presets or custom color picker.",
  "frontend/src/components/image-tools/BackgroundRemoverTool.tsx": "React component that removes backgrounds from uploaded images using simulated AI processing, outputting a PNG with transparent background.",
  "frontend/src/components/image-tools/ImageCompressorTool.tsx": "React component that compresses uploaded images with adjustable quality slider (10-100%), showing original and compressed file sizes.",
  "frontend/src/components/image-tools/PhotoKBResizerTool.tsx": "React component for resizing images to specific file sizes (20KB-200KB or custom). Provides file upload, target size selection, processing simulation, and download functionality.",
  "frontend/src/components/image-tools/PhotoResizeTool.tsx": "Reusable React component for resizing and compressing images with preset dimensions or custom settings. Supports aspect ratio maintenance, quality adjustment, preview, and actual image processing using imageProcessing utilities.",
  "frontend/src/components/pdf-tools/BasePDFTool.tsx": "Generic base component for PDF tools that provides common functionality including file upload, processing simulation, and download. Accepts configuration props for title, description, and file handling.",
  "frontend/src/components/pdf-tools/ImageToPDFTool.tsx": "React component for converting multiple images to a single PDF document. Handles multi-file selection, processing simulation, and PDF download.",
  "frontend/src/components/pdf-tools/PDFAddPageNumbersTool.tsx": "Wrapper component that uses BasePDFTool to provide page numbering functionality for PDF documents.",
  "frontend/src/components/pdf-tools/PDFAddWatermarkTool.tsx": "Wrapper component that uses BasePDFTool to provide watermark addition functionality for PDF documents.",
  "frontend/src/components/pdf-tools/PDFCompressTool.tsx": "React component for compressing PDF files with automatic or manual quality control. Features tabbed interface for compression modes, quality slider, and shows compression statistics.",
  "frontend/src/components/pdf-tools/PDFMergeTool.tsx": "React component for merging multiple PDF files into a single document. Handles file upload, file list management, simulated merging process, and download of the merged PDF.",
  "frontend/src/components/pdf-tools/PDFOCRTool.tsx": "Wrapper component that uses BasePDFTool to provide OCR functionality for converting scanned PDFs to searchable text documents.",
  "frontend/src/components/pdf-tools/PDFPageCounterTool.tsx": "Wrapper component that uses BasePDFTool to count the total number of pages in a PDF document.",
  "frontend/src/components/pdf-tools/PDFPasswordProtectTool.tsx": "Wrapper component that uses BasePDFTool to add password protection to PDF documents.",
  "frontend/src/components/pdf-tools/PDFPasswordUnlockTool.tsx": "Wrapper component that uses BasePDFTool to remove password protection from PDF documents.",
  "frontend/src/components/pdf-tools/PDFRemoveBlankPagesTool.tsx": "Wrapper component that uses BasePDFTool to automatically detect and remove blank pages from PDFs.",
  "frontend/src/components/pdf-tools/PDFReorderTool.tsx": "Wrapper component that uses BasePDFTool to enable drag-and-drop reordering of PDF pages.",
  "frontend/src/components/pdf-tools/PDFSignTool.tsx": "Wrapper component that uses BasePDFTool to add digital signatures to PDF documents.",
  "frontend/src/components/pdf-tools/PDFSplitTool.tsx": "React component for splitting PDFs into individual pages or extracting specific page ranges. Handles file upload, page range input, simulated splitting, and download of multiple split PDF files.",
  "frontend/src/components/pdf-tools/PDFToImageTool.tsx": "React component for converting PDF pages to high-quality images (PNG/JPG). Handles file upload, simulated conversion, and download of images as a ZIP file.",
  "frontend/src/components/pdf-tools/PDFToWordTool.tsx": "Wrapper component that uses BasePDFTool to convert PDF documents to editable Word format (.docx).",
  "frontend/src/components/pdf-tools/WordToPDFTool.tsx": "Wrapper component that uses BasePDFTool to convert Word documents (.doc, .docx) to PDF format.",
  "frontend/src/components/ProcessingState.tsx": "Shows a loading state with animated spinner, processing icon, custom message, and optional progress bar. Used during file processing operations.",
  "frontend/src/components/RelatedTools.tsx": "Displays a grid of related tool cards with icons, descriptions, and action buttons. Used to cross-promote similar tools within the application.",
  "frontend/src/components/resume/ColorThemeSelector.tsx": "React component that displays a grid of color theme options with preview swatches, allowing users to select a color theme for their resume.",
  "frontend/src/components/resume/forms/AchievementsForm.tsx": "Form component for managing achievements with add/remove functionality, allowing users to input achievement titles and descriptions.",
  "frontend/src/components/resume/forms/CertificationsForm.tsx": "Form component for managing certifications, allowing users to add/remove certification entries with name, issuer, and date obtained fields.",
  "frontend/src/components/resume/forms/EducationForm.tsx": "Form component for managing education entries with fields for institution, degree, field of study, dates, and grade/CGPA.",
  "frontend/src/components/resume/forms/ExperienceForm.tsx": "Form component for managing work experience entries with company, position, dates, and description fields, including a checkbox for current employment.",
  "frontend/src/components/resume/forms/LanguagesForm.tsx": "Form component for managing language proficiency entries with language name and proficiency level selection (Native, Fluent, Advanced, Intermediate, Basic).",
  "frontend/src/components/resume/forms/PersonalInfoForm.tsx": "Form component for collecting personal information including name, contact details, photo upload, and professional summary with AI generation capability. Handles special formatting for Indian templates and includes validation for photo uploads.",
  "frontend/src/components/resume/forms/ProjectsForm.tsx": "Form component for managing project entries with fields for title, description, technologies, and links. Supports adding and removing multiple projects dynamically.",
  "frontend/src/components/resume/forms/ReferencesForm.tsx": "Form component for managing professional references with fields for name, position, company, phone, and email. Allows adding and removing multiple reference entries.",
  "frontend/src/components/resume/forms/SkillsForm.tsx": "Form component for managing skills list with name and proficiency level fields. Supports dynamic addition and removal of skill entries.",
  "frontend/src/components/resume/ResumeEditor.tsx": "Empty file with no content.",
  "frontend/src/components/resume/ResumeFormWizard.tsx": "Multi-step wizard component for building resumes with sections for personal info, education, experience, skills, projects, certifications, languages, achievements, and references. Includes progress tracking, theme selection, and responsive mobile/desktop layouts.",
  "frontend/src/components/resume/ResumePreview.tsx": "Renders a live preview of the resume with customizable color themes, displaying personal info, education, experience, and other sections in a formatted layout. Includes a download PDF button with simulated PDF generation.",
  "frontend/src/components/resume/ResumeTemplateSelector.tsx": "Empty file with no content.",
  "frontend/src/components/SEO.tsx": "Manages SEO meta tags dynamically by updating document title, meta descriptions, Open Graph tags, Twitter Card tags, and canonical URLs. Runs as a side effect on prop changes.",
  "frontend/src/components/ToolCategories.tsx": "Displays three main tool category cards (Calculator Hub, PDF Tools, Image Tools) with counts and descriptions. Provides navigation to category hub pages.",
  "frontend/src/components/ToolsGrid.tsx": "Displays a grid of three tool categories (PDF Tools, Image Tools, Resume Builder) with icons, descriptions, and navigation handlers. Each card shows tool count and has hover effects.",
  "frontend/src/data/resumeTemplateConfigs.ts": "Configuration data for resume templates including metadata, SEO information, target audience, key features, and FAQs for Indian and International resume categories.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an ICP backend actor instance based on Internet Identity authentication state. Handles actor creation with proper identity and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, providing login/logout functionality, identity state management, and authentication status tracking with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Minimal placeholder hook file indicating that all processing happens client-side with no backend queries needed for Phase 1.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for light/dark theme colors (background, foreground, primary, secondary, borders, etc.) plus a subtle pulse animation.",
  "frontend/src/lib/colorThemes.ts": "Defines six predefined color themes (Professional Blue, Corporate Black, Creative Purple, etc.) and provides utility functions to apply themes to elements and validate contrast.",
  "frontend/src/lib/imageProcessing.ts": "Provides image manipulation utilities including loading, resizing, compressing to target file size, format conversion (JPEG/PNG/WebP), and aspect ratio calculation using HTML5 Canvas.",
  "frontend/src/lib/resumeFormatters.ts": "Contains formatting utilities for resume data: skills as bullets, date formatting (MM/YYYY), phone number formatting (Indian/international), name capitalization, and experience duration calculation.",
  "frontend/src/lib/summaryGenerator.ts": "Generates professional resume summaries by analyzing experience, skills, and achievements, calculating years of experience, and composing a summary with action verbs and key competencies.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/calculators/AgeCalculatorPage.tsx": "Page component for the Age Calculator tool with SEO metadata, breadcrumb navigation, related tools section, and detailed description about calculating age from date of birth.",
  "frontend/src/pages/calculators/BMICalculatorPage.tsx": "Page component for the BMI Calculator that displays the calculator component with header, description, and information about BMI categories and formulas.",
  "frontend/src/pages/calculators/CGPACalculatorPage.tsx": "Page component for the CGPA Calculator with meta tags, displaying the calculator and explaining how to calculate cumulative GPA across multiple semesters.",
  "frontend/src/pages/calculators/CGPAToPercentageConverterPage.tsx": "Page component for converting CGPA to percentage using CBSE or Engineering formulas, with explanatory content about conversion methods.",
  "frontend/src/pages/calculators/CompoundInterestCalculatorPage.tsx": "Page component for the Compound Interest Calculator that explains various compounding frequencies and displays the calculation formula.",
  "frontend/src/pages/calculators/DateDifferenceCalculatorPage.tsx": "Page component for calculating the difference between two dates in years, months, days, with optional weekend exclusion for business day calculations.",
  "frontend/src/pages/calculators/DiscountCalculatorPage.tsx": "Page component for the Discount Calculator that calculates discount amounts and final prices from original prices or vice versa.",
  "frontend/src/pages/calculators/DivisionCalculatorPage.tsx": "Page component for determining academic division classification (1st/2nd/3rd) based on percentage marks in the Indian education system.",
  "frontend/src/pages/calculators/EMICalculatorPage.tsx": "Page component for the EMI Calculator that computes monthly loan installments with detailed breakdown of principal, interest, and payment schedule.",
  "frontend/src/pages/calculators/GPACalculatorPage.tsx": "Page component for calculating GPA on both 4.0 and 10.0 scales with course-wise grade and credit hour input.",
  "frontend/src/pages/calculators/GradeCalculatorPage.tsx": "Page component for the Grade Calculator that converts letter grades to grade points and calculates GPA. Includes a back button, header, the GradeCalculator component, informational content about the standard grading scale (A+=10, A=9, etc.), and an advertisement placeholder.",
  "frontend/src/pages/calculators/GSTCalculatorPage.tsx": "Page component for the GST Calculator that adds or removes GST from amounts using standard or custom tax rates.",
  "frontend/src/pages/calculators/LoanCalculatorPage.tsx": "Page component for the Loan Calculator that determines loan tenure and total interest from monthly payment amounts. Includes navigation, the LoanCalculator component, explanatory content about calculating repayment duration, and validates that monthly payments cover interest.",
  "frontend/src/pages/calculators/MarksPercentageCalculatorPage.tsx": "Page component for the Marks Percentage Calculator that computes percentage from obtained and total marks. Features the MarksPercentageCalculator component, explains the percentage formula, and displays pass/fail indication based on 40% threshold.",
  "frontend/src/pages/calculators/PercentageToCGPAConverterPage.tsx": "Page component for converting percentage marks to CGPA using CBSE (÷9.5) or Engineering (÷10) formulas. Contains the PercentageToCGPAConverter component and explains reverse conversion for institutional applications.",
  "frontend/src/pages/calculators/ProfitLossCalculatorPage.tsx": "Page component for calculating profit or loss percentage from cost and selling prices. Includes the ProfitLossCalculator component, explains the profit/loss formula, and provides visual indicators for transaction outcomes.",
  "frontend/src/pages/calculators/SalaryHikeCalculatorPage.tsx": "Page component for calculating new salary after percentage hikes or determining required hike percentages. Includes the SalaryHikeCalculator component with monthly and annual increment breakdowns for salary negotiations.",
  "frontend/src/pages/calculators/SGPACalculatorPage.tsx": "Page component for calculating Semester Grade Point Average using course-wise grades and credits. Features the SGPACalculator component and explains the weighted average formula for SGPA calculation on a 0-10 scale.",
  "frontend/src/pages/calculators/SimpleInterestCalculatorPage.tsx": "Page component for calculating simple interest using principal, rate, and time with the formula SI = (P × R × T) / 100. Contains the SimpleInterestCalculator component and explains simple interest for loans and deposits.",
  "frontend/src/pages/calculators/TimeDurationCalculatorPage.tsx": "Page component for calculating time duration between start and end times, handling midnight crossover and time arithmetic. Features the TimeDurationCalculator component for tracking work hours and meeting durations.",
  "frontend/src/pages/CalculatorsPage.tsx": "Displays a hub page organizing 20+ calculators into three categories (Academic, Financial, Health/General) with cards showing calculator names and descriptions.",
  "frontend/src/pages/DisclaimerPage.tsx": "Renders a legal disclaimer page covering general information, professional advice limitations, tool accuracy, user responsibilities, external links, errors/omissions, and liability limitations.",
  "frontend/src/pages/HomePage.tsx": "Main landing page component displaying 16 PDF tools, 3 calculator categories, 5 resume templates, and an app download banner. Includes SEO metadata and structured data for search engines.",
  "frontend/src/pages/image-tools/AadhaarPhotoResizePage.tsx": "Page component for resizing photos to Aadhaar card specifications using PhotoResizeTool with presets for standard card photo (200×200, 50KB) and enrollment (480×640, 100KB) dimensions.",
  "frontend/src/pages/image-tools/BackgroundRemoverPage.tsx": "Page component for removing image backgrounds with client-side processing. Currently shows file upload interface but background removal functionality is not yet implemented.",
  "frontend/src/pages/image-tools/CustomImageResizePage.tsx": "Page component for resizing images to custom dimensions or social media presets (Instagram, Facebook, HD formats). Uses PhotoResizeTool with multiple preset options and custom sizing capability.",
  "frontend/src/pages/image-tools/DPIChangerPage.tsx": "Page component for changing image DPI/resolution for printing or digital use (100, 200, or 300 DPI). Currently shows file upload interface but DPI changing functionality is not yet implemented.",
  "frontend/src/pages/image-tools/ImageCompressorPage.tsx": "Image compression tool that allows users to upload images, adjust quality via slider (10-100%), compress them, and download the result with file size comparison.",
  "frontend/src/pages/image-tools/ImageCropperPage.tsx": "Placeholder page for image cropping functionality with file upload zone; actual cropping logic not yet implemented.",
  "frontend/src/pages/image-tools/JPGToPNGPage.tsx": "Converts JPG/JPEG images to PNG format with full quality, displays original and converted file sizes, and provides download functionality.",
  "frontend/src/pages/image-tools/PANPhotoResizePage.tsx": "Wrapper component that uses PhotoResizeTool with PAN card photo preset (200×230px, max 50KB) for Indian PAN card applications.",
  "frontend/src/pages/image-tools/PassportPhotoMakerPage.tsx": "Passport photo creation tool with presets for India, US, UK, and Schengen visa requirements, includes detailed FAQ section and SEO-optimized content.",
  "frontend/src/pages/image-tools/PNGToJPGPage.tsx": "Converts PNG images to JPG format with adjustable quality slider (50-100%), displays file size comparison, and provides download functionality.",
  "frontend/src/pages/image-tools/PoliceArmyPhotoPage.tsx": "Wrapper component for resizing photos for Police, Army, and CAPF recruitment with standard 300×400px, 100KB specifications.",
  "frontend/src/pages/image-tools/RailwayPhotoResizePage.tsx": "Wrapper component for resizing photos for Indian Railway recruitment (RRB, NTPC) with 300×400px, 100KB specifications.",
  "frontend/src/pages/image-tools/SignatureResizePage.tsx": "Wrapper component for resizing signatures with multiple presets for Aadhaar, PAN, exams, and standard signatures with varying dimensions and file size limits.",
  "frontend/src/pages/image-tools/SSCPhotoResizePage.tsx": "Wrapper component for resizing photos for SSC exams (CGL, CHSL) with 300×400px, 100KB specifications.",
  "frontend/src/pages/image-tools/VisaPhotoResizePage.tsx": "Wrapper component for resizing visa photos with country-specific presets for US, UK, Schengen, and Canada visa applications.",
  "frontend/src/pages/image-tools/WEBPConverterPage.tsx": "Placeholder page for WEBP format conversion; file upload zone present but conversion logic not yet implemented.",
  "frontend/src/pages/ImageToolsPage.tsx": "Image tools page listing 8 government document photo tools (passport, Aadhaar, PAN, etc.), 4 image processing tools (compress, crop, DPI), and 4 format conversion tools (JPG/PNG/WEBP converter, background remover).",
  "frontend/src/pages/PDFToolsPage.tsx": "PDF tools page that displays 16 PDF manipulation tools and conditionally renders the selected tool component (merge, split, compress, convert, password protect, OCR, etc.).",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Privacy policy page explaining that all file processing happens in-browser with no server uploads, detailing data collection practices, third-party services, and user rights.",
  "frontend/src/pages/resume-builder/ResumeTemplateBuilderPage.tsx": "Main resume builder page component that renders a form wizard and live preview for a specific resume template, with auto-save to localStorage, theme selection, and navigation back to the resume builder hub.",
  "frontend/src/pages/ResumeBuilderPage.tsx": "Resume builder landing page showcasing 7 Indian resume templates (fresher, government, Hindi, biodata, etc.) and 7 international templates (ATS, US, UK, Europass, etc.) with SEO and breadcrumb navigation.",
  "frontend/src/pages/TermsOfUsePage.tsx": "Terms of use page outlining service license, user responsibilities, disclaimers, limitations of liability, and governing law for Document Master Tools.",
  "frontend/src/types/resume.ts": "TypeScript type definitions for resume data structures including PersonalInfo, Education, Experience, Skills, Projects, Certifications, Languages, Achievements, References, and ColorTheme, plus 14 template type literals.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color system using OKLCH color space, extended theme tokens for UI components (sidebar, chart, card, etc.), custom animations, and typography/container-queries plugins.",
  "project_state.json": "Project metadata tracking 5 development phases (Calculator Hub, PDF Tools, Image Tools, SEO/Monetization, Resume Builder) with architectural notes emphasizing client-side processing, SEO optimization, mobile-first design, and AdSense readiness."
}