{
  "backend/main.mo": "Main Motoko actor defining Document, Resume, and ImageMetadata types with storage maps and comparison functions for each entity type.",
  "feature_evidence.json": "Feature evidence report documenting 16 image tool features with their routes, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files including routing, calculator pages, PDF tools, image tools, and SEO-optimized page wrappers.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color tokens for light/dark themes and custom design system variables.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React app component with client-side routing for 50+ pages including calculators, PDF tools, image tools, resume builder, and legal pages using state-based navigation.",
  "frontend/src/components/calculators/AgeCalculator.tsx": "Age calculator that takes a birth date and displays age in years/months/days, total time units (weeks, days, hours), and next birthday countdown.",
  "frontend/src/components/calculators/BMICalculator.tsx": "BMI calculator with weight (kg/lbs) and height (cm/feet-inches) inputs. Calculates BMI, categorizes result (underweight/normal/overweight/obese), and shows healthy weight range.",
  "frontend/src/components/calculators/CGPACalculator.tsx": "React component for calculating CGPA across multiple semesters with dynamic course management. Allows adding/removing semesters and courses, inputting grade points and credits, and computes weighted average CGPA.",
  "frontend/src/components/calculators/CGPAToPercentageConverter.tsx": "React component that converts CGPA to percentage using either CBSE formula (CGPA × 9.5) or Engineering formula (CGPA × 10). Provides radio button selection for formula choice.",
  "frontend/src/components/calculators/CompoundInterestCalculator.tsx": "React component for calculating compound interest with inputs for principal, annual rate, time period, and compounding frequency. Displays principal, interest earned, and final amount.",
  "frontend/src/components/calculators/DateDifferenceCalculator.tsx": "React component that calculates the difference between two dates in years, months, days, weeks, and total days. Includes option to exclude weekends and count only weekdays.",
  "frontend/src/components/calculators/DiscountCalculator.tsx": "React component for discount calculations with two modes: calculate final price from discount percentage, or calculate discount percentage from sale price. Displays discount amount and savings.",
  "frontend/src/components/calculators/DivisionCalculator.tsx": "React component that determines academic division (First/Second/Third/Fail) based on percentage input. Displays division with color-coded result and shows division criteria table.",
  "frontend/src/components/calculators/EMICalculator.tsx": "React component that calculates Equated Monthly Installment (EMI) for loans based on principal amount, annual interest rate, and tenure (months/years), displaying monthly EMI, total interest, and total amount with a visual breakdown.",
  "frontend/src/components/calculators/GPACalculator.tsx": "React component for calculating GPA on either 4.0 or 10.0 scale by allowing users to add multiple courses with grades and credits, computing weighted average GPA and total credits.",
  "frontend/src/components/calculators/GradeCalculator.tsx": "React component for calculating GPA using letter grades (A+ to F) with a predefined 10-point scale, allowing users to add multiple courses with letter grades and credits to compute weighted GPA.",
  "frontend/src/components/calculators/GSTCalculator.tsx": "React component that calculates GST (Goods and Services Tax) by either adding GST to a base amount or removing GST from a total amount, supporting preset rates (5%, 12%, 18%, 28%) or custom rates.",
  "frontend/src/components/calculators/LoanCalculator.tsx": "React component that calculates loan repayment tenure in months/years based on loan amount, annual interest rate, and monthly payment amount, displaying total interest and repayment with error handling for insufficient payments.",
  "frontend/src/components/calculators/MarksPercentageCalculator.tsx": "React component that calculates percentage from obtained and total marks, displays pass/fail status (40% threshold), and validates that obtained marks don't exceed total marks.",
  "frontend/src/components/calculators/PercentageToCGPAConverter.tsx": "React component that converts percentage to CGPA using either CBSE (÷9.5) or Engineering (÷10) formula with radio button selection and displays the result on a 10.0 scale.",
  "frontend/src/components/calculators/ProfitLossCalculator.tsx": "React component that calculates profit or loss amount and percentage from cost price and selling price inputs, displaying results with color-coded cards and trending icons.",
  "frontend/src/components/calculators/SalaryHikeCalculator.tsx": "React component that calculates salary hike in two modes: from hike percentage to new salary, or from desired salary to required hike percentage, showing monthly and annual increments.",
  "frontend/src/components/calculators/SGPACalculator.tsx": "React component for calculating SGPA by allowing users to add multiple courses with grade points and credits, computing weighted average and displaying result on 10.0 scale.",
  "frontend/src/components/calculators/SimpleInterestCalculator.tsx": "React component that calculates simple interest using the formula SI = (P × R × T) / 100 from principal, rate, and time inputs, displaying both interest and total amount.",
  "frontend/src/components/calculators/TimeDurationCalculator.tsx": "React component with three modes: calculate duration between two times, add time to a base time, or subtract time from a base time, handling time arithmetic and display.",
  "frontend/src/components/DownloadSection.tsx": "Reusable download component supporting both single file and multiple file downloads with individual download buttons for each file.",
  "frontend/src/components/FileUploadZone.tsx": "A reusable file upload component with drag-and-drop, click-to-upload, and touch support. Validates file size and displays upload instructions with an icon.",
  "frontend/src/components/Footer.tsx": "Site footer with three columns: company info, quick navigation links to tools, and legal links. Includes copyright and attribution to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Sticky header with logo/home button and optional navigation to calculators. Uses responsive sizing for the logo image.",
  "frontend/src/components/Hero.tsx": "Landing page hero section with headline, description, CTA buttons, and statistics (100% Private, 20+ Tools, Free). Includes a hero banner image.",
  "frontend/src/components/image-tools/BackgroundChangerTool.tsx": "React component for changing image backgrounds with color selection (preset or custom colors). Includes file upload, color picker UI, mock processing, and download functionality.",
  "frontend/src/components/image-tools/BackgroundRemoverTool.tsx": "React component for removing backgrounds from images using AI-powered detection. Provides file upload, mock background removal processing, and download capabilities.",
  "frontend/src/components/image-tools/ImageCompressorTool.tsx": "React component for compressing images with adjustable quality slider (10-100%). Includes file upload, quality control, mock compression, and download with size comparison.",
  "frontend/src/components/image-tools/PhotoKBResizerTool.tsx": "React component for resizing images to specific file sizes (20KB-200KB or custom). Features preset size selection, file upload, mock resizing, and download functionality.",
  "frontend/src/components/image-tools/PhotoResizeTool.tsx": "Reusable React component for resizing photos with configurable presets, custom dimensions, aspect ratio locking, quality control, and target file size compression. Uses actual image processing utilities.",
  "frontend/src/components/pdf-tools/BasePDFTool.tsx": "Generic reusable React component for PDF tools with configurable title, description, file types, and processing behavior. Provides standard file upload, mock processing, and download workflow.",
  "frontend/src/components/pdf-tools/ImageToPDFTool.tsx": "React component for converting one or more image files into a single PDF document with file upload, processing state, and download functionality.",
  "frontend/src/components/pdf-tools/PDFAddPageNumbersTool.tsx": "Wrapper component using BasePDFTool to add customizable page numbers to PDF documents.",
  "frontend/src/components/pdf-tools/PDFAddWatermarkTool.tsx": "Wrapper component using BasePDFTool to apply text or image watermarks to PDF pages.",
  "frontend/src/components/pdf-tools/PDFCompressTool.tsx": "React component for compressing PDF files with automatic or manual quality adjustment modes, showing compression ratio and file size reduction.",
  "frontend/src/components/pdf-tools/PDFMergeTool.tsx": "React component for combining multiple PDF files into a single document with file list management and drag-and-drop upload.",
  "frontend/src/components/pdf-tools/PDFOCRTool.tsx": "Wrapper component using BasePDFTool to convert scanned PDFs into searchable text documents using OCR.",
  "frontend/src/components/pdf-tools/PDFPageCounterTool.tsx": "Wrapper component using BasePDFTool to count the total number of pages in a PDF document.",
  "frontend/src/components/pdf-tools/PDFPasswordProtectTool.tsx": "Wrapper component using BasePDFTool to add password security to PDF documents.",
  "frontend/src/components/pdf-tools/PDFPasswordUnlockTool.tsx": "Wrapper component using BasePDFTool to remove password protection from PDF documents.",
  "frontend/src/components/pdf-tools/PDFRemoveBlankPagesTool.tsx": "Wrapper component using BasePDFTool to automatically detect and remove empty pages from PDFs.",
  "frontend/src/components/pdf-tools/PDFReorderTool.tsx": "Wrapper component using BasePDFTool to rearrange pages in a PDF document via drag-and-drop.",
  "frontend/src/components/pdf-tools/PDFSignTool.tsx": "Wrapper component using BasePDFTool to add digital signatures to PDF documents by drawing or uploading images.",
  "frontend/src/components/pdf-tools/PDFSplitTool.tsx": "React component for extracting specific pages from a PDF or splitting all pages into individual files with optional page range input.",
  "frontend/src/components/pdf-tools/PDFToImageTool.tsx": "React component for converting PDF pages to high-quality images (PNG/JPG) delivered as a ZIP file.",
  "frontend/src/components/pdf-tools/PDFToWordTool.tsx": "React component that renders a PDF to Word converter using BasePDFTool with specific configuration for accepting PDF files and outputting DOCX format.",
  "frontend/src/components/pdf-tools/WordToPDFTool.tsx": "React component that renders a Word to PDF converter using BasePDFTool with specific configuration for accepting DOC/DOCX files and outputting PDF format.",
  "frontend/src/components/ProcessingState.tsx": "Loading state component displaying a spinner, processing message, and optional progress bar with percentage.",
  "frontend/src/components/resume/ResumeEditor.tsx": "React component providing a tabbed form interface for editing resume data including personal info, education, experience, skills, and projects with download functionality.",
  "frontend/src/components/resume/ResumeTemplateSelector.tsx": "React component displaying a grid of five resume template cards (fresher, experienced, professional, simple, creative) that users can select from.",
  "frontend/src/components/ToolsGrid.tsx": "Grid of three tool category cards (PDF Tools, Image Tools, Resume Builder) with icons, descriptions, and tool counts. Each card navigates to its category page.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages ICP actor creation with Internet Identity authentication, automatically invalidating and refetching queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity storage, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Minimal placeholder hook that returns an empty object, indicating no backend queries are needed for Phase 1 client-side processing.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors, sidebar styling, and a subtle pulse animation keyframe.",
  "frontend/src/lib/imageProcessing.ts": "Utility library providing functions for client-side image manipulation including loading, resizing, compression to target size, format conversion, and aspect ratio calculation.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/calculators/AgeCalculatorPage.tsx": "Page wrapper for the Age Calculator component that calculates exact age in years, months, days from date of birth with birthday countdown functionality.",
  "frontend/src/pages/calculators/BMICalculatorPage.tsx": "Page wrapper for the BMI Calculator component that calculates Body Mass Index using weight and height in both metric and imperial units.",
  "frontend/src/pages/calculators/CGPACalculatorPage.tsx": "Page wrapper for the CGPA Calculator component that calculates Cumulative Grade Point Average across multiple semesters with semester-wise grade input and credit hours.",
  "frontend/src/pages/calculators/CGPAToPercentageConverterPage.tsx": "Page wrapper for the CGPA to Percentage Converter component that converts CGPA to percentage using CBSE (×9.5) or Engineering (×10) formulas.",
  "frontend/src/pages/calculators/CompoundInterestCalculatorPage.tsx": "Page wrapper for the Compound Interest Calculator component that calculates compound interest with multiple compounding frequencies (yearly, half-yearly, quarterly, monthly, daily).",
  "frontend/src/pages/calculators/DateDifferenceCalculatorPage.tsx": "Page wrapper for the Date Difference Calculator component that calculates the difference between two dates in years, months, days with optional weekend exclusion.",
  "frontend/src/pages/calculators/DiscountCalculatorPage.tsx": "Page wrapper for the Discount Calculator component that calculates discount amount and final price from original price, or finds discount percentage from sale price.",
  "frontend/src/pages/calculators/DivisionCalculatorPage.tsx": "Page wrapper for the Division Calculator component that determines academic division classification (1st/2nd/3rd/Fail) based on percentage marks using Indian educational standards.",
  "frontend/src/pages/calculators/EMICalculatorPage.tsx": "Page wrapper for the EMI Calculator component that calculates Equated Monthly Installment for loans using principal amount, interest rate, and tenure.",
  "frontend/src/pages/calculators/GPACalculatorPage.tsx": "Page component for GPA Calculator that supports both 4.0 and 10.0 scales with course-wise grade input. Sets document title, renders GPACalculator component, and includes back navigation and informational content.",
  "frontend/src/pages/calculators/GradeCalculatorPage.tsx": "Page component for Grade Calculator that converts letter grades (A+, A, B, etc.) to grade points and calculates GPA. Includes GradeCalculator component with standard grading scale information.",
  "frontend/src/pages/calculators/GSTCalculatorPage.tsx": "Page component for GST Calculator that allows adding or removing GST from amounts with multiple tax rates. Renders GSTCalculator component with navigation and descriptive content about GST calculation modes.",
  "frontend/src/pages/calculators/LoanCalculatorPage.tsx": "Page component for Loan Calculator that determines loan tenure and total interest from monthly payment amount. Renders LoanCalculator component with validation for realistic repayment scenarios.",
  "frontend/src/pages/calculators/MarksPercentageCalculatorPage.tsx": "Page component for Marks Percentage Calculator that computes percentage from obtained and total marks. Includes pass/fail indication based on 40% threshold and displays results with two decimal places.",
  "frontend/src/pages/calculators/PercentageToCGPAConverterPage.tsx": "Page component for converting percentage to CGPA using CBSE (÷9.5) or Engineering (÷10) formulas. Renders PercentageToCGPAConverter component with reverse conversion explanations.",
  "frontend/src/pages/calculators/ProfitLossCalculatorPage.tsx": "Page component for Profit/Loss Calculator that determines profit or loss percentage from cost and selling prices. Includes visual indicators and formula explanation for transaction analysis.",
  "frontend/src/pages/calculators/SalaryHikeCalculatorPage.tsx": "Page component for Salary Hike Calculator that computes new salary after percentage hike or required hike for target salary. Shows monthly and annual increment breakdowns for salary negotiations.",
  "frontend/src/pages/calculators/SGPACalculatorPage.tsx": "Page component for SGPA Calculator that computes Semester Grade Point Average using course-wise grade points (0-10 scale) and credits. Explains weighted average formula for semester performance.",
  "frontend/src/pages/calculators/SimpleInterestCalculatorPage.tsx": "Page component for Simple Interest Calculator using formula SI = (P × R × T) / 100. Renders SimpleInterestCalculator component for calculating interest on loans or investments.",
  "frontend/src/pages/calculators/TimeDurationCalculatorPage.tsx": "Page component for Time Duration Calculator that computes duration between start and end times, handling midnight crossover. Supports adding/subtracting time periods for work hours and scheduling.",
  "frontend/src/pages/CalculatorsPage.tsx": "Displays a hub page with three categories of calculators (academic, financial, health/general) organized in card grids. Provides navigation back to home and to individual calculator tools.",
  "frontend/src/pages/DisclaimerPage.tsx": "Renders a legal disclaimer page with sections on general information, tool accuracy, user responsibility, and liability limitations. Includes back navigation button.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying hero section, PDF tools grid (16 tools), calculator categories (3 categories), and resume templates (5 templates). Includes app download banner that appears after 7 seconds.",
  "frontend/src/pages/image-tools/AadhaarPhotoResizePage.tsx": "Page component for Aadhaar photo resizing with presets for card photo (200×200, 50KB) and enrollment (480×640, 100KB). Uses PhotoResizeTool component with government-specified dimensions.",
  "frontend/src/pages/image-tools/BackgroundRemoverPage.tsx": "Page component for background removal tool with client-side processing. Includes file upload zone with image validation and emphasizes privacy with local browser processing.",
  "frontend/src/pages/image-tools/CustomImageResizePage.tsx": "Page component for custom image resizing with presets for HD, Full HD, social media formats (Instagram, Facebook), and square dimensions. Uses PhotoResizeTool component with predefined dimension presets.",
  "frontend/src/pages/image-tools/DPIChangerPage.tsx": "Page component for changing image DPI/resolution with file upload functionality. Currently implements basic file selection but DPI changing logic is not yet implemented.",
  "frontend/src/pages/image-tools/ImageCompressorPage.tsx": "Page component for compressing images with adjustable quality slider (10-100%). Displays original and compressed file sizes, provides preview, and allows download of compressed result.",
  "frontend/src/pages/image-tools/ImageCropperPage.tsx": "Page component for image cropping with custom aspect ratios. Currently implements basic file upload but cropping functionality is not yet implemented.",
  "frontend/src/pages/image-tools/JPGToPNGPage.tsx": "Page component for converting JPG/JPEG images to PNG format. Handles file validation, conversion processing, and displays before/after file sizes with download functionality.",
  "frontend/src/pages/image-tools/PANPhotoResizePage.tsx": "Page component for resizing photos to PAN card specifications (200×230px, max 50KB). Uses PhotoResizeTool with PAN-specific preset dimensions.",
  "frontend/src/pages/image-tools/PassportPhotoMakerPage.tsx": "Page component for creating passport photos with country-specific presets (India, US, UK, Schengen). Includes detailed FAQ section about passport photo requirements and dimensions.",
  "frontend/src/pages/image-tools/PNGToJPGPage.tsx": "Page component for converting PNG images to JPG format with adjustable quality slider (50-100%). Shows file size comparison and provides download functionality.",
  "frontend/src/pages/image-tools/PoliceArmyPhotoPage.tsx": "Page component for resizing photos for Police, Army, and CAPF recruitment applications (300×400px, max 100KB). Uses PhotoResizeTool with recruitment-specific presets.",
  "frontend/src/pages/image-tools/RailwayPhotoResizePage.tsx": "Page component for resizing photos for Indian Railway recruitment exams (RRB, NTPC) with 300×400px dimensions and 100KB max size. Uses PhotoResizeTool component.",
  "frontend/src/pages/image-tools/SignatureResizePage.tsx": "Page component for resizing signature images for government applications with presets for standard, Aadhaar, PAN, and exam signatures. Dimensions range from 200-300px width and 80-100px height.",
  "frontend/src/pages/image-tools/SSCPhotoResizePage.tsx": "Page component for resizing photos for SSC government exams (CGL, CHSL) with 300×400px dimensions and 100KB max size. Uses PhotoResizeTool with SSC-specific presets.",
  "frontend/src/pages/image-tools/VisaPhotoResizePage.tsx": "Renders a visa photo resize tool with presets for US, UK, Schengen, and Canada visa photo requirements (dimensions and file size limits).",
  "frontend/src/pages/image-tools/WEBPConverterPage.tsx": "Provides a page for converting images to/from WEBP format with file upload zone; currently only handles file selection with basic validation.",
  "frontend/src/pages/ImageToolsPage.tsx": "Displays image processing tools organized into three sections: government document photos (8 tools), image processing (4 tools), and format conversion (4 tools). Provides navigation to individual image tools.",
  "frontend/src/pages/PDFToolsPage.tsx": "PDF tools hub page that displays a grid of 16 PDF tools and conditionally renders the selected tool component. Manages tool selection state and provides back navigation.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders privacy policy content explaining browser-based processing, data collection practices, user rights, and third-party services. Includes back navigation button.",
  "frontend/src/pages/ResumeBuilderPage.tsx": "Main page component for the resume builder that allows users to select from five template types (fresher, experienced, professional, simple, creative) and navigate to the editor or back to home.",
  "frontend/src/pages/TermsOfUsePage.tsx": "Static page displaying terms of use content including acceptance of terms, use license, service description, user responsibilities, disclaimers, and legal limitations for Document Master Tools.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended animations, container queries, typography plugin, and dark mode support.",
  "project_state.json": "Project state document tracking a multi-phase utility platform with calculator hub (Phase 1), PDF tools (Phase 2), and image tools (Phase 3) including passport photo makers, compression, and format conversion—all client-side processing without server storage."
}