{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Implement Global Multi-Language System with 9 Languages",
  "requirements": [
    {
      "id": "REQ-87",
      "summary": "Create LanguageSelector component with dropdown for 9 supported languages",
      "acceptanceCriteria": [
        "LanguageSelector component renders in Header component",
        "Dropdown displays all 9 languages with proper labels",
        "Current language is highlighted",
        "Mobile responsive with touch-friendly tap targets",
        "Smooth open/close animations"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LanguageSelector.tsx",
          "operation": "create",
          "description": "Create LanguageSelector component that renders a dropdown button displaying current language with flag icon or language code (e.g., 'EN', 'हिं', 'বাং'). On click, show dropdown menu with all 9 languages: English (en), Hindi (hi), Bengali (bn), Tamil (ta), Telugu (te), Marathi (mr), Gujarati (gu), Kannada (kn), Malayalam (ml), Urdu (ur). Highlight currently selected language. Use shadcn/ui DropdownMenu component for accessibility. Include smooth animations for dropdown open/close. Ensure touch-friendly tap targets (min 44px) for mobile. Call setLanguage from useLanguage hook when user selects a language."
        }
      ]
    },
    {
      "id": "REQ-88",
      "summary": "Create i18n infrastructure with LanguageContext provider",
      "acceptanceCriteria": [
        "LanguageContext provides currentLanguage state",
        "setLanguage function updates language without page reload",
        "Language preference persists in localStorage",
        "useLanguage hook accessible in all components",
        "Context wrapped around App in main.tsx"
      ],
      "file_operations": [
        {
          "path": "frontend/src/contexts/LanguageContext.tsx",
          "operation": "create",
          "description": "Create LanguageContext and LanguageProvider that manages currentLanguage state (default 'en'), translations object, and loading state. Provide setLanguage function that updates state, persists to localStorage key 'documentmaster_language', and dynamically imports the new language JSON file. Provide translate function (t) that accepts a translation key string and returns the translated value from the loaded translations object. Export useLanguage hook that returns { currentLanguage, setLanguage, t, isLoading }. Initialize language from localStorage or default to 'en'. Handle missing translation keys by returning the key itself as fallback."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the entire Router component with LanguageProvider from frontend/src/contexts/LanguageContext.tsx. Place LanguageProvider inside QueryClientProvider and ThemeProvider but outside BrowserRouter. This ensures language context is available to all routed components."
        }
      ]
    },
    {
      "id": "REQ-89",
      "summary": "Create translation JSON files for all 10 languages with complete UI text translations",
      "acceptanceCriteria": [
        "10 JSON files created in frontend/src/locales/",
        "Each file contains complete translations for all UI strings",
        "Translation keys are consistent across all language files",
        "Calculator formulas and logic remain in English",
        "Footer copyright text remains unchanged",
        "File structure supports nested keys for organization"
      ],
      "file_operations": [
        {
          "path": "frontend/src/locales/en.json",
          "operation": "create",
          "description": "Create English translation file with nested JSON structure containing all UI text. Include keys for: navigation (header links, footer links), page titles and headings for all calculators/PDF tools/image tools/resume builder pages, button labels (Calculate, Download, Upload, Clear, etc.), form labels and placeholders, error messages, success messages, SEO meta titles and descriptions for each page, tool descriptions, FAQ questions and answers, breadcrumb labels, and all static UI text. Use nested structure like { \"nav\": { \"home\": \"Home\", \"calculators\": \"Calculators\" }, \"calculator\": { \"age\": { \"title\": \"Age Calculator\", \"description\": \"...\" } } }. Do NOT include calculation formulas, numerical operations, or the footer copyright text."
        },
        {
          "path": "frontend/src/locales/hi.json",
          "operation": "create",
          "description": "Create Hindi translation file with identical key structure to en.json but with Hindi translations for all UI text, headings, descriptions, labels, and messages. Maintain same nested JSON structure. Do NOT translate calculation logic or formulas."
        },
        {
          "path": "frontend/src/locales/bn.json",
          "operation": "create",
          "description": "Create Bengali translation file with identical key structure to en.json but with Bengali translations for all UI text, headings, descriptions, labels, and messages. Maintain same nested JSON structure. Do NOT translate calculation logic or formulas."
        },
        {
          "path": "frontend/src/locales/ta.json",
          "operation": "create",
          "description": "Create Tamil translation file with identical key structure to en.json but with Tamil translations for all UI text, headings, descriptions, labels, and messages. Maintain same nested JSON structure. Do NOT translate calculation logic or formulas."
        },
        {
          "path": "frontend/src/locales/te.json",
          "operation": "create",
          "description": "Create Telugu translation file with identical key structure to en.json but with Telugu translations for all UI text, headings, descriptions, labels, and messages. Maintain same nested JSON structure. Do NOT translate calculation logic or formulas."
        },
        {
          "path": "frontend/src/locales/mr.json",
          "operation": "create",
          "description": "Create Marathi translation file with identical key structure to en.json but with Marathi translations for all UI text, headings, descriptions, labels, and messages. Maintain same nested JSON structure. Do NOT translate calculation logic or formulas."
        },
        {
          "path": "frontend/src/locales/gu.json",
          "operation": "create",
          "description": "Create Gujarati translation file with identical key structure to en.json but with Gujarati translations for all UI text, headings, descriptions, labels, and messages. Maintain same nested JSON structure. Do NOT translate calculation logic or formulas."
        },
        {
          "path": "frontend/src/locales/kn.json",
          "operation": "create",
          "description": "Create Kannada translation file with identical key structure to en.json but with Kannada translations for all UI text, headings, descriptions, labels, and messages. Maintain same nested JSON structure. Do NOT translate calculation logic or formulas."
        },
        {
          "path": "frontend/src/locales/ml.json",
          "operation": "create",
          "description": "Create Malayalam translation file with identical key structure to en.json but with Malayalam translations for all UI text, headings, descriptions, labels, and messages. Maintain same nested JSON structure. Do NOT translate calculation logic or formulas."
        },
        {
          "path": "frontend/src/locales/ur.json",
          "operation": "create",
          "description": "Create Urdu translation file with identical key structure to en.json but with Urdu translations for all UI text, headings, descriptions, labels, and messages. Maintain same nested JSON structure. Do NOT translate calculation logic or formulas."
        }
      ]
    },
    {
      "id": "REQ-90",
      "summary": "Update App.tsx routing to support language-prefixed URLs",
      "acceptanceCriteria": [
        "Routes support optional /:lang prefix",
        "Language code in URL sets active language automatically",
        "Default routes without prefix use English",
        "Navigation preserves current language in URLs",
        "All existing routes work with language prefixes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update React Router routes to support optional /:lang parameter. For each existing route, add a duplicate route with /:lang prefix (e.g., both '/calculators' and '/:lang/calculators'). Create a wrapper component or useEffect in App.tsx that reads the :lang param from useParams(), validates it against supported languages (en|hi|bn|ta|te|mr|gu|kn|ml|ur), and calls setLanguage from useLanguage hook to update active language. If :lang param is invalid or missing, default to 'en'. Ensure all existing routes continue to work without language prefix."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Update navigation links in Header component to include current language prefix in URLs. Use currentLanguage from useLanguage hook. Update Link components to prepend `/${currentLanguage}` to existing paths (e.g., `/${currentLanguage}/calculators`). For default English, use paths without prefix (e.g., '/calculators'). Ensure logo link also preserves current language."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Update footer navigation links to include current language prefix in URLs. Use currentLanguage from useLanguage hook. Update Link components for quick links (calculators, PDF tools, image tools, resume builder) and legal links (privacy, terms, disclaimer) to prepend `/${currentLanguage}` to paths when language is not 'en'. Preserve footer copyright text unchanged."
        }
      ]
    },
    {
      "id": "REQ-91",
      "summary": "Update SEO component to render hreflang link tags for all languages",
      "acceptanceCriteria": [
        "hreflang tags generated for all 9 languages on every page",
        "x-default hreflang points to English version",
        "Canonical tag reflects current language URL",
        "Alternate language URLs properly constructed",
        "Tags render in document <head>"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SEO.tsx",
          "operation": "modify",
          "description": "Modify SEO component to accept currentLanguage and currentPath props. Generate hreflang link tags for all 9 supported languages (en, hi, bn, ta, te, mr, gu, kn, ml, ur) pointing to language-specific URL variants constructed from currentPath. Add x-default hreflang pointing to English URL (no language prefix). Update canonical link tag to reflect current language URL. Use Helmet or document.head to inject hreflang tags into <head>. Construct language URLs following pattern: base URL + '/' + lang code + currentPath (e.g., 'https://docmastertools.com/hi/calculators/age-calculator')."
        }
      ]
    },
    {
      "id": "REQ-92",
      "summary": "Update all page components to use translation keys instead of hardcoded strings",
      "acceptanceCriteria": [
        "All page titles use translation keys",
        "All UI headings and descriptions translated",
        "Button labels and form fields use translations",
        "Calculator formulas remain untranslated",
        "Numerical outputs and operations unchanged",
        "Changes applied to 50+ page components"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Replace all hardcoded English strings with translation keys using t() function from useLanguage hook. Update hero heading, description, CTA button labels, feature statistics labels, section headings ('Calculator Tools', 'PDF Tools', etc.), and any other UI text. Do NOT translate numerical values or calculation logic. Preserve existing component structure and logic."
        },
        {
          "path": "frontend/src/pages/CalculatorsPage.tsx",
          "operation": "modify",
          "description": "Replace all hardcoded strings with translation keys using t() from useLanguage. Update page title, category headings ('Academic Calculators', 'Financial Calculators', 'Health & General Calculators'), calculator names, and descriptions. Preserve existing layout and navigation structure."
        },
        {
          "path": "frontend/src/pages/calculators/AgeCalculatorPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys using t() from useLanguage. Update page title, description, informational text, and any button labels. Do NOT translate calculation logic in the AgeCalculator component itself."
        },
        {
          "path": "frontend/src/pages/calculators/BMICalculatorPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, description, BMI category labels, and informational text. Preserve BMI calculation formulas and numerical thresholds unchanged."
        },
        {
          "path": "frontend/src/pages/calculators/CGPACalculatorPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, description, form labels ('Semester', 'Course', 'Grade Points', 'Credits'), and informational text. Do NOT translate CGPA calculation formula."
        },
        {
          "path": "frontend/src/pages/calculators/CGPAToPercentageConverterPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, description, formula option labels ('CBSE Formula', 'Engineering Formula'), and informational text. Preserve conversion formulas (×9.5, ×10) as-is."
        },
        {
          "path": "frontend/src/pages/calculators/CompoundInterestCalculatorPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, description, form labels, compounding frequency options, and informational text. Do NOT translate the compound interest formula."
        },
        {
          "path": "frontend/src/pages/calculators/DateDifferenceCalculatorPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, description, form labels ('Start Date', 'End Date'), and result labels. Preserve date calculation logic unchanged."
        },
        {
          "path": "frontend/src/pages/calculators/DiscountCalculatorPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, description, form labels, and calculation mode labels. Preserve discount calculation formulas unchanged."
        },
        {
          "path": "frontend/src/pages/calculators/DivisionCalculatorPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, description, division labels ('First Division', 'Second Division', 'Third Division'), and informational text. Preserve division threshold percentages unchanged."
        },
        {
          "path": "frontend/src/pages/calculators/EMICalculatorPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, description, form labels ('Principal Amount', 'Interest Rate', 'Tenure'), and result labels ('Monthly EMI', 'Total Interest'). Preserve EMI calculation formula unchanged."
        },
        {
          "path": "frontend/src/pages/calculators/GPACalculatorPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, description, form labels, scale selector labels ('4.0 Scale', '10.0 Scale'), and informational text. Preserve GPA calculation logic unchanged."
        },
        {
          "path": "frontend/src/pages/calculators/GradeCalculatorPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, description, form labels, grade labels (A+, A, B+, etc.), and informational text. Preserve grade point mappings unchanged."
        },
        {
          "path": "frontend/src/pages/calculators/GSTCalculatorPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, description, form labels, GST rate options, mode labels ('Add GST', 'Remove GST'), and informational text. Preserve GST calculation formulas unchanged."
        },
        {
          "path": "frontend/src/pages/calculators/LoanCalculatorPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, description, form labels, result labels, and informational text. Preserve loan calculation formulas unchanged."
        },
        {
          "path": "frontend/src/pages/calculators/MarksPercentageCalculatorPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, description, form labels ('Obtained Marks', 'Total Marks'), result labels, and informational text. Preserve percentage calculation formula unchanged."
        },
        {
          "path": "frontend/src/pages/calculators/PercentageToCGPAConverterPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, description, formula option labels, and informational text. Preserve conversion formulas (÷9.5, ÷10) unchanged."
        },
        {
          "path": "frontend/src/pages/calculators/ProfitLossCalculatorPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, description, form labels ('Cost Price', 'Selling Price'), result labels ('Profit', 'Loss'), and informational text. Preserve profit/loss calculation formulas unchanged."
        },
        {
          "path": "frontend/src/pages/calculators/SalaryHikeCalculatorPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, description, form labels, calculation mode labels, and result labels. Preserve salary hike calculation formulas unchanged."
        },
        {
          "path": "frontend/src/pages/calculators/SGPACalculatorPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, description, form labels, and informational text. Preserve SGPA calculation formula unchanged."
        },
        {
          "path": "frontend/src/pages/calculators/SimpleInterestCalculatorPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, description, form labels, result labels, and informational text. Preserve simple interest formula SI = (P × R × T) / 100 unchanged."
        },
        {
          "path": "frontend/src/pages/calculators/TimeDurationCalculatorPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, description, form labels, mode selector labels, and informational text. Preserve time calculation logic unchanged."
        },
        {
          "path": "frontend/src/pages/PDFToolsPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, tool names, tool descriptions, and navigation labels. Preserve existing tool selection and rendering logic."
        },
        {
          "path": "frontend/src/pages/ImageToolsPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, category headings, tool names, tool descriptions, and navigation labels. Preserve existing layout structure."
        },
        {
          "path": "frontend/src/pages/ResumeBuilderPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, category headings ('Indian Resume Templates', 'International Resume Templates'), template names, template descriptions, and CTA button labels. Preserve existing template grid layout."
        },
        {
          "path": "frontend/src/pages/PrivacyPolicyPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, section headings, policy text, and informational content. Preserve legal meaning and accuracy in translations."
        },
        {
          "path": "frontend/src/pages/TermsOfUsePage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, section headings, terms text, and legal disclaimers. Preserve legal meaning and accuracy in translations."
        },
        {
          "path": "frontend/src/pages/DisclaimerPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded strings with translation keys. Update page title, section headings, disclaimer text, and informational content. Preserve legal meaning and accuracy in translations."
        },
        {
          "path": "frontend/src/components/calculators/AgeCalculator.tsx",
          "operation": "modify",
          "description": "Replace hardcoded UI strings with translation keys from useLanguage. Update form labels ('Date of Birth', 'Calculate Age'), result labels ('Years', 'Months', 'Days', 'Total Months', 'Total Weeks'), and button labels. Do NOT translate the age calculation logic, date arithmetic, or numerical operations."
        },
        {
          "path": "frontend/src/components/calculators/BMICalculator.tsx",
          "operation": "modify",
          "description": "Replace hardcoded UI strings with translation keys. Update unit selector labels ('Metric', 'Imperial'), form labels ('Weight', 'Height'), result labels ('BMI', 'Category'), and category names ('Underweight', 'Normal', 'Overweight', 'Obese'). Do NOT translate BMI calculation formula or numerical thresholds."
        },
        {
          "path": "frontend/src/components/calculators/CGPACalculator.tsx",
          "operation": "modify",
          "description": "Replace hardcoded UI strings with translation keys. Update form labels, button labels ('Add Semester', 'Add Course', 'Remove', 'Calculate CGPA'), and result label. Do NOT translate CGPA calculation logic."
        },
        {
          "path": "frontend/src/components/calculators/CGPAToPercentageConverter.tsx",
          "operation": "modify",
          "description": "Replace hardcoded UI strings with translation keys. Update form labels, formula selector labels, button labels, and result labels. Do NOT translate conversion formulas."
        },
        {
          "path": "frontend/src/components/calculators/CompoundInterestCalculator.tsx",
          "operation": "modify",
          "description": "Replace hardcoded UI strings with translation keys. Update form labels, frequency options ('Yearly', 'Half-Yearly', 'Quarterly', 'Monthly', 'Daily'), button labels, and result labels. Do NOT translate compound interest formula."
        },
        {
          "path": "frontend/src/components/calculators/DateDifferenceCalculator.tsx",
          "operation": "modify",
          "description": "Replace hardcoded UI strings with translation keys. Update form labels, checkbox label ('Exclude weekends'), button labels, and result labels. Do NOT translate date calculation logic."
        },
        {
          "path": "frontend/src/components/calculators/DiscountCalculator.tsx",
          "operation": "modify",
          "description": "Replace hardcoded UI strings with translation keys. Update mode selector labels, form labels, button labels, and result labels. Do NOT translate discount calculation formulas."
        },
        {
          "path": "frontend/src/components/calculators/DivisionCalculator.tsx",
          "operation": "modify",
          "description": "Replace hardcoded UI strings with translation keys. Update form labels, button labels, division labels, and result display text. Do NOT translate percentage thresholds."
        },
        {
          "path": "frontend/src/components/calculators/EMICalculator.tsx",
          "operation": "modify",
          "description": "Replace hardcoded UI strings with translation keys. Update form labels, tenure unit selector labels ('Months', 'Years'), button labels, and result labels. Do NOT translate EMI formula."
        },
        {
          "path": "frontend/src/components/calculators/GPACalculator.tsx",
          "operation": "modify",
          "description": "Replace hardcoded UI strings with translation keys. Update scale selector labels, form labels, button labels ('Add Course', 'Remove', 'Calculate GPA'), and result labels. Do NOT translate GPA calculation logic."
        },
        {
          "path": "frontend/src/components/calculators/GradeCalculator.tsx",
          "operation": "modify",
          "description": "Replace hardcoded UI strings with translation keys. Update form labels, button labels, grade options, and result labels. Do NOT translate grade point values."
        },
        {
          "path": "frontend/src/components/calculators/GSTCalculator.tsx",
          "operation": "modify",
          "description": "Replace hardcoded UI strings with translation keys. Update mode selector labels ('Add GST', 'Remove GST'), form labels, rate options, button labels, and result labels. Do NOT translate GST calculation formulas."
        },
        {
          "path": "frontend/src/components/calculators/LoanCalculator.tsx",
          "operation": "modify",
          "description": "Replace hardcoded UI strings with translation keys. Update form labels, button labels, and result labels. Do NOT translate loan calculation formula."
        },
        {
          "path": "frontend/src/components/calculators/MarksPercentageCalculator.tsx",
          "operation": "modify",
          "description": "Replace hardcoded UI strings with translation keys. Update form labels, button labels, result labels, and pass/fail status labels. Do NOT translate percentage calculation formula."
        },
        {
          "path": "frontend/src/components/calculators/PercentageToCGPAConverter.tsx",
          "operation": "modify",
          "description": "Replace hardcoded UI strings with translation keys. Update form labels, formula selector labels, button labels, and result labels. Do NOT translate conversion formulas."
        },
        {
          "path": "frontend/src/components/calculators/ProfitLossCalculator.tsx",
          "operation": "modify",
          "description": "Replace hardcoded UI strings with translation keys. Update form labels, button labels, result labels ('Profit', 'Loss'), and status indicators. Do NOT translate profit/loss calculation formulas."
        },
        {
          "path": "frontend/src/components/calculators/SalaryHikeCalculator.tsx",
          "operation": "modify",
          "description": "Replace hardcoded UI strings with translation keys. Update mode selector labels, form labels, button labels, and result labels. Do NOT translate salary hike calculation formulas."
        },
        {
          "path": "frontend/src/components/calculators/SGPACalculator.tsx",
          "operation": "modify",
          "description": "Replace hardcoded UI strings with translation keys. Update form labels, button labels ('Add Course', 'Remove', 'Calculate SGPA'), and result labels. Do NOT translate SGPA calculation logic."
        },
        {
          "path": "frontend/src/components/calculators/SimpleInterestCalculator.tsx",
          "operation": "modify",
          "description": "Replace hardcoded UI strings with translation keys. Update form labels, button labels, and result labels. Do NOT translate simple interest formula."
        },
        {
          "path": "frontend/src/components/calculators/TimeDurationCalculator.tsx",
          "operation": "modify",
          "description": "Replace hardcoded UI strings with translation keys. Update mode selector labels, form labels, button labels, and result labels. Do NOT translate time calculation logic."
        },
        {
          "path": "frontend/src/components/BreadcrumbNavigation.tsx",
          "operation": "modify",
          "description": "Update BreadcrumbNavigation component to use translation keys for breadcrumb item labels. Use t() function from useLanguage hook to translate labels like 'Home', 'Calculators', 'PDF Tools', 'Image Tools', specific tool names, etc. Preserve existing breadcrumb structure and JSON-LD generation logic."
        },
        {
          "path": "frontend/src/components/RelatedTools.tsx",
          "operation": "modify",
          "description": "Update RelatedTools component to use translation keys for tool names, descriptions, and button labels ('Try Now'). Use t() function from useLanguage hook. Preserve existing layout and navigation logic."
        },
        {
          "path": "frontend/src/components/ToolCategories.tsx",
          "operation": "modify",
          "description": "Update ToolCategories component to use translation keys for category titles ('Calculator Hub', 'PDF Tools', 'Image Tools'), descriptions, and tool counts. Use t() function from useLanguage hook. Preserve existing card layout."
        },
        {
          "path": "frontend/src/components/Hero.tsx",
          "operation": "modify",
          "description": "Update Hero component to use translation keys for headline, description, CTA button labels ('Explore Tools', 'Learn More'), and feature badges ('100% Private', '20+ Tools', 'Free'). Use t() function from useLanguage hook. Preserve existing layout and image references."
        }
      ]
    },
    {
      "id": "REQ-93",
      "summary": "Implement lazy loading for translation files with loading states",
      "acceptanceCriteria": [
        "Translation files loaded on-demand via dynamic import()",
        "Loading indicator shown during language switch",
        "Translations cached after first load",
        "Error handling for network failures",
        "No full page reload on language change"
      ],
      "file_operations": [
        {
          "path": "frontend/src/contexts/LanguageContext.tsx",
          "operation": "modify",
          "description": "Update LanguageContext to implement lazy loading of translation JSON files. Use dynamic import() to load language files only when setLanguage is called: `const translations = await import(`./locales/${lang}.json`)`. Maintain a cache object to store loaded translations and avoid re-fetching. Set isLoading state to true during import, false after completion. Add error handling for failed imports with try-catch block and fallback to English translations on error. Show error toast notification on load failure. Ensure no page reload occurs during language switch."
        }
      ]
    },
    {
      "id": "REQ-94",
      "summary": "Update SEO component to render language-specific meta titles and descriptions",
      "acceptanceCriteria": [
        "SEO component accepts language prop",
        "Meta titles use translated strings",
        "Meta descriptions use translated strings",
        "Open Graph tags reflect current language",
        "Twitter Card tags use current language",
        "Canonical and hreflang tags properly set"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SEO.tsx",
          "operation": "modify",
          "description": "Modify SEO component to accept language parameter and use translated meta titles and descriptions. Import useLanguage hook to access t() function. Update title, description, og:title, og:description, twitter:title, and twitter:description meta tags to use translation keys passed as props (e.g., t(titleKey)). Ensure language-specific canonical URLs are constructed. Preserve existing Open Graph, Twitter Card, and structured data functionality."
        }
      ]
    },
    {
      "id": "REQ-95",
      "summary": "Implement browser language auto-detection on initial page load",
      "acceptanceCriteria": [
        "Browser language detected on first visit",
        "Language code mapped to supported languages",
        "Falls back to English for unsupported languages",
        "Optional redirect to detected language URL",
        "User preference in localStorage overrides detection",
        "Detection only runs once per session"
      ],
      "file_operations": [
        {
          "path": "frontend/src/contexts/LanguageContext.tsx",
          "operation": "modify",
          "description": "Add browser language auto-detection logic in LanguageProvider initialization. Check if language preference exists in localStorage first. If not, read navigator.language or navigator.languages[0], extract language code (first 2 characters), and map to supported languages (en, hi, bn, ta, te, mr, gu, kn, ml, ur). Fall back to 'en' for unsupported languages. Optionally use useNavigate to redirect to detected language URL if different from current URL (check window.location.pathname). Set a session flag in sessionStorage to prevent re-detection on subsequent page navigations within the same session."
        }
      ]
    },
    {
      "id": "REQ-96",
      "summary": "Integrate LanguageSelector into Header component with mobile responsiveness",
      "acceptanceCriteria": [
        "LanguageSelector integrated in Header component",
        "Positioned appropriately in header layout",
        "Mobile responsive with touch-friendly UI",
        "Dropdown closes on language selection",
        "Language switch works on all page types",
        "No layout shifts or broken UI after switch"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Import and integrate LanguageSelector component into Header. Position LanguageSelector after navigation links but before any action buttons (if present). Use flexbox/grid to ensure proper spacing and alignment. On mobile, ensure LanguageSelector is accessible and has touch-friendly tap targets. Test that dropdown closes after language selection. Verify layout remains stable across all screen sizes after language switch. Preserve existing header functionality (logo, navigation, sticky positioning)."
        }
      ]
    },
    {
      "id": "REQ-97",
      "summary": "Update sitemap.xml generation to include language-specific URLs for all pages",
      "acceptanceCriteria": [
        "Sitemap includes URLs for all 9 languages",
        "All calculator pages have language variants",
        "All PDF tool pages have language variants",
        "All image tool pages have language variants",
        "All resume builder pages have language variants",
        "Hub pages have language variants",
        "Priority and changefreq preserved per page type"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/generateSitemap.ts",
          "operation": "create",
          "description": "Create sitemap generation utility that programmatically generates sitemap.xml with language-specific URLs for all 9 languages (en, hi, bn, ta, te, mr, gu, kn, ml, ur). For each page (calculators, PDF tools, image tools, resume builder templates, hub pages, legal pages), generate 9 URL variants following pattern: base URL + '/' + language code + page path (e.g., 'https://docmastertools.com/hi/calculators/cgpa-calculator'). For English, generate URLs both with and without '/en' prefix for backward compatibility. Preserve existing priority and changefreq values based on page type (e.g., priority 0.9 for calculator pages, 0.8 for tools). Output as valid XML sitemap format. This utility should be run during build process to generate frontend/public/sitemap.xml."
        },
        {
          "path": "frontend/public/sitemap.xml",
          "operation": "modify",
          "description": "Replace existing sitemap.xml content with generated sitemap containing all language-specific URLs. Include URL entries for all 9 languages for every page: all 20+ calculator pages, 16 PDF tool pages, 8+ image tool pages, 14 resume templates, hub pages (calculators, PDF tools, image tools, resume builder), legal pages (privacy, terms, disclaimer), and homepage. For English pages, include both versioned (/en/path) and non-versioned (/path) URLs. Maintain proper XML structure with <urlset>, <url>, <loc>, <lastmod>, <changefreq>, and <priority> tags for each entry."
        }
      ]
    }
  ]
}