{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Advanced Resume Builder Module with 14 Templates",
  "requirements": [
    {
      "id": "REQ-72",
      "summary": "Create ResumeBuilderPage component displaying 14 resume templates in two categories",
      "acceptanceCriteria": [
        "ResumeBuilderPage component exists at frontend/src/pages/ResumeBuilderPage.tsx",
        "Route /resume-builder is configured in App.tsx",
        "Page displays two distinct category sections: Indian Format and International Format",
        "Each category shows 7 template cards with names matching the specification exactly",
        "Template cards are clickable and lead to individual template builders"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ResumeBuilderPage.tsx",
          "operation": "modify",
          "description": "Replace existing ResumeBuilderPage with new hub page displaying 14 resume templates organized into two categories: Indian Format (Fresher Resume, Government Job Resume, Private Job Resume, Hindi Resume, Biodata for Marriage, Teacher Resume, Police/Army Resume) and International Format (ATS Friendly Resume, US Resume, UK CV Format, Canada Resume, Europass CV, Creative Resume, Corporate Resume). Each template card includes icon, name, brief description, and navigation to individual builder route. Add SEO component with title 'Resume Builder - 14 Professional Templates | Document Master Tools' and meta description. Include BreadcrumbNavigation and AdPlaceholder components (top banner after H1)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route configuration for /resume-builder displaying ResumeBuilderPage and 14 individual template routes following pattern /resume-builder/:templateSlug where templateSlug matches: fresher-resume, government-job-resume, private-job-resume, hindi-resume, biodata-for-marriage, teacher-resume, police-army-resume, ats-friendly-resume, us-resume, uk-cv-format, canada-resume, europass-cv, creative-resume, corporate-resume. Each template route renders ResumeTemplateBuilderPage component with template prop."
        }
      ]
    },
    {
      "id": "REQ-73",
      "summary": "Implement multi-step form wizard with progressive sections and add/remove functionality",
      "acceptanceCriteria": [
        "Form wizard component displays step indicators showing current progress",
        "Each section (Personal Info, Education, Experience, Skills, Projects, Certifications, Languages, Achievements, References) has dedicated form fields",
        "Users can add multiple entries for Education, Experience, Skills, Projects, Certifications, Languages, Achievements, References",
        "Each repeatable section has Add and Remove buttons",
        "Form validates required fields before allowing progression to next step",
        "Navigation between steps works via Next/Previous buttons"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/resume/ResumeFormWizard.tsx",
          "operation": "create",
          "description": "Create multi-step form wizard component with step indicator showing 9 sections: Personal Info, Education, Experience, Skills, Projects, Certifications, Languages, Achievements, References. Implement state management for current step, form data, and validation. Personal Info section includes fields: name, email, phone, address, LinkedIn, portfolio URL. Repeatable sections (Education, Experience, Skills, Projects, Certifications, Languages, Achievements, References) include Add Entry and Remove buttons with dynamic form arrays. Each section validates required fields before allowing Next step navigation. Include Previous/Next buttons with disabled states based on validation. Emit onChange events to parent component with complete form data."
        },
        {
          "path": "frontend/src/types/resume.ts",
          "operation": "create",
          "description": "Define TypeScript interfaces for resume data structures including ResumeData (root), PersonalInfo, Education, Experience, Skill, Project, Certification, Language, Achievement, Reference. Include optional fields and validation constraints. Define TemplateType enum with all 14 template names as string literals. Define ColorTheme type with palette name and color values. Export all types for use across resume components."
        }
      ]
    },
    {
      "id": "REQ-74",
      "summary": "Create live preview component with real-time rendering matching selected template",
      "acceptanceCriteria": [
        "Preview pane displays side-by-side with form on desktop layouts",
        "Preview updates in real-time as user types or modifies any field",
        "Preview shows exact layout and styling that will appear in downloaded PDF",
        "Preview is scrollable and maintains A4 aspect ratio",
        "All template-specific formatting rules are applied in preview"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/resume/ResumePreview.tsx",
          "operation": "create",
          "description": "Create live preview component that renders resume in A4 aspect ratio (210mm x 297mm / 8.27\" x 11.69\"). Accept props: resumeData, selectedTemplate, colorTheme. Use React.memo for performance optimization. Render template-specific layout by importing and conditionally rendering template components based on selectedTemplate prop. Apply colorTheme to headers, borders, and accent elements. Maintain scrollable container with fixed aspect ratio. Update instantly on prop changes without re-mount."
        },
        {
          "path": "frontend/src/components/resume/templates/FresherResumeTemplate.tsx",
          "operation": "create",
          "description": "Create Fresher Resume template component for Indian job market. Layout: header with photo (if provided), name, contact details, professional summary, education section, skills with bullet points, projects, certifications, languages. Apply template-specific typography and spacing. Accept resumeData and colorTheme props. Use Tailwind classes for styling matching A4 proportions."
        },
        {
          "path": "frontend/src/components/resume/templates/GovernmentJobResumeTemplate.tsx",
          "operation": "create",
          "description": "Create Government Job Resume template component for Indian government applications. Layout: formal header with photo, personal details in structured format, education with marks/grades, experience in reverse chronological order, skills, certifications, languages, references. Use formal typography and conservative styling. Accept resumeData and colorTheme props."
        },
        {
          "path": "frontend/src/components/resume/templates/PrivateJobResumeTemplate.tsx",
          "operation": "create",
          "description": "Create Private Job Resume template component for Indian private sector. Layout: modern header with photo, professional summary, key skills highlighted, experience with achievements, education, projects, certifications. Use contemporary styling with moderate color accents. Accept resumeData and colorTheme props."
        },
        {
          "path": "frontend/src/components/resume/templates/HindiResumeTemplate.tsx",
          "operation": "create",
          "description": "Create Hindi Resume template component with bilingual support. Layout: header with photo, personal info, professional summary in Hindi, education, experience, skills in Hindi/English mix. Use Hindi-friendly fonts and RTL-aware spacing. Accept resumeData and colorTheme props."
        },
        {
          "path": "frontend/src/components/resume/templates/BiodataForMarriageTemplate.tsx",
          "operation": "create",
          "description": "Create Biodata for Marriage template component following Indian matrimonial format. Layout: centered photo, personal details (name, DOB, height, religion, caste, gotra), family details, education, profession, contact information. Use traditional styling with decorative borders. Accept resumeData and colorTheme props."
        },
        {
          "path": "frontend/src/components/resume/templates/TeacherResumeTemplate.tsx",
          "operation": "create",
          "description": "Create Teacher Resume template component for education sector. Layout: header with photo, teaching philosophy/summary, education credentials, teaching experience with subjects taught, certifications, skills (classroom management, curriculum development), achievements, references. Use professional academic styling. Accept resumeData and colorTheme props."
        },
        {
          "path": "frontend/src/components/resume/templates/PoliceArmyResumeTemplate.tsx",
          "operation": "create",
          "description": "Create Police/Army Resume template component for defense services. Layout: formal header with photo, personal details, physical attributes, education, training/certifications, relevant experience, skills, references. Use military-style structured format with clear sections. Accept resumeData and colorTheme props."
        },
        {
          "path": "frontend/src/components/resume/templates/ATSFriendlyResumeTemplate.tsx",
          "operation": "create",
          "description": "Create ATS Friendly Resume template component optimized for applicant tracking systems. Layout: no photo, simple header, contact info, professional summary with keywords, experience with action verbs and metrics, education, skills in comma-separated format, certifications. Use minimal styling, standard fonts, no tables/graphics. Accept resumeData and colorTheme props."
        },
        {
          "path": "frontend/src/components/resume/templates/USResumeTemplate.tsx",
          "operation": "create",
          "description": "Create US Resume template component following American format. Layout: no photo, header with name and contact, professional summary, experience with quantified achievements, education, skills, certifications. Use clean modern design with strategic white space. Accept resumeData and colorTheme props."
        },
        {
          "path": "frontend/src/components/resume/templates/UKCVTemplate.tsx",
          "operation": "create",
          "description": "Create UK CV template component following British format. Layout: optional small photo, header, personal profile, work experience (detailed and chronological), education, key skills, interests/hobbies, references available upon request. Use British English conventions. Accept resumeData and colorTheme props."
        },
        {
          "path": "frontend/src/components/resume/templates/CanadaResumeTemplate.tsx",
          "operation": "create",
          "description": "Create Canada Resume template component following Canadian format. Layout: no photo, header, professional summary, core competencies, professional experience with achievements, education, certifications, volunteer work. Use clean professional layout. Accept resumeData and colorTheme props."
        },
        {
          "path": "frontend/src/components/resume/templates/EuropassCVTemplate.tsx",
          "operation": "create",
          "description": "Create Europass CV template component following EU standard format. Layout: photo (optional), personal information, work experience, education and training, personal skills (language skills with CEFR levels, communication skills, organizational skills, digital skills), additional information. Use standardized Europass section headings and formatting. Accept resumeData and colorTheme props."
        },
        {
          "path": "frontend/src/components/resume/templates/CreativeResumeTemplate.tsx",
          "operation": "create",
          "description": "Create Creative Resume template component for design/creative industries. Layout: asymmetric header with optional photo, visual skills representation (progress bars/icons), experience with project highlights, education, portfolio links prominently displayed. Use bold colors, modern typography, creative visual elements. Accept resumeData and colorTheme props."
        },
        {
          "path": "frontend/src/components/resume/templates/CorporateResumeTemplate.tsx",
          "operation": "create",
          "description": "Create Corporate Resume template component for executive/corporate positions. Layout: no photo, executive summary, core competencies grid, professional experience with leadership achievements, education, board memberships/affiliations, speaking engagements. Use sophisticated minimal design with elegant typography. Accept resumeData and colorTheme props."
        }
      ]
    },
    {
      "id": "REQ-75",
      "summary": "Add photo upload with drag-and-drop, crop/resize, and template-aware placement",
      "acceptanceCriteria": [
        "Photo upload section supports drag-and-drop and click-to-upload",
        "Uploaded image displays in crop/resize preview with aspect ratio controls",
        "Indian format templates display uploaded photo in header or sidebar",
        "International format templates either hide photo or show it minimally based on template design",
        "Photo can be removed after upload"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/resume/PhotoUploadSection.tsx",
          "operation": "create",
          "description": "Create photo upload component with drag-and-drop zone and click-to-upload button. Handle image file validation (JPEG, PNG, max 5MB). After upload, display crop/resize preview with aspect ratio selector (1:1, 3:4, 4:3). Provide crop controls using HTML canvas or react-easy-crop library. Include Remove Photo button. Emit cropped image data URL to parent component. Show upload instructions and file size guidance."
        },
        {
          "path": "frontend/src/hooks/usePhotoUpload.ts",
          "operation": "create",
          "description": "Create custom hook for managing photo upload state and operations. Handle file reading, validation, crop state, aspect ratio changes, and final cropped image generation. Return uploadedPhoto, cropSettings, handleFileUpload, handleCrop, handleRemove, and isProcessing state. Use FileReader API for local file reading and Canvas API for cropping."
        }
      ]
    },
    {
      "id": "REQ-76",
      "summary": "Implement custom color theme selector with 6 predefined palettes",
      "acceptanceCriteria": [
        "Color theme selector displays 6+ color palette options",
        "Selecting a color palette instantly updates preview with new colors",
        "Colors apply to headers, borders, section dividers, and accent elements",
        "Text remains readable with proper contrast ratios",
        "Selected theme persists when downloading PDF"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/resume/ColorThemeSelector.tsx",
          "operation": "create",
          "description": "Create color theme selector component displaying 6 predefined color palettes: Professional Blue (#1e40af, #3b82f6, #dbeafe), Corporate Black (#1f2937, #4b5563, #e5e7eb), Creative Purple (#7c3aed, #a78bfa, #ede9fe), Modern Teal (#0d9488, #14b8a6, #ccfbf1), Classic Gray (#374151, #6b7280, #f3f4f6), Elegant Maroon (#991b1b, #dc2626, #fee2e2). Display palette swatches as clickable cards showing primary, secondary, and light colors. Emit selected theme to parent component. Show checkmark on selected theme."
        },
        {
          "path": "frontend/src/lib/colorThemes.ts",
          "operation": "create",
          "description": "Define color theme constants and utility functions. Export COLOR_THEMES array with 6 predefined palettes, each containing name, primary, secondary, light, and text color values. Provide applyThemeToElement utility function that accepts theme and returns CSS class mappings. Include contrast ratio validation function ensuring text readability (WCAG AA compliance)."
        }
      ]
    },
    {
      "id": "REQ-77",
      "summary": "Create auto-formatting logic for skills, dates, phone numbers, and capitalization",
      "acceptanceCriteria": [
        "Skills entries automatically convert to bullet point format",
        "Date inputs auto-format to MM/YYYY pattern",
        "Phone numbers format to +91-XXXXX-XXXXX for Indian templates",
        "Phone numbers format to international standard for International templates",
        "Proper nouns in name fields auto-capitalize first letters",
        "Consistent line spacing and margins apply across all sections"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/resumeFormatters.ts",
          "operation": "create",
          "description": "Create formatting utility functions: formatSkillsAsBullets (converts comma-separated or array to bullet list), formatDateToMMYYYY (accepts Date or string, returns MM/YYYY), formatPhoneNumber (detects template category, formats to +91-XXXXX-XXXXX for Indian, international E.164 for others), capitalizeProperNouns (capitalizes first letter of each word in names), formatExperienceDuration (calculates duration between dates, formats as 'X years Y months'). Export all formatters for use in form components and templates."
        },
        {
          "path": "frontend/src/components/resume/ResumeFormWizard.tsx",
          "operation": "modify",
          "description": "Import formatting functions from resumeFormatters.ts. Apply formatDateToMMYYYY to date inputs onChange. Apply formatPhoneNumber to phone field based on selected template category. Apply capitalizeProperNouns to name fields onChange. Auto-format skills section entries using formatSkillsAsBullets before passing to preview. Ensure formatted values update form state and trigger preview updates."
        }
      ]
    },
    {
      "id": "REQ-78",
      "summary": "Implement PDF download with A4 sizing, intelligent page breaks, and embedded fonts",
      "acceptanceCriteria": [
        "Download PDF button generates PDF file with user's resume data",
        "PDF uses A4 page dimensions (210mm x 297mm)",
        "Page breaks intelligently avoid splitting sections or list items",
        "Fonts are embedded in PDF for consistent cross-platform rendering",
        "Downloaded PDF exactly matches live preview styling",
        "PDF filename includes template name and timestamp"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/pdfGenerator.ts",
          "operation": "create",
          "description": "Create PDF generation utility using jsPDF library. Implement generateResumePDF function accepting resumeData, selectedTemplate, colorTheme. Configure jsPDF with A4 dimensions (210mm x 297mm), orientation portrait. Use html2canvas to capture preview component as image, then add to PDF with proper scaling. Implement intelligent page break detection by analyzing section heights and inserting manual page breaks before sections that would split. Embed fonts using jsPDF font API. Generate filename: 'Resume_{TemplateName}_{Timestamp}.pdf'. Return download promise."
        },
        {
          "path": "frontend/src/hooks/usePDFDownload.ts",
          "operation": "create",
          "description": "Create custom hook for PDF download functionality. Manage download state (idle, generating, ready, error). Provide handleDownloadPDF function that calls generateResumePDF, handles loading states, error catching, and triggers browser download. Return isGenerating, downloadError, handleDownloadPDF, downloadProgress (0-100). Show toast notifications on success/failure."
        },
        {
          "path": "frontend/src/components/resume/DownloadPDFButton.tsx",
          "operation": "create",
          "description": "Create Download PDF button component using usePDFDownload hook. Display button with download icon, show loading spinner when isGenerating is true, disable button during generation. Show progress bar if downloadProgress available. Handle click to trigger PDF generation and download. Use shadcn Button component with primary variant."
        }
      ]
    },
    {
      "id": "REQ-79",
      "summary": "Add basic AI summary generator using local logic without external APIs",
      "acceptanceCriteria": [
        "AI Summary Generator button appears in Personal Info section",
        "Generator analyzes filled experience and skills data locally",
        "Generated summary is 2-3 sentences with professional tone",
        "Summary includes quantifiable experience (years) and key skills",
        "Summary uses action words and achievement-focused language",
        "No external API calls are made during generation",
        "User can edit generated summary after creation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/summaryGenerator.ts",
          "operation": "create",
          "description": "Create local AI summary generator using rule-based logic. Implement generateProfessionalSummary function analyzing experience array (calculate total years), skills array (extract top 3-5 skills), and achievements. Use template patterns: '[X] years of experience in [domain] with expertise in [skills]. Proven track record of [achievement]. Seeking to leverage [skills] in [objective].' Include action verb dictionary (developed, managed, led, implemented, optimized). Randomly select verbs and combine with user data. No external API calls. Return 2-3 sentence summary string."
        },
        {
          "path": "frontend/src/components/resume/SummaryGeneratorButton.tsx",
          "operation": "create",
          "description": "Create AI Summary Generator button component for Personal Info section. Display button with sparkles icon and 'Generate Summary' label. On click, call generateProfessionalSummary with current form data (experience, skills, achievements), show loading state (1-2 second delay for realism), populate professional summary field with generated text. User can edit generated summary in textarea. Include regenerate option. Use shadcn Button component with secondary variant."
        }
      ]
    },
    {
      "id": "REQ-80",
      "summary": "Create individual SEO-friendly pages for each of 14 resume templates with unique meta, FAQs, and internal links",
      "acceptanceCriteria": [
        "Each of 14 templates has individual route at /resume-builder/[template-slug]",
        "SEO component is integrated with unique title for each template",
        "Meta descriptions are 150-160 characters highlighting template benefits",
        "Open Graph tags include og:title, og:description, og:image",
        "FAQ section with 3-5 questions specific to each template format",
        "Internal links to Calculator Hub, PDF Tools, and Image Tools are present",
        "BreadcrumbNavigation component shows Home > Resume Builder > [Template Name]"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/resume-builder/ResumeTemplateBuilderPage.tsx",
          "operation": "create",
          "description": "Create individual resume template builder page component accepting templateSlug param from route. Map templateSlug to template configuration (name, description, FAQs, seoTitle, metaDescription). Render SEO component with unique title '[Template Name] Resume Builder - Free Online Tool | Document Master Tools' and meta description highlighting template benefits. Include Open Graph tags (og:title, og:description, og:image using generated/resume-builder-icon-transparent.dim_64x64.png). Display BreadcrumbNavigation with Home > Resume Builder > [Template Name]. Render ResumeFormWizard and ResumePreview side-by-side with selected template. Include AdPlaceholder components (top banner after H1, in-content between form and preview, sidebar on >1024px). Add template-specific FAQ section with 3-5 Q&As. Include internal links section to Calculator Hub, PDF Tools, Image Tools at bottom."
        },
        {
          "path": "frontend/src/data/resumeTemplateConfigs.ts",
          "operation": "create",
          "description": "Define configuration objects for all 14 resume templates. Each config includes: slug, name, category (Indian/International), description, seoTitle, metaDescription (150-160 chars), faqs array with 3-5 template-specific questions and answers, targetAudience, keyFeatures array. Export RESUME_TEMPLATE_CONFIGS array and getTemplateBySlug utility function."
        }
      ]
    },
    {
      "id": "REQ-81",
      "summary": "Ensure full mobile responsiveness for all Resume Builder components",
      "acceptanceCriteria": [
        "Resume Builder hub displays template grid in 1 column on mobile (<768px)",
        "Form wizard uses vertical layout on mobile with collapsible sections",
        "All input fields are touch-friendly with appropriate sizing",
        "Live preview appears below form on mobile devices",
        "Preview scales properly for mobile viewport widths",
        "Navigation and buttons are easily tappable on touch devices",
        "Layout remains functional and usable on 320px width screens"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ResumeBuilderPage.tsx",
          "operation": "modify",
          "description": "Add responsive grid classes for template cards: grid-cols-1 (mobile default), md:grid-cols-2 (tablets ≥768px), lg:grid-cols-3 (desktop ≥1024px). Ensure cards stack vertically on mobile with full width. Test layout at 320px minimum width."
        },
        {
          "path": "frontend/src/components/resume/ResumeFormWizard.tsx",
          "operation": "modify",
          "description": "Wrap form in responsive container with vertical layout on mobile. Implement collapsible sections using shadcn Accordion component on mobile (<768px), expanded sections on desktop. Increase input field min-height to 44px for touch-friendly interaction. Add responsive step indicator: horizontal on desktop, vertical/collapsed on mobile. Ensure Next/Previous buttons are large enough (min 44x44px) and properly spaced for touch."
        },
        {
          "path": "frontend/src/pages/resume-builder/ResumeTemplateBuilderPage.tsx",
          "operation": "modify",
          "description": "Implement responsive layout: side-by-side form and preview on desktop (≥1024px) using grid-cols-2, stacked layout on mobile with form above preview. Preview component below form on mobile with reduced scale (80-90%) to fit mobile viewport. Hide sidebar ads on mobile. Ensure all navigation buttons and CTAs are touch-friendly (44px minimum). Test scrolling behavior on mobile devices."
        }
      ]
    },
    {
      "id": "REQ-82",
      "summary": "Style Resume Builder with modern UI matching Tailwind design system",
      "acceptanceCriteria": [
        "Form sections use card-based layout with rounded corners and shadows",
        "Step transitions have smooth fade or slide animations",
        "Progress indicator displays percentage completion",
        "Save Draft button stores form data to localStorage",
        "Primary action buttons (Next, Download PDF) use consistent brand colors",
        "Spacing and typography match existing tool pages",
        "Color scheme follows Tailwind configuration with light/dark mode support"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/resume/ResumeFormWizard.tsx",
          "operation": "modify",
          "description": "Style form sections using shadcn Card component with rounded-lg and shadow-md classes. Implement progress indicator showing completion percentage (calculated from filled required fields / total required fields * 100). Add smooth transitions between steps using Tailwind transition-opacity duration-300. Create Save Draft button that serializes current form state to localStorage with key 'resume_draft_{template}'. Use primary brand colors for Next and Download PDF buttons (refer to frontend/tailwind.config.js). Match spacing (space-y-6 for sections, space-y-4 for fields) and typography (text-lg for headings, text-sm for labels) with existing calculator/PDF tool pages."
        },
        {
          "path": "frontend/src/hooks/useDraftStorage.ts",
          "operation": "create",
          "description": "Create custom hook for managing resume draft storage. Implement saveDraft function serializing resumeData to JSON and storing in localStorage with timestamp. Implement loadDraft function retrieving and parsing stored draft. Implement clearDraft function removing draft. Auto-save on form change with debounce (2 seconds). Return savedAt timestamp, saveDraft, loadDraft, clearDraft, hasDraft boolean. Handle localStorage quota errors gracefully."
        }
      ]
    },
    {
      "id": "REQ-83",
      "summary": "Update HomePage to add Resume Builder section with category preview cards",
      "acceptanceCriteria": [
        "HomePage includes Resume Builder section after existing tool sections",
        "Section header displays total count (14 Resume Templates)",
        "Two category cards show Indian Format (7) and International Format (7)",
        "Each category card has icon, description, and View Templates button",
        "Cards link to /resume-builder with smooth scroll or navigation",
        "Section styling matches existing Calculator, PDF, and Image Tools sections"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Add Resume Builder section after Image Tools section and before Footer. Use same container and spacing as existing tool sections (max-w-7xl mx-auto px-4 py-16). Display section header 'Resume Builder' with subtitle '14 Professional Resume Templates' using text-3xl font-bold. Create two category preview cards in grid-cols-1 md:grid-cols-2 layout. Each card shows category icon (use generated/resume-builder-icon-transparent.dim_64x64.png), category name (Indian Format / International Format), template count (7 templates each), brief description (Indian Format: 'Tailored for Indian job market and cultural requirements' / International Format: 'Optimized for global standards and ATS systems'), and 'View Templates' button linking to /resume-builder. Match card styling with existing tool category cards (rounded-lg, shadow-md, hover effects)."
        }
      ]
    },
    {
      "id": "REQ-84",
      "summary": "Update Header component navigation to include Resume Builder link",
      "acceptanceCriteria": [
        "Header component includes Resume Builder navigation link",
        "Link positioned logically in navigation order",
        "Link styling matches other header navigation items",
        "Link is responsive and displays properly on mobile menu",
        "Clicking link navigates to /resume-builder route"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Add Resume Builder navigation link to Header component after Calculator Hub link. Use same styling as existing navigation items (text-sm font-medium hover:text-primary transition-colors). Wrap link in Link component from react-router-dom targeting /resume-builder route. On mobile menu, include Resume Builder as menu item with proper spacing and tap target sizing. Ensure responsive behavior matches existing navigation items."
        }
      ]
    },
    {
      "id": "REQ-85",
      "summary": "Integrate AdPlaceholder components into Resume Builder pages with strategic placement",
      "acceptanceCriteria": [
        "Top banner AdPlaceholder appears after H1 on all Resume Builder pages",
        "In-content AdPlaceholder positioned between form and preview on desktop",
        "Sidebar AdPlaceholder displays in right column on viewports >1024px",
        "Ads use aspect ratio boxes to prevent layout shift",
        "Ads do not obscure form inputs or preview content",
        "Ad containers are marked with 'Advertisement' label"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ResumeBuilderPage.tsx",
          "operation": "modify",
          "description": "Import AdPlaceholder component. Add top banner ad (format='banner' 728×90) immediately after H1 heading and before template grid. Ensure ad container has proper spacing (mb-8) and is centered on page."
        },
        {
          "path": "frontend/src/pages/resume-builder/ResumeTemplateBuilderPage.tsx",
          "operation": "modify",
          "description": "Import AdPlaceholder component. Add top banner ad (format='banner' 728×90) after H1 and breadcrumbs. Add in-content ad (format='in-content' 300×250) between form wizard and preview sections on desktop layout with mx-4 spacing. Add sidebar ad (format='sidebar' 160×600) in right column when viewport width >1024px using conditional rendering with hidden lg:block classes. Ensure ads use aspect-ratio boxes to prevent layout shift. Add 'Advertisement' label above each ad using text-xs text-muted-foreground."
        }
      ]
    },
    {
      "id": "REQ-86",
      "summary": "Update App.tsx routing to include all Resume Builder routes with correct slugs",
      "acceptanceCriteria": [
        "Route /resume-builder is configured in App.tsx",
        "All 14 individual template routes are configured with correct slugs",
        "Each template route renders appropriate template builder component",
        "Routes follow consistent naming pattern with hyphens",
        "Navigation between hub and individual templates works correctly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Import ResumeBuilderPage and ResumeTemplateBuilderPage components. Add route configuration for /resume-builder rendering ResumeBuilderPage. Add 14 individual template routes following pattern /resume-builder/:templateSlug where templateSlug param matches one of: fresher-resume, government-job-resume, private-job-resume, hindi-resume, biodata-for-marriage, teacher-resume, police-army-resume, ats-friendly-resume, us-resume, uk-cv-format, canada-resume, europass-cv, creative-resume, corporate-resume. Each route renders ResumeTemplateBuilderPage component which reads templateSlug from useParams hook. Place Resume Builder routes after Image Tools routes and before legal pages. Ensure routes are properly nested within BrowserRouter."
        }
      ]
    }
  ]
}